[
  {
  "_id":"5b312b941c74674b40f84769",
  "date_created":"2014-04-14",
  "date_reviewed":"",
  "url":"https://policies.google.com/terms",
  "statements":[
    {
      "text":"Additional terms will be available with the relevant Services, and those    additional terms become part of your agreement with us if you use those Services.",
      "tag":["Update to terms"],
      "comment":"will change with next version."
    }
  ],
  "risk_assessment":"To use this ToS do ### and dont do ###",
  "dom":"Google Terms of Service – Privacy & Terms – Google  #  ![Google](/images/branding/googlelogo/1x/googlelogo_color_116x41dp.png)  ##  Privacy & Terms  Skip to content    * Overview    * Privacy Policy    * Terms of Service    * Technologies and Principles    * FAQ    * My Account     * Terms of Service    * Updates   #  Google Terms of Service  This is an archived version of our Terms of Service. View the  current version or  all past versions  .  Last modified: April 14, 2014 (  view archived versions  )  ##  Welcome to Google!  Thanks for using our products and services (“Services”). The Services are provided by Google Inc. (“Google”), located at 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States.  By using our Services, you are agreeing to these terms. Please read them carefully.  Our Services are very diverse, so sometimes additional terms or product requirements (including age requirements) may apply. Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.  ##  Using our Services  You must follow any policies made available to you within the Services.  Don’t misuse our Services. For example, don’t interfere with our Services or try to access them using a method other than the interface and the instructions that we provide. You may use our Services only as permitted by law, including applicable export and re-export control laws and regulations. We may suspend or stop providing our Services to you if you do not comply with our terms or policies or if we are investigating suspected misconduct.  Using our Services does not give you ownership of any intellectual property rights in our Services or the content you access. You may not use content from our Services unless you obtain permission from its owner or are otherwise permitted by law. These terms do not grant you the right to use any branding or logos used in our Services. Don’t remove, obscure, or alter any legal notices displayed in or along with our Services.  Our Services display some content that is not Google’s. This content is the sole responsibility of the entity that makes it available. We may review content to determine whether it is illegal or violates our policies, and we may remove or refuse to display content that we reasonably believe violates our policies or the law. But that does not necessarily mean that we review content, so please don’t assume that we do.  In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.  Some of our Services are available on mobile devices. Do not use such Services in a way that distracts you and prevents you from obeying traffic or safety laws.  ##  Your Google Account  You may need a Google Account in order to use some of our Services. You may create your own Google Account, or your Google Account may be assigned to you by an administrator, such as your employer or educational institution. If you are using a Google Account assigned to you by an administrator, different or additional terms may apply and your administrator may be able to access or disable your account.  To protect your Google Account, keep your password confidential. You are responsible for the activity that happens on or through your Google Account. Try not to reuse your Google Account password on third-party applications. If you learn of any unauthorized use of your password or Google Account,  follow these instructions  .  ##  Privacy and Copyright Protection  Google’s  privacy policies  explain how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policies.  We respond to notices of alleged copyright infringement and terminate accounts of repeat infringers according to the process set out in the U.S. Digital Millennium Copyright Act.  We provide information to help copyright holders manage their intellectual property online. If you think somebody is violating your copyrights and want to notify us, you can find information about submitting notices and Google’s policy about responding to notices  in our Help Center  .  ##  Your Content in our Services  Some of our Services allow you to upload, submit, store, send or receive content. You retain ownership of any intellectual property rights that you hold in that content. In short, what belongs to you stays yours.  When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. The rights you grant in this license are for the limited purpose of operating, promoting, and improving our Services, and to develop new ones. This license continues even if you stop using our Services (for example, for a business listing you have added to Google Maps). Some Services may offer you ways to access and remove content that has been provided to that Service. Also, in some of our Services, there are terms or settings that narrow the scope of our use of the content submitted in those Services. Make sure you have the necessary rights to grant us this license for any content that you submit to our Services.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection. This analysis occurs as the content is sent, received, and when it is stored.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our Services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account. For example, you can choose your settings so your name and photo do not appear in an ad.  You can find more information about how Google uses and stores content in the privacy policy or additional terms for particular Services. If you submit feedback or suggestions about our Services, we may use your feedback or suggestions without obligation to you.  ##  About Software in our Services  When a Service requires or includes downloadable software, this software may update automatically on your device once a new version or feature is available. Some Services may let you adjust your automatic update settings.  Google gives you a personal, worldwide, royalty-free, non-assignable and non- exclusive license to use the software provided to you by Google as part of the Services. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by these terms. You may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  Open source software is important to us. Some software used in our Services may be offered under an open source license that we will make available to you. There may be provisions in the open source license that expressly override some of these terms.  ##  Modifying and Terminating our Services  We are constantly changing and improving our Services. We may add or remove functionalities or features, and we may suspend or stop a Service altogether.  You can stop using our Services at any time, although we’ll be sorry to see you go. Google may also stop providing Services to you, or add or create new limits to our Services at any time.  We believe that you own your data and preserving your access to such data is important. If we discontinue a Service, where reasonably possible, we will give you reasonable advance notice and a chance to get information out of that Service.  ##  Our Warranties and Disclaimers  We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don’t promise about our Services.  OTHER THAN AS EXPRESSLY SET OUT IN THESE TERMS OR ADDITIONAL TERMS, NEITHER GOOGLE NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE SERVICES. FOR EXAMPLE, WE DON’T MAKE ANY COMMITMENTS ABOUT THE CONTENT WITHIN THE SERVICES, THE SPECIFIC FUNCTIONS OF THE SERVICES, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE THE SERVICES “AS IS”.  SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES.  ##  Liability for our Services  WHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE’S SUPPLIERS AND DISTRIBUTORS, WILL NOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA, FINANCIAL LOSSES OR INDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.  TO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIMS UNDER THESE TERMS, INCLUDING FOR ANY IMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE SERVICES (OR, IF WE CHOOSE, TO SUPPLYING YOU THE SERVICES AGAIN).  IN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.  ##  Business uses of our Services  If you are using our Services on behalf of a business, that business accepts these terms. It will hold harmless and indemnify Google and its affiliates, officers, agents, and employees from any claim, suit or action arising from or related to the use of the Services or violation of these terms, including any liability or expense arising from claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees.  ##  About these Terms  We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of that Service.  If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.  These terms control the relationship between Google and you. They do not create any third party beneficiary rights.  If you do not comply with these terms, and we don’t take action right away, this doesn’t mean that we are giving up any rights that we may have (such as taking action in the future).  If it turns out that a particular term is not enforceable, this will not affect any other terms.  The laws of California, U.S.A., excluding California’s conflict of laws rules, will apply to any disputes arising out of or relating to these terms or the Services. All claims arising out of or relating to these terms or the Services will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.  For information about how to contact Google, please visit our  contact page  .  ###  Our legal policies    * Privacy Policy    * Terms of Service    * FAQ   ###  More information    * Technologies and Principles    * Advertising    * How Google uses cookies    * How Google uses pattern recognition    * Types of location data used by Google     * How Google Wallet uses credit card numbers    * How Google Voice works    * How Google uses data when you use our partners' sites or apps   ###  Additional resources    * My Account    * Google Safety Center    * Google Product Privacy Guide    * Your privacy, security, and controls     * Google    * About Google    * Privacy    * Terms "
  },
  {
    "_id":"5b312c4d1c74674b40f8476b",
    "date_created":"2017-10-25",
    "date_reviewed":"",
    "url":"https://policies.google.com/terms",
    "statements":[
      {
        "text":"In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.",
        "tag":["Update to terms","technical requirements"],
        "comment":"Important clause."}],
    "risk_assessment":"To use this ToS do ### and dont do ###",
    "dom":"# ![Google](https://www.google.com/images/branding/googlelogo/1x/googlelogo_color_74x24dp.png)  ##  Privacy & Terms  #  Terms of Service    * Overview    * Privacy Policy    * Terms of Service    * Technologies and Principles    * FAQ    * Google Account   # ![Google](https://www.google.com/images/branding/googlelogo/1x/googlelogo_color_74x24dp.png)  ##  Privacy & Terms  #  Privacy & Terms    * Overview    * Privacy Policy    * Terms of Service      * Updates    * Technologies and Principles    * FAQ    * Google Account     *     * Using our Services      * Your Google Account      * Privacy and Copyright Protection      * Your Content in our Services      * About Software in our Services      * Modifying and Terminating our Services      * Our Warranties and Disclaimers      * Liability for our Services      * Business uses of our Services      * About these Terms    * Updates   #  Google Terms of Service  Last modified: October 25, 2017 (  view archived versions  )  ##  Welcome to Google!  Thanks for using our products and services (“Services”). The Services are provided by Google LLC (“Google”), located at 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States.  By using our Services, you are agreeing to these terms. Please read them carefully.  Our Services are very diverse, so sometimes additional terms or product requirements (including age requirements) may apply. Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.  ##  Using our Services  You must follow any policies made available to you within the Services.  Don’t misuse our Services. For example, don’t interfere with our Services or try to access them using a method other than the interface and the instructions that we provide. You may use our Services only as permitted by law, including applicable export and re-export control laws and regulations. We may suspend or stop providing our Services to you if you do not comply with our terms or policies or if we are investigating suspected misconduct.  Using our Services does not give you ownership of any intellectual property rights in our Services or the content you access. You may not use content from our Services unless you obtain permission from its owner or are otherwise permitted by law. These terms do not grant you the right to use any branding or logos used in our Services. Don’t remove, obscure, or alter any legal notices displayed in or along with our Services.  Our Services display some content that is not Google’s. This content is the sole responsibility of the entity that makes it available. We may review content to determine whether it is illegal or violates our policies, and we may remove or refuse to display content that we reasonably believe violates our policies or the law. But that does not necessarily mean that we review content, so please don’t assume that we do.  In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.  Some of our Services are available on mobile devices. Do not use such Services in a way that distracts you and prevents you from obeying traffic or safety laws.  ##  Your Google Account  You may need a Google Account in order to use some of our Services. You may create your own Google Account, or your Google Account may be assigned to you by an administrator, such as your employer or educational institution. If you are using a Google Account assigned to you by an administrator, different or additional terms may apply and your administrator may be able to access or disable your account.  To protect your Google Account, keep your password confidential. You are responsible for the activity that happens on or through your Google Account. Try not to reuse your Google Account password on third-party applications. If you learn of any unauthorized use of your password or Google Account,  follow these instructions  .  ##  Privacy and Copyright Protection  Google’s  privacy policies  explain how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policies.  We respond to notices of alleged copyright infringement and terminate accounts of repeat infringers according to the process set out in the U.S. Digital Millennium Copyright Act.  We provide information to help copyright holders manage their intellectual property online. If you think somebody is violating your copyrights and want to notify us, you can find information about submitting notices and Google’s policy about responding to notices  in our Help Center  .  ##  Your Content in our Services  Some of our Services allow you to upload, submit, store, send or receive content. You retain ownership of any intellectual property rights that you hold in that content. In short, what belongs to you stays yours.  When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. The rights you grant in this license are for the limited purpose of operating, promoting, and improving our Services, and to develop new ones. This license continues even if you stop using our Services (for example, for a business listing you have added to Google Maps). Some Services may offer you ways to access and remove content that has been provided to that Service. Also, in some of our Services, there are terms or settings that narrow the scope of our use of the content submitted in those Services. Make sure you have the necessary rights to grant us this license for any content that you submit to our Services.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection. This analysis occurs as the content is sent, received, and when it is stored.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our Services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account. For example, you can choose your settings so your name and photo do not appear in an ad.  You can find more information about how Google uses and stores content in the privacy policy or additional terms for particular Services. If you submit feedback or suggestions about our Services, we may use your feedback or suggestions without obligation to you.  ##  About Software in our Services  When a Service requires or includes downloadable software, this software may update automatically on your device once a new version or feature is available. Some Services may let you adjust your automatic update settings.  Google gives you a personal, worldwide, royalty-free, non-assignable and non- exclusive license to use the software provided to you by Google as part of the Services. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by these terms. You may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  Open source software is important to us. Some software used in our Services may be offered under an open source license that we will make available to you. There may be provisions in the open source license that expressly override some of these terms.  ##  Modifying and Terminating our Services  We are constantly changing and improving our Services. We may add or remove functionalities or features, and we may suspend or stop a Service altogether.  You can stop using our Services at any time, although we’ll be sorry to see you go. Google may also stop providing Services to you, or add or create new limits to our Services at any time.  We believe that you own your data and preserving your access to such data is important. If we discontinue a Service, where reasonably possible, we will give you reasonable advance notice and a chance to get information out of that Service.  ##  Our Warranties and Disclaimers  We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don’t promise about our Services.  Other than as expressly set out in these terms or additional terms, neither Google nor its suppliers or distributors make any specific promises about the Services. For example, we don’t make any commitments about the content within the Services, the specific functions of the Services, or their reliability, availability, or ability to meet your needs. We provide the Services “as is”.  Some jurisdictions provide for certain warranties, like the implied warranty of merchantability, fitness for a particular purpose and non-infringement. To the extent permitted by law, we exclude all warranties.  ##  Liability for our Services  When permitted by law, Google, and Google’s suppliers and distributors, will not be responsible for lost profits, revenues, or data, financial losses or indirect, special, consequential, exemplary, or punitive damages.  To the extent permitted by law, the total liability of Google, and its suppliers and distributors, for any claims under these terms, including for any implied warranties, is limited to the amount you paid us to use the Services (or, if we choose, to supplying you the Services again).  In all cases, Google, and its suppliers and distributors, will not be liable for any loss or damage that is not reasonably foreseeable.  We recognize that in some countries, you might have legal rights as a consumer. If you are using the Services for a personal purpose, then nothing in these terms or any additional terms limits any consumer legal rights which may not be waived by contract.  ##  Business uses of our Services  If you are using our Services on behalf of a business, that business accepts these terms. It will hold harmless and indemnify Google and its affiliates, officers, agents, and employees from any claim, suit or action arising from or related to the use of the Services or violation of these terms, including any liability or expense arising from claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees.  ##  About these Terms  We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of that Service.  If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.  These terms control the relationship between Google and you. They do not create any third party beneficiary rights.  If you do not comply with these terms, and we don’t take action right away, this doesn’t mean that we are giving up any rights that we may have (such as taking action in the future).  If it turns out that a particular term is not enforceable, this will not affect any other terms.  The courts in some countries will not apply California law to some types of disputes. If you reside in one of those countries, then where California law is excluded from applying, your country’s laws will apply to such disputes related to these terms. Otherwise, you agree that the laws of California, U.S.A., excluding California’s choice of law rules, will apply to any disputes arising out of or relating to these terms or the Services. Similarly, if the courts in your country will not permit you to consent to the jurisdiction and venue of the courts in Santa Clara County, California, U.S.A., then your local jurisdiction and venue will apply to such disputes related to these terms. Otherwise, all claims arising out of or relating to these terms or the services will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.  For information about how to contact Google, please visit our  contact page  .    * Google    * About Google    * Privacy    * Terms "
  },
  {
    "_id":"5b576343dab6e4faa7be9a8c",
    "date_created":"2013-11-11",
    "date_reviewed":"",
    "url":"https://policies.google.com/terms",
    "risk_assessment":"",
    "statements":[],
    "dom":"Google Terms of Service – Privacy &amp; Terms – Google

          #
          ![Google](//www.google.com/images/branding/googlelogo/1x/googlelogo_color_116x41dp.png)

          ##  Privacy &amp; Terms

          Skip to content

            * Overview
            * Privacy Policy
            * Terms of Service
            * Technologies and Principles
            * FAQ
            * My Account

            * Terms of Service
            * Updates

          #  Google Terms of Service

          This is an archived version of our Terms of Service. View the  current version
          or  all past versions  .

          Last modified: November 11, 2013

          ##  Welcome to Google!

          Thanks for using our products and services (“Services”). The Services are
          provided by Google Inc. (“Google”), located at 1600 Amphitheatre Parkway,
          Mountain View, CA 94043, United States.

          By using our Services, you are agreeing to these terms. Please read them
          carefully.

          Our Services are very diverse, so sometimes additional terms or product
          requirements (including age requirements) may apply. Additional terms will be
          available with the relevant Services, and those additional terms become part
          of your agreement with us if you use those Services.

          ##  Using our Services

          You must follow any policies made available to you within the Services.

          Don’t misuse our Services. For example, don’t interfere with our Services or
          try to access them using a method other than the interface and the
          instructions that we provide. You may use our Services only as permitted by
          law, including applicable export and re-export control laws and regulations.
          We may suspend or stop providing our Services to you if you do not comply with
          our terms or policies or if we are investigating suspected misconduct.

          Using our Services does not give you ownership of any intellectual property
          rights in our Services or the content you access. You may not use content from
          our Services unless you obtain permission from its owner or are otherwise
          permitted by law. These terms do not grant you the right to use any branding
          or logos used in our Services. Don’t remove, obscure, or alter any legal
          notices displayed in or along with our Services.

          Our Services display some content that is not Google’s. This content is the
          sole responsibility of the entity that makes it available. We may review
          content to determine whether it is illegal or violates our policies, and we
          may remove or refuse to display content that we reasonably believe violates
          our policies or the law. But that does not necessarily mean that we review
          content, so please don’t assume that we do.

          In connection with your use of the Services, we may send you service
          announcements, administrative messages, and other information. You may opt out
          of some of those communications.

          Some of our Services are available on mobile devices. Do not use such Services
          in a way that distracts you and prevents you from obeying traffic or safety
          laws.

          ##  Your Google Account

          You may need a Google Account in order to use some of our Services. You may
          create your own Google Account, or your Google Account may be assigned to you
          by an administrator, such as your employer or educational institution. If you
          are using a Google Account assigned to you by an administrator, different or
          additional terms may apply and your administrator may be able to access or
          disable your account.

          To protect your Google Account, keep your password confidential. You are
          responsible for the activity that happens on or through your Google Account.
          Try not to reuse your Google Account password on third-party applications. If
          you learn of any unauthorized use of your password or Google Account,  follow
          these instructions  .

          ##  Privacy and Copyright Protection

          Google’s  privacy policies  explain how we treat your personal data and
          protect your privacy when you use our Services. By using our Services, you
          agree that Google can use such data in accordance with our privacy policies.

          We respond to notices of alleged copyright infringement and terminate accounts
          of repeat infringers according to the process set out in the U.S. Digital
          Millennium Copyright Act.

          We provide information to help copyright holders manage their intellectual
          property online. If you think somebody is violating your copyrights and want
          to notify us, you can find information about submitting notices and Google’s
          policy about responding to notices  in our Help Center  .

          ##  Your Content in our Services

          Some of our Services allow you to submit content. You retain ownership of any
          intellectual property rights that you hold in that content. In short, what
          belongs to you stays yours.

          When you upload or otherwise submit content to our Services, you give Google
          (and those we work with) a worldwide license to use, host, store, reproduce,
          modify, create derivative works (such as those resulting from translations,
          adaptations or other changes we make so that your content works better with
          our Services), communicate, publish, publicly perform, publicly display and
          distribute such content. The rights you grant in this license are for the
          limited purpose of operating, promoting, and improving our Services, and to
          develop new ones. This license continues even if you stop using our Services
          (for example, for a business listing you have added to Google Maps). Some
          Services may offer you ways to access and remove content that has been
          provided to that Service. Also, in some of our Services, there are terms or
          settings that narrow the scope of our use of the content submitted in those
          Services. Make sure you have the necessary rights to grant us this license for
          any content that you submit to our Services.

          If you have a Google Account, we may display your Profile name, Profile photo,
          and actions you take on Google or on third-party applications connected to
          your Google Account (such as +1’s, reviews you write and comments you post) in
          our Services, including displaying in ads and other commercial contexts. We
          will respect the choices you make to limit sharing or visibility settings in
          your Google Account. For example, you can choose your settings so your name
          and photo do not appear in an ad.

          You can find more information about how Google uses and stores content in the
          privacy policy or additional terms for particular Services. If you submit
          feedback or suggestions about our Services, we may use your feedback or
          suggestions without obligation to you.

          ##  About Software in our Services

          When a Service requires or includes downloadable software, this software may
          update automatically on your device once a new version or feature is
          available. Some Services may let you adjust your automatic update settings.

          Google gives you a personal, worldwide, royalty-free, non-assignable and non-
          exclusive license to use the software provided to you by Google as part of the
          Services. This license is for the sole purpose of enabling you to use and
          enjoy the benefit of the Services as provided by Google, in the manner
          permitted by these terms. You may not copy, modify, distribute, sell, or lease
          any part of our Services or included software, nor may you reverse engineer or
          attempt to extract the source code of that software, unless laws prohibit
          those restrictions or you have our written permission.

          Open source software is important to us. Some software used in our Services
          may be offered under an open source license that we will make available to
          you. There may be provisions in the open source license that expressly
          override some of these terms.

          ##  Modifying and Terminating our Services

          We are constantly changing and improving our Services. We may add or remove
          functionalities or features, and we may suspend or stop a Service altogether.

          You can stop using our Services at any time, although we’ll be sorry to see
          you go. Google may also stop providing Services to you, or add or create new
          limits to our Services at any time.

          We believe that you own your data and preserving your access to such data is
          important. If we discontinue a Service, where reasonably possible, we will
          give you reasonable advance notice and a chance to get information out of that
          Service.

          ##  Our Warranties and Disclaimers

          We provide our Services using a commercially reasonable level of skill and
          care and we hope that you will enjoy using them. But there are certain things
          that we don’t promise about our Services.

          OTHER THAN AS EXPRESSLY SET OUT IN THESE TERMS OR ADDITIONAL TERMS, NEITHER
          GOOGLE NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE
          SERVICES. FOR EXAMPLE, WE DON’T MAKE ANY COMMITMENTS ABOUT THE CONTENT WITHIN
          THE SERVICES, THE SPECIFIC FUNCTIONS OF THE SERVICES, OR THEIR RELIABILITY,
          AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE THE SERVICES “AS IS”.

          SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY
          OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO
          THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES.

          ##  Liability for our Services

          WHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE’S SUPPLIERS AND DISTRIBUTORS, WILL
          NOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA, FINANCIAL LOSSES OR
          INDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.

          TO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS
          SUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIMS UNDER THESE TERMS, INCLUDING FOR
          ANY IMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE
          SERVICES (OR, IF WE CHOOSE, TO SUPPLYING YOU THE SERVICES AGAIN).

          IN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE
          FOR ANY LOSS OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.

          ##  Business uses of our Services

          If you are using our Services on behalf of a business, that business accepts
          these terms. It will hold harmless and indemnify Google and its affiliates,
          officers, agents, and employees from any claim, suit or action arising from or
          related to the use of the Services or violation of these terms, including any
          liability or expense arising from claims, losses, damages, suits, judgments,
          litigation costs and attorneys’ fees.

          ##  About these Terms

          We may modify these terms or any additional terms that apply to a Service to,
          for example, reflect changes to the law or changes to our Services. You should
          look at the terms regularly. We’ll post notice of modifications to these terms
          on this page. We’ll post notice of modified additional terms in the applicable
          Service. Changes will not apply retroactively and will become effective no
          sooner than fourteen days after they are posted. However, changes addressing
          new functions for a Service or changes made for legal reasons will be
          effective immediately. If you do not agree to the modified terms for a
          Service, you should discontinue your use of that Service.

          If there is a conflict between these terms and the additional terms, the
          additional terms will control for that conflict.

          These terms control the relationship between Google and you. They do not
          create any third party beneficiary rights.

          If you do not comply with these terms, and we don’t take action right away,
          this doesn’t mean that we are giving up any rights that we may have (such as
          taking action in the future).

          If it turns out that a particular term is not enforceable, this will not
          affect any other terms.

          The laws of California, U.S.A., excluding California’s conflict of laws rules,
          will apply to any disputes arising out of or relating to these terms or the
          Services. All claims arising out of or relating to these terms or the Services
          will be litigated exclusively in the federal or state courts of Santa Clara
          County, California, USA, and you and Google consent to personal jurisdiction
          in those courts.

          For information about how to contact Google, please visit our  contact page  .

          ###  Our legal policies

            * Privacy Policy
            * Terms of Service
            * FAQ

          ###  More information

            * Technologies and Principles
            * Advertising
            * How Google uses cookies
            * How Google uses pattern recognition
            * Types of location data used by Google

            * How Google Wallet uses credit card numbers
            * How Google Voice works
            * How Google uses data when you use our partners' sites or apps

          ###  Additional resources

            * My Account
            * Google Safety Center
            * Google Product Privacy Guide
            * Answers to privacy and security questions

            * Google
            * About Google
            * Privacy
            * Terms "
  },
  {
    "_id":"5b576343973763f0b58c79aa",
    "date_created":"2012-03-01",
    "date_reviewed":"",
    "url":"https://policies.google.com/terms",
    "risk_assessment":"",
    "statements":[],
    "dom":"Google Terms of Service – Privacy & Terms – Google

          #
          ![Google](//www.google.com/images/branding/googlelogo/1x/googlelogo_color_116x41dp.png)

          ##  Privacy & Terms

          Skip to content

            * Overview
            * Privacy Policy
            * Terms of Service
            * Technologies and Principles
            * FAQ
            * My Account

            * Terms of Service
            * Updates

          #  Google Terms of Service

          This is an archived version of our Terms of Service. View the  current version
          or  all past versions  .

          Last modified: March 1, 2012

          ##  Welcome to Google!

          Thanks for using our products and services (“Services”). The Services are
          provided by Google Inc. (“Google”), located at 1600 Amphitheatre Parkway,
          Mountain View, CA 94043, United States.

          By using our Services, you are agreeing to these terms. Please read them
          carefully.

          Our Services are very diverse, so sometimes additional terms or product
          requirements (including age requirements) may apply. Additional terms will be
          available with the relevant Services, and those additional terms become part
          of your agreement with us if you use those Services.

          ##  Using our Services

          You must follow any policies made available to you within the Services.

          Don’t misuse our Services. For example, don’t interfere with our Services or
          try to access them using a method other than the interface and the
          instructions that we provide. You may use our Services only as permitted by
          law, including applicable export and re-export control laws and regulations.
          We may suspend or stop providing our Services to you if you do not comply with
          our terms or policies or if we are investigating suspected misconduct.

          Using our Services does not give you ownership of any intellectual property
          rights in our Services or the content you access. You may not use content from
          our Services unless you obtain permission from its owner or are otherwise
          permitted by law. These terms do not grant you the right to use any branding
          or logos used in our Services. Don’t remove, obscure, or alter any legal
          notices displayed in or along with our Services.

          Our Services display some content that is not Google’s. This content is the
          sole responsibility of the entity that makes it available. We may review
          content to determine whether it is illegal or violates our policies, and we
          may remove or refuse to display content that we reasonably believe violates
          our policies or the law. But that does not necessarily mean that we review
          content, so please don’t assume that we do.

          In connection with your use of the Services, we may send you service
          announcements, administrative messages, and other information. You may opt out
          of some of those communications.

          ##  Your Google Account

          You may need a Google Account in order to use some of our Services. You may
          create your own Google Account, or your Google Account may be assigned to you
          by an administrator, such as your employer or educational institution. If you
          are using a Google Account assigned to you by an administrator, different or
          additional terms may apply and your administrator may be able to access or
          disable your account.

          If you learn of any unauthorized use of your password or account,  follow
          these instructions  .

          ##  Privacy and Copyright Protection

          Google’s  privacy policies  explain how we treat your personal data and
          protect your privacy when you use our Services. By using our Services, you
          agree that Google can use such data in accordance with our privacy policies.

          We respond to notices of alleged copyright infringement and terminate accounts
          of repeat infringers according to the process set out in the U.S. Digital
          Millennium Copyright Act.

          We provide information to help copyright holders manage their intellectual
          property online. If you think somebody is violating your copyrights and want
          to notify us, you can find information about submitting notices and Google’s
          policy about responding to notices  in our Help Center  .

          ##  Your Content in our Services

          Some of our Services allow you to submit content. You retain ownership of any
          intellectual property rights that you hold in that content. In short, what
          belongs to you stays yours.

          When you upload or otherwise submit content to our Services, you give Google
          (and those we work with) a worldwide license to use, host, store, reproduce,
          modify, create derivative works (such as those resulting from translations,
          adaptations or other changes we make so that your content works better with
          our Services), communicate, publish, publicly perform, publicly display and
          distribute such content. The rights you grant in this license are for the
          limited purpose of operating, promoting, and improving our Services, and to
          develop new ones. This license continues even if you stop using our Services
          (for example, for a business listing you have added to Google Maps). Some
          Services may offer you ways to access and remove content that has been
          provided to that Service. Also, in some of our Services, there are terms or
          settings that narrow the scope of our use of the content submitted in those
          Services. Make sure you have the necessary rights to grant us this license for
          any content that you submit to our Services.

          You can find more information about how Google uses and stores content in the
          privacy policy or additional terms for particular Services. If you submit
          feedback or suggestions about our Services, we may use your feedback or
          suggestions without obligation to you.

          ##  About Software in our Services

          When a Service requires or includes downloadable software, this software may
          update automatically on your device once a new version or feature is
          available. Some Services may let you adjust your automatic update settings.

          Google gives you a personal, worldwide, royalty-free, non-assignable and non-
          exclusive license to use the software provided to you by Google as part of the
          Services. This license is for the sole purpose of enabling you to use and
          enjoy the benefit of the Services as provided by Google, in the manner
          permitted by these terms. You may not copy, modify, distribute, sell, or lease
          any part of our Services or included software, nor may you reverse engineer or
          attempt to extract the source code of that software, unless laws prohibit
          those restrictions or you have our written permission.

          Open source software is important to us. Some software used in our Services
          may be offered under an open source license that we will make available to
          you. There may be provisions in the open source license that expressly
          override some of these terms.

          ##  Modifying and Terminating our Services

          We are constantly changing and improving our Services. We may add or remove
          functionalities or features, and we may suspend or stop a Service altogether.

          You can stop using our Services at any time, although we’ll be sorry to see
          you go. Google may also stop providing Services to you, or add or create new
          limits to our Services at any time.

          We believe that you own your data and preserving your access to such data is
          important. If we discontinue a Service, where reasonably possible, we will
          give you reasonable advance notice and a chance to get information out of that
          Service.

          ##  Our Warranties and Disclaimers

          We provide our Services using a commercially reasonable level of skill and
          care and we hope that you will enjoy using them. But there are certain things
          that we don’t promise about our Services.

          Other than as expressly set out in these terms or additional terms, neither
          Google nor its suppliers or distributors make any specific promises about the
          Services. For example, we don’t make any commitments about the content within
          the Services, the specific functions of the Services, or their reliability,
          availability, or ability to meet your needs. We provide the Services “as is”.

          Some jurisdictions provide for certain warranties, like the implied warranty
          of merchantability, fitness for a particular purpose and non-infringement. To
          the extent permitted by law, we exclude all warranties.

          ##  Liability for our Services

          When permitted by law Google, and Google’s suppliers and distributors, will
          not be responsible for lost profits, revenues, or data, financial losses or
          indirect, special, consequential, exemplary, or punitive damages.

          To the extent permitted by law, the total liability of Google, and its
          suppliers and distributors, for any claims under these terms, including for
          any implied warranties, is limited to the amount you paid us to use the
          Services (or, if we choose, to supplying you the Services again).

          In all cases, Google, and its suppliers and distributors, will not be liable
          for any loss or damage that is not reasonably foreseeable

          We recognize that in some countries, you might have legal rights as a
          consumer. If you are using the Services for a personal purpose, then nothing
          in these terms or any additional terms limits any consumer legal rights which
          may not be waived by contract.

          ##  Business uses of our Services

          If you are using our Services on behalf of a business, that business accepts
          these terms. It will hold harmless and indemnify Google and its affiliates,
          officers, agents, and employees from any claim, suit or action arising from or
          related to the use of the Services or violation of these terms, including any
          liability or expense arising from claims, losses, damages, suits, judgments,
          litigation costs and attorneys’ fees.

          ##  About these Terms

          We may modify these terms or any additional terms that apply to a Service to,
          for example, reflect changes to the law or changes to our Services. You should
          look at the terms regularly. We’ll post notice of modifications to these terms
          on this page. We’ll post notice of modified additional terms in the applicable
          Service. Changes will not apply retroactively and will become effective no
          sooner than fourteen days after they are posted. However, changes addressing
          new functions for a Service or changes made for legal reasons will be
          effective immediately. If you do not agree to the modified terms for a
          Service, you should discontinue your use of that Service.

          If there is a conflict between these terms and the additional terms, the
          additional terms will control for that conflict.

          These terms control the relationship between Google and you. They do not
          create any third party beneficiary rights.

          If you do not comply with these terms, and we don’t take action right away,
          this doesn’t mean that we are giving up any rights that we may have (such as
          taking action in the future).

          If it turns out that a particular term is not enforceable, this will not
          affect any other terms.

          The courts in some countries will not apply California law to some types of
          disputes. If you reside in one of those countries, then where California law
          is excluded from applying, your country’s laws will apply to such disputes
          related to these terms. Otherwise, you agree that the laws of California,
          U.S.A., excluding California’s choice of law rules, will apply to any disputes
          arising out of or relating to these terms or the Services. Similarly, if the
          courts in your country will not permit you to consent to the jurisdiction and
          venue of the courts in Santa Clara County, California, U.S.A., then your local
          jurisdiction and venue will apply to such disputes related to these terms.
          Otherwise, all claims arising out of or relating to these terms or the
          services will be litigated exclusively in the federal or state courts of Santa
          Clara County, California, USA, and you and Google consent to personal
          jurisdiction in those courts.

          For information about how to contact Google, please visit our  contact page  .

          ###  Our legal policies

            * Privacy Policy
            * Terms of Service
            * FAQ

          ###  More information

            * Technologies and Principles
            * Advertising
            * How Google uses cookies
            * How Google uses pattern recognition
            * Types of location data used by Google

            * How Google Wallet uses credit card numbers
            * How Google Voice works
            * How Google uses data when you use our partners' sites or apps

          ###  Additional resources

            * My Account
            * Google Safety Center
            * Google Product Privacy Guide
            * Answers to privacy and security questions

            * Google
            * About Google
            * Privacy
            * Terms "
  },
  {
    "_id":"5b4e63f91c746747a0c035de",
    "date_created":"2018-04-03",
    "date_reviewed":"",
    "url":"https://developers.google.com/terms/site-terms",
    "statements":[
      {
        "text":"By using Google Developers (the \"Service\"), you agree to be bound by our Google Terms of Services located at http://www.google.com/accounts/TOS as well as these additional terms. Google may change these terms from time to time and post any modified terms at http://developers.google.com/site-terms. You understand and agree that if you use the Service after the date on which these terms have changed, Google will treat your use as acceptance of the updated terms.","tag":["technical requirements"],
        "comment":""
      }
    ],
    "risk_assessment":"",
    "dom":"![Google\nDevelopers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14\n/lockup-color.png)\n\nAll Products\n\nSign in\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n#  Google Developers Site Terms of Service\n\nImportant: This Terms of Service applies to the developers.google.com\nwebsite. Please click the \"Terms\" link found in the sidebar of each API or\nother product or service for its specific Terms of Service.\n\n## Google Developers Additional Terms\n\nBy using Google Developers (the \"Service\"), you agree to be bound by our\nGoogle Terms of Services located at http://www.google.com/accounts/TOS as well\nas these additional terms. Google may change these terms from time to time and\npost any modified terms at http://developers.google.com/site-terms. You\nunderstand and agree that if you use the Service after the date on which these\nterms have changed, Google will treat your use as acceptance of the updated\nterms.\n\n## Your feedback and suggestions\n\nBy submitting feedback and suggestions, you grant a non-exclusive, perpetual,\nirrevocable, and royalty-free license to any intellectual property rights you\nmay have in your feedback and suggestions to Google to use to improve any\nGoogle products or services. You acknowledge that submission of feedback and\nsuggestions is voluntarily and Google may consider or is developing technology\nthat is the same or similar to your feedback or suggestions.\n\n  * ### Connect\n\n    * Blog \n    * Facebook \n    * Google+ \n    * Medium \n    * Twitter \n    * YouTube \n  * ### Programs\n\n    * Women Techmakers \n    * Agency Program \n    * GDG \n    * Google Developers Experts \n    * Startup Launchpad \n  * ### Developer Consoles\n\n    * Google API Console \n    * Google Cloud Platform Console \n    * Google Play Console \n    * Firebase Console \n    * Cast SDK Developer Console \n    * Chrome Web Store Dashboard \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n"
  },
  {
    "_id":"5b4e646a1c746747a0c035e0",
    "date_created":"2018-04-03",
    "date_reviewed":"2018-07-18",
    "url":"https://developers.google.com/maps/terms",
    "statements":[
      {
        "text":"If you use the Maps API(s) in conjunction with any other Google products, including any other Google API(s), (collectively, the Service and all other Google products and services are referred to as the \"Google Services\"), your agreement with Google will also include the terms applicable to those Google Services. All of these are referred to as the \"Additional Terms.\" If Additional Terms apply, they will be accessible to you either within or through your use of the applicable Google Services. If there is any contradiction between the Additional Terms and the Maps APIs Terms, then the Maps APIs Terms will take precedence only as they relate to the Maps API(s), and not to any other Google Services.",
        "tag":["technical requirements"],
        "comment":""
      },
      {
        "text":"Google reserves the right to make changes to the Terms from time to time. When these changes are made, Google will make a new copy of the Terms available at http://developers.google.com/maps/terms (or such other URL as Google may provide). You understand and agree that if you use the Service after the date on which the Terms have changed, Google will treat your use as acceptance of the updated Terms. If a modification is unacceptable to you, you may terminate this agreement by ceasing use of the Maps API(s).",
        "tag":["changes to terms"],
        "comment":"needs review"
      },
      {
        "text":"You must not provide to Google: (a) any personally identifiable information or device identifiers; or (b) any European person’s Personal Data (where “European” means “European Economic Area or Switzerland” and “Personal Data” has the meaning provided in the General Data Protection Regulation (EU) 2016/679 of the European Parliament and of the Council of April 27, 2016). Users of your Maps API Implementation may provide information directly to Google through your Maps API Implementation, as needed.",
        "tag":["technical requirements"],
        "comment":"needs review"
      },
      {
        "text":"You understand and agree that Google may limit the number of transactions you may send or receive through the Service; such fixed upper limits may be set by Google at any time, at Google’s discretion. ",
        "tag":["changes to service","usage limits"],
        "comment":"needs review"
      },
      {
        "text":"Google will announce if it intends to remove major features from, or discontinue, an API or the Service.",
        "tag":["changes to service"],
        "comment":"needs review"
      },
      {
        "text":"In order to access the Service, you must have and maintain a Google Account in good standing. You must ensure that any information you give to Google in connection with your Google Account or the Service will always be accurate, correct, and up to date.",
        "tag":["general requirements"],
        "comment":"needs review"
      },
      {
        "text":"You understand and agree that Google and its licensors and their suppliers (as applicable) own all legal right, title, and interest in and to the Service and Content, including any intellectual property rights in the Service and Content (whether those rights are registered or not, and wherever in the world those rights may exist).",
        "tag":["ownership"],
        "comment":"needs review"
      },
      {
        "text":"Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to use the Service as provided by Google, in the manner permitted by the Terms.",
        "tag":["Rights"],
        "comment":"needs review"
      },
      {
        "text":"Subject to these Terms (including Section 8.4(b), Section 9 (License Requirements), and Section 10 (License Restrictions)), during the term of this agreement, Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to display Google’s Brand Features solely for the purposes of (i) promoting or advertising your authorized use of the Service in accordance with this Section and (ii) fulfilling your obligations under the Terms",
        "tag":["publicity"],
        "comment":"needs review"
      }
    ],
    "risk_assessment":"new RA\n",
    "dom":"![Google Maps\nAPIs](https://www.gstatic.com/images/branding/product/1x/maps_64dp.png)\n\n  * Home \n  * Documentation \n  * Pricing and Plans \n\nAll Products\n\nSign in\n\n  * Home \n  * Documentation \n  * Pricing and Plans \n  * All Products \n\n  * Products \n  * Google Maps APIs \n\n#  Google Maps APIs Terms of Service\n\nThank you for your interest in the Google Maps APIs. The Google Maps APIs are\na collection of services that allow you to include maps, geocoding, places,\nand other content from Google in your web pages or applications.\n\nLast Updated: January 4, 2018\n\nThis page contains the Google Maps APIs Terms of Service. If you have\nquestions about these terms, please consult the FAQ’s Terms of Service\nsection. These terms do not apply if you have entered into a separate written\nagreement with Google (such as a Google Maps APIs Premium Plan or Google Maps\nAPIs for Work agreement) related to the Google Maps APIs.\n\n## 1\\. Your relationship with Google.\n\n. Your use of any of the Google Maps APIs (referred to in this document as the\n\" Maps API(s) \" or the \" Service \") is subject to the terms of a legal\nagreement between you and Google (the \" Terms \"). \" Google \" means\neither (a) Google Ireland Limited, with offices at Gordon House, Barrow\nStreet, Dublin 4, Ireland, if your billing address is in any country within\nEurope, the Middle East, or Africa (\" EMEA \"); (b) Google Asia Pacific\nPte. Ltd., with offices at 70 Pasir Panjang Road, #03-71, Mapletree Business\nCity, Singapore 117371, if your billing address is in any country within the\nAsia Pacific region excluding Australia (\" APAC \"); (c) Google Australia\nPty Ltd. with offices at Level 5, 48 Pirrama Road, Pyrmont 2009, NSW,\nAustralia, if your billing address is in Australia; or (d) Google Inc., with\noffices at 1600 Amphitheatre Parkway, Mountain View, California 94043, USA, if\nyour billing address is in any country in the world other than those in EMEA,\nAPAC or Australia.\n\n.\n\n  1. Unless otherwise agreed in writing with Google, the Terms will include the following: \n    1. the terms and conditions in this document (the \" Maps APIs Terms \"); \n    2. the  Legal Notices; and \n    3. the  Privacy Policy. \n  2. Before you use the Maps API(s), you should read each of the documents comprising the Terms, and print or save a local copy for your records. \n\n. If you use the Maps API(s) in conjunction with any other Google products,\nincluding any other Google API(s), (collectively, the Service and all other\nGoogle products and services are referred to as the \" Google Services \"),\nyour agreement with Google will also include the terms applicable to those\nGoogle Services. All of these are referred to as the \" Additional Terms.\"\nIf Additional Terms apply, they will be accessible to you either within or\nthrough your use of the applicable Google Services. If there is any\ncontradiction between the Additional Terms and the Maps APIs Terms, then the\nMaps APIs Terms will take precedence only as they relate to the Maps API(s),\nand not to any other Google Services.\n\n. If there is any contradiction between the Maps APIs Terms and other Maps\nAPI(s)-related documents (including the Maps APIs Documentation), then the\nMaps APIs Terms will take precedence.\n\n. Google reserves the right to make changes to the Terms from time to time.\nWhen these changes are made, Google will make a new copy of the Terms\navailable at http://developers.google.com/maps/terms (or such other URL as\nGoogle may provide). You understand and agree that if you use the Service\nafter the date on which the Terms have changed, Google will treat your use as\nacceptance of the updated Terms. If a modification is unacceptable to you, you\nmay terminate this agreement by ceasing use of the Maps API(s).\n\n## 2\\. Accepting the Terms.\n\n. In order to use the Maps API(s), you must agree to the Terms by:\n\n  1. clicking to accept the Terms, where this option is made available to you by Google in the Service’s user interface; or \n  2. using the Maps API(s). You understand and agree that Google will treat your use of the Maps API(s) as acceptance of the Terms from that point onwards. \n\n. You may not use the Maps API(s) and may not accept the Terms if you are a\nperson barred from using the Service under United States law.\n\n. You represent that you have full power, capacity, and authority to accept\nthese Terms. If you are accepting on behalf of your employer or another\nentity, you represent that you have full legal authority to bind your employer\nor such entity to these Terms. If you don't have the legal authority to bind,\nplease ensure that an authorized person from your entity consents to and\naccepts these Terms.\n\n## 3\\. Privacy and Personal Information.\n\n. For information about Google's data protection practices, please read\nGoogle's Privacy Policy. This policy explains how Google treats your personal\ninformation and protects your privacy when you use the Service.\n\n. You agree to the use of your data in accordance with Google's Privacy\nPolicy.\n\n. You must post and abide by an appropriate privacy policy in your Maps API\nImplementation in accordance with Section 9.3 (End User Terms and Privacy\nPolicy).\n\n. You will comply with all applicable laws relating to the collection of\ninformation from visitors to your Maps API Implementation.\n\n. You and Google agree to the  Google Maps Controller-Controller Data\nProtection Terms.\n\n. You must not provide to Google: (a) any personally identifiable information\nor device identifiers; or (b) any European person’s Personal Data (where\n“European” means “European Economic Area or Switzerland” and “Personal Data”\nhas the meaning provided in the General Data Protection Regulation (EU)\n2016/679 of the European Parliament and of the Council of April 27, 2016).\nUsers of your Maps API Implementation may provide information directly to\nGoogle through your Maps API Implementation, as needed.\n\n## 4\\. Provision of the Service by Google.\n\n. Google has subsidiaries and affiliated legal entities around the world (\"\nSubsidiaries and Affiliates \"). Sometimes, these companies will be\nproviding the Service to you on behalf of Google itself. You understand and\nagree that Subsidiaries and Affiliates will be entitled to provide the Service\nto you.\n\n. You understand and agree that Google may limit the number of transactions\nyou may send or receive through the Service; such fixed upper limits may be\nset by Google at any time, at Google’s discretion. For further information,\nsee Section 10.4(b) below.\n\n.\n\n  1. _In places results_. Google reserves the right to include advertising in the places results provided to you through the Maps API(s). By using the Maps API(s) to obtain places results, you agree to display such advertising in the form provided to you by Google. \n  2. _In maps images_. Google also reserves the right to include advertising in the maps images provided to you through the Maps API(s), subject to the following provisions. In this Section, \"Ads Notice\" means a notice from Google that it will include advertising in a particular Maps API. The Ads Notice may be provided on relevant Google websites, including the  Google Geo Developers Blog (or such other URL as Google may provide) and the applicable Google Maps API Groups. \n    1. _New Maps API(s) and major version upgrades of existing Maps API(s) launched with an Ads Notice_. A \"major version\" of a Maps API is denoted by a new \"whole number\" in the version name (for example, a \"major version\" change occurs if API v4.5 is replaced by v5.0). By using the maps images in these new or major version upgrades of the Maps API(s), you agree to display the advertising included in those maps images in the form provided to you by Google. \n    2. _Maps API(s) and major version upgrades of existing Maps API(s) launched without an Ads Notice_. For any Maps API that Google has launched (or launches in the future) without an Ads Notice, Google will not include advertising in that API’s maps images unless Google provides you with an Ads Notice at least 90 days beforehand (the \"Ads Notice Period\"). \n    3. _Maps API Implementations that incorporated the Maps API(s) before April 8, 2011_. If your Maps API Implementation incorporated a major version of a Maps API before April 8, 2011, you have a limited right to opt out of advertising in the maps images provided through that major version of that Maps API by providing written notice to Google during the Ads Notice Period; your notice must state that you refuse to accept advertising in the maps images and must be provided to Google in accordance with Google's notice requirements (as specified in Google's Ads Notice). \n  3. _Opting out of ads_. You may at any time opt out of advertising in the places results and the maps images by either: \n    1. contacting the  Google Maps sales team to obtain a Google enterprise license; or \n    2. terminating your use of the Service. \n  4. _Indexing and caching for ads serving_. By using an API that serves ads, you give Google the right to access, index, and cache the web pages or applications that contain your Maps API Implementation. \n\n. The following is the Service’s \"Deprecation Policy\":\n\n  1. Google will announce if it intends to remove major features from, or discontinue, an API or the Service. \n  2. Google will use commercially reasonable efforts to continue to operate those Google Maps API versions and features identified at  http://developers.google.com/maps/maps-api-list without these changes until one year after the announcement, unless Google determines in its reasonable good faith judgment that: \n    1. it is required by law or third-party relationship (including changes in law or relationships) to make those changes earlier; or \n    2. doing so could create a security risk or substantial economic or material technical burden. \n\n## 5\\. Your Google Account.\n\n. In order to access the Service, you must have and maintain a Google Account\nin good standing. You must ensure that any information you give to Google in\nconnection with your Google Account or the Service will always be accurate,\ncorrect, and up to date.\n\n. You will be solely responsible to Google for your use of the Service. You\nmust notify Google immediately if you become aware of any unauthorized use of\nyour password; your Google Account; or any unique identifier that Google\nrequires you to use, such as an API Key or client ID (a \" Developer\nIdentifier \").\n\n## 6\\. Google’s Proprietary Rights.\n\nYou understand and agree that Google and its licensors and their suppliers (as\napplicable) own all legal right, title, and interest in and to the Service and\nContent, including any intellectual property rights in the Service and Content\n(whether those rights are registered or not, and wherever in the world those\nrights may exist).\n\n## 7\\. Permitted Uses.\n\nYou will use the Service only for purposes that:\n\n  1. are permitted by the Terms (including the Licenses in Section 8); \n  2. are permitted by any applicable law or third-party contract in the relevant jurisdictions; and \n  3. comply with all applicable policies or guidelines made available by Google, including in the Maps APIs Documentation and the  Permission Guidelines for Google Maps and Google Earth. \n\n## 8\\. Licenses from Google to You.\n\n.\n\n  1. \" Brand Features \" means trade names, trademarks, logos, domain names, and other distinctive brand features. \n  2. \" Content \" means any content provided through the Service (whether created by Google or its third-party licensors), including map and terrain data, imagery, traffic data, and places data (including business listings). \n  3. \" Maps API Implementation \" means a software application, website, or other implementation that uses the Maps API(s) to obtain and display Content in conjunction with Your Content. \n  4. \" Your Content \" means any content that you provide in your Maps API Implementation, including data, images, video, or software. Your Content does not include the Content as defined in Subsection (b). \n\n. Subject to these Terms (including Section 9 (License Requirements) and\nSection 10 (License Restrictions)), during the term of this agreement, Google\ngives you a non-exclusive, worldwide, personal, non-transferable, non-\nassignable, non-sublicensable, royalty-free license to use the Service as\nprovided by Google, in the manner permitted by the Terms.\n\n. Subject to these Terms (including Sections 8.3(a) and (b), Section 9\n(License Requirements), and Section 10 (License Restrictions)), during the\nterm of this agreement, Google gives you a non-exclusive, worldwide, personal,\nnon-transferable,non-assignable, non-sublicensable, royalty-free license to\nuse the Content in your Maps API Implementation, as the Content is provided in\nthe Service, and in the manner permitted by the Terms.\n\n  1. Content (including map data, traffic, directions, and places) is provided for planning purposes only. You may find that weather conditions, construction projects, closures,or other events may cause road conditions or directions to differ from the results depicted in the Content. You should exercise judgment in your use of the Content. \n  2. Certain Content is provided under  license from third parties, and is subject to copyright and other intellectual property rights owned by or licensed to such third parties. You may be held liable for any unauthorized use of this content. Your use of third-party Content (including certain business listings Content) is subject to additional restrictions located in the  Legal Notices page. \n\n.\n\n  1. _Grant_. Subject to these Terms (including Section 8.4(b), Section 9 (License Requirements), and Section 10 (License Restrictions)), during the term of this agreement, Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to display Google’s Brand Features solely for the purposes of (i) promoting or advertising your authorized use of the Service in accordance with this Section and (ii) fulfilling your obligations under the Terms. \n  2. _Restrictions_. In using Google Brand Features, you will not: \n    1. display a Google Brand Feature in any manner that implies a relationship or affiliation with, sponsorship, or endorsement by Google (other than your use of the Service), or that can be reasonably interpreted to suggest editorial content has been authored by, or represents the views or opinions of, Google or its personnel; \n    2. display a Google Brand Feature in your Maps API Implementation, site, or other propert(ies) if any of them contain or display adult content or promote illegal activities, gambling, or the sale of tobacco or alcohol to persons under 21 years of age; \n    3. have the Google logo as the largest logo in your Maps API Implementation, site, or other propert(ies) (except as displayed in the map image itself); \n    4. display a Google Brand Feature as the most prominent element in your Maps API Implementation, on any page of your site, or on any of your other propert(ies); \n    5. display a Google Brand Feature in a manner that is misleading, defamatory, infringing, libelous, disparaging, obscene, or otherwise objectionable to Google; \n    6. use Google Brand Features to disparage Google or the Google Services; \n    7. display a Google Brand Feature in your Maps API Implementation, site, or other propert(ies) that violate any law or regulation; or \n    8. remove, distort, or alter any element of a Google Brand Feature (including squeezing, stretching, inverting, or discoloring). \n  3. _No further license grant; no challenges_. Except as stated in this Section, nothing in the Terms grants or will be deemed to grant you any right, title, or interest in Google’s Brand Features. Your use of Google’s Brand Features (including any goodwill associated with them) will inure to Google’s benefit. During and after the Term, and to the maximum extent permitted by applicable law, you will not challenge or assist others to challenge Google’s Brand Features (or their registration by Google), and you will not attempt to register any Brand Features (including domain names) that are confusingly similar to Google’s in any way (including in sound, appearance, or spelling). \n\n. You will not remove, obscure, or alter any proprietary rights notices\n(including copyright and trademark notices, Terms of Use links, or Brand\nFeatures) displayed or provided through the Service. Where such notices are\nnot displayed or provided within the Service, you must display such notices\naccording to the Maps APIs Documentation.\n\n. If the Service or Content is being used or accessed by or on behalf of the\nUnited States government, such use is subject to additional terms located in\nour  Legal Notices page’s \"Government End Users\" section.\n\n. Google reserves the sole right and discretion to determine whether your use\nof the Service, Content, and Brand Features complies with these Terms.\n\n## 9\\. License Requirements.\n\nGoogle’s licenses above are subject to your compliance with the following\nrequirements:\n\n.\n\n9.1.1 General Rules.\n\n  1. _Free access (no fees)_. Subject to Section 9.1.2 (Exceptions), your Maps API Implementation must be accessible to the general public without charge and must not require a fee-based subscription or other fee-based restricted access. This rule applies to Your Content and any other content in your Maps API Implementation, whether Your Content or the other content exists now or is added later. \n  2. _Public access (no firewall)_. Your Maps API Implementation must not operate (i) only behind a firewall; or (ii) only on an internal network (except during the development and testing phase); or (iii) in a closed community (for example, through invitation-only access). \n\n9.1.2 Exceptions.\n\n  1. _Enterprise agreement with Google_. The rules in Section 9.1.1 (Free access, Public access) do not apply if you have entered into a separate written agreement with Google (such as a  Google Maps agreement) or obtained Google's written permission. \n  2. _Mobile applications_. \n    1. The rule in Section 9.1.1(a) (Free access) does not apply if your Maps API Implementation is used in a mobile application that is sold for a fee through an online store and is downloadable to a mobile device that can access the online store. \n    2. The rule in Section 9.1.1(b) (Public access) does not apply if your Maps API Implementation is an Android application that uses the Google Maps Android API. (However, the rule in Section 9.1.1(b) (Public access) will continue to apply if your Maps API Implementation is an Android application that uses any other Maps APIs, unless the Maps API Implementation qualifies for the exception in Section 9.1.2(a) (Enterprise agreement with Google).) \n\n9.1.3 Examples.\n\n  1. You can require users to log in to your Maps API Implementation if you do not require users to pay a fee. \n  2. You can charge a fee for your Maps API Implementation if it is an Android application downloadable to mobile devices from the Google Play Store. \n  3. If you are a consultant who creates or hosts Maps API Implementations for third-party customers, you may charge those customers a fee for your consulting or hosting services (but not for the Maps API Implementations themselves, except as permitted under Section 9.1.2 (Exceptions)). \n\n. You must implement those reporting mechanisms that Google requires (as\nupdated from time to time in these Terms and in the Maps APIs Documentation).\n\n. If you develop a Maps API Implementation for use by other users, you must:\n\n  1. display to the users of your Maps API Implementation the link to Google’s Terms of Service as presented through the Service or described in the Maps APIs Documentation; \n  2. explicitly state in your Maps API Implementation’s terms of use that, by using your Maps API Implementation, your users are agreeing to be bound by Google’s Terms of Service; and \n  3. protect the privacy and legal rights of those users. \n    1. _Your privacy policy_. You must make publicly available, and must abide by, an appropriate privacy policy in your Maps API Implementation. In particular, if your Maps API Implementation enables you or any party to gain access to information about users of the Maps API(s), including personally identifiable information (such as user names) or non-personally identifiable usage information (such as location), your privacy policy must describe your use and retention of this information. \n      1. _Geolocation privacy_\n        1. Your Maps API Implementation must notify the user in advance of the type(s) of data that you intend to collect from the user or the user’s device. Your Maps API Implementation must not obtain or cache any user’s location in any manner except with the user's prior consent. Your Maps API Implementation must let the user revoke the user's consent at any time. \n        2. If your Maps API Implementation provides Google with geolocation data, that geolocation data must not enable Google to identify an individual user. For example, if your Maps API Implementation sends Google Your Content, and Your Content includes geolocation data, Your Content must not also include unique device identifiers associated with individual users. \n        3. If you intend to obtain the user’s location and use it with any other data provider's data, you must disclose this fact to the user. \n      2. _Google’s Privacy Policy_. Your privacy policy must notify users that you are using the Maps API(s) and incorporate by reference Google’s Privacy Policy by including a link to Google’s then-current Privacy Policy (at  http://www.google.com/policies/privacy or such other URL as Google may provide). \n      3. _Cookies_. As noted in the Documentation, certain Maps API(s) store and access cookies and other information on end users’ devices. If you use any of these cookie-enabled Maps API(s) in your Maps API Implementation, then for end users in the European Union, you must comply with the  EU User Consent Policy. \n\n.\n\n  1. Content provided to you through the Service may contain the Brand Features of Google, its strategic partners, or other third-party rights holders of content that Google indexes. When Google provides those Brand Features or other attribution through the Service, you must display such attribution as provided (or as described in the Maps APIs Documentation) and must not delete or alter the attribution. \n  2. You must conspicuously display the \"powered by Google\" attribution (and any other attribution(s) required by Google in the  Maps APIs Documentation) on or adjacent to the relevant Service search box and Google search results. If you use the standard Google search control, or the standard Google search control form, this attribution will be included automatically, and you must not modify or obscure this automatically-generated attribution. \n  3. You understand and agree that Google has the sole right and discretion to determine whether your attribution(s) are in compliance with the above requirements. \n\n. You will use all reasonable efforts to prevent unauthorized use of the\nService and to terminate any such unauthorized use.\n\n. You are solely responsible for (and Google has no responsibility to you or\nany third party for) any breach of your obligations under the Terms and for\nthe consequences of any such breach (including any loss or damage that Google\nmay suffer).\n\n## 10\\. License Restrictions.\n\nExcept as expressly permitted under the Terms, or unless you have received\nprior written authorization from Google (or, as applicable, from the\nparticular Content provider), Google’s licenses above are conditioned on your\nadherence to all of the restrictions below. In this Section 10, the phrase\n\"you will not\" means \"when using the Service, you will not, and will not\npermit a third party to.\"\n\n.\n\n  1. _No access to APIs or Content except through the Service_. You will not access the Maps API(s) or the Content except through the Service. For example, you must not access map tiles or imagery through interfaces or channels (including undocumented Google interfaces) other than the Maps API(s). \n  2. _No access to Service without applicable Developer Identifier(s)_. For certain versions or features of the Maps API(s), Google may require you to use a Developer Identifier to access and administer the Service. If a Developer Identifier is required under the Maps APIs Documentation, you will not access the Service without the Developer Identifier. \n  3. _No hiding identity_. You will not hide from Google the identity of your Maps API Implementation. You must follow the identification conventions in the Maps APIs Documentation. \n\n. The following restrictions apply generally to all Google Services, including\nthe Google application programming interfaces at\nhttps://developers.google.com/products/ (or such other URL as Google may\nprovide) (the “ Google API(s) ”). You will not:\n\n  1. Sublicense a Google API for use by a third party. Consequently, you will not create an API client that functions substantially the same as the Google APIs and offer it for use by third parties. \n  2. Perform an action with the intent of introducing to Google Services any viruses, worms, defects, Trojan horses, malware, or any items of a destructive nature. \n  3. Defame, abuse, harass, stalk, or threaten others. \n  4. Interfere with or disrupt the Google APIs or the servers or networks providing the Google APIs. \n  5. Promote or facilitate unlawful online gambling or disruptive commercial messages or advertisements. \n  6. Reverse engineer or attempt to extract the source code from any Google API or any related software, except to the extent that this restriction is expressly prohibited by applicable law. \n  7. Use the Google APIs for any activities where the use or failure of the Google APIs could lead to death, personal injury, or environmental damage (such as the operation of nuclear facilities, air traffic control, or life support systems). \n  8. Use the Google APIs to process or store any data that is subject to the International Traffic in Arms Regulations maintained by the U.S. Department of State. \n  9. Remove, obscure, or alter any Google terms of service, or any links to or notices of those terms. \n\n.\n\n  1. _No violation of Google’s Software Principles_. You will not violate Google’s Software Principles at  http://www.google.com/intl/en/about/company/software-principles.html (or such other URLs that Google may designate). \n  2. _No modification of search results_. You will not modify, reorder, augment, or manipulate search results in any way unless you explicitly notify the end user of your actions. \n\n.\n\n  1. _No use except under these Terms_. You will not use the Service or Content except as expressly permitted under these Terms. For example: \n    1. _No fees_. You will not charge any third party a fee to use your Maps API Implementation, the Service, or the Content, unless you have purchased an applicable Google Maps APIs Premium Plan or Google Maps APIs for Work license that expressly permits this use. \n    2. _No printing 5,000+ copies for direct marketing_. You will not print more than 5,000 copies of sales collateral materials containing a screenshot of the Content for purposes of commercial sales lead generation. \n    3. _No use as a core part of printed matter_. You will not incorporate the Content as a core part of printed matter (such as a printed map or guide book) that is redistributed for a fee. \n  2. _No use beyond transaction limits and usage policies_. If your Maps API Implementation generates a high volume of transactions, Google reserves the right to set transaction limits, as described in the Maps APIs Documentation here. Google also reserves the right to set other usage policies in the Documentation from time to time. If you want to engage in use outside these transaction limits or usage policies, you can purchase more usage capacity through the Maps API Standard pricing plan, or you can contact the  Google Maps sales team for licensing options to address your needs. Google may decline your request, or condition acceptance on your agreement to additional terms and/or charges for that use. \n  3. _Restrictions on your Maps API Implementations_. \n    1. _No creation of a substitute service_. You will not use the Service to create a Maps API Implementation that is a substitute for, or substantially similar service to, Google Maps (at  https://www.google.com/maps (or such other URL as Google may provide)) (\" Google Maps \") or the Service. \n    2. _No creation or augmentation of data sets based on Google’s Content or Services_. You will not use Google’s Content or Services to create or augment your own mapping-related dataset (or that of a third party), including a mapping or navigation dataset, business listings database, mailing list, or telemarketing list. \n    3. _No navigation_. You will not use the Service or Content for or in connection with (a) real-time navigation or route guidance; or (b) automatic or autonomous vehicle control. \n    4. _No asset-tracking unless you have purchased the applicable enterprise license_. Unless you have purchased an applicable Premium Plan or Maps APIs for Work license that expressly permits you to do so, you will not use the Service or Content for commercial asset-tracking or in Maps API Implementations whose primary purpose is to assess vehicle insurance risks. \n      1. Commercial asset-tracking includes dispatch, fleet management, and Maps API Implementations that track your (or your end users’) assets (for example, private or commercial transportation applications, including taxi and vehicle-for-hire applications). \n      2. Non-commercial asset-tracking implementations include applications used for a non-commercial purpose (for example, a free, publicly accessible Maps API Implementation that displays real-time public transit or other transportation status information or that allows end users to share real-time location with others). \n    5. _No use of Content in a listings service_. You will not use business listings-related Content in any Customer Implementation that has the primary purpose of making available business, residential address, or telephone directory listings. \n    6. _No use of Content for an Ads product_. You will not use business listings-related Content to create or augment an advertising product. \n  4. _No use of Content without a Google map_. Unless the Maps APIs Documentation expressly permits you to do so, you will not use the Content in a Maps API Implementation without a corresponding Google map. For example, you may display Street View imagery without a corresponding Google map because the Maps APIs Documentation expressly permits this use. \n  5. _No use of Content with a non-Google map_. You must not use the Content in a Maps API Implementation that contains a non-Google map. \n\n.\n\n  1. _No distribution or sale except as permitted under the Terms_. You will not distribute, sell, or otherwise make any part of the Service available to third parties except as permitted by these Terms. \n  2. _No derivative works_. You will not modify or create a derivative work based on any Content unless expressly permitted to do so under these Terms. For example, the following are prohibited: (i) creating server-side modification of map tiles; (ii) stitching multiple static map images together to display a map that is larger than permitted in the Maps APIs Documentation; or (iii) tracing or copying the copyrightable elements of Google’s maps or building outlines and creating a new work, such as a new mapping or navigation dataset. \n  3. _No use of Content outside the Service_. You will not use any Content outside of the Service except as expressly permitted to do so in Subsection (d). For example, you will not export or save the Content to a third party’s platform or service. \n  4. _No caching or storage_. You will not pre-fetch, cache, index, or store any Content to be used outside the Service, except that you may store limited amounts of Content solely for the purpose of improving the performance of your Maps API Implementation due to network latency (and not for the purpose of preventing Google from accurately tracking usage), and only if such storage: \n    1. is temporary (and in no event more than 30 calendar days); \n    2. is secure; \n    3. does not manipulate or aggregate any part of the Content or Service; and \n    4. does not modify attribution in any way. \n  5. _No mass downloading_. You will not use the Service in a manner that gives you or a third party access to mass downloads or bulk feeds of any Content. For example, you are not permitted to offer a batch geocoding service that uses Content contained in the Maps API(s). \n  6. _No incorporating Google software into other software_. You will not incorporate any software provided as part of the Service into other software. \n  7. _No removing, obscuring, or altering terms of service, links, or proprietary rights notices_. You will not: \n    1. remove, obscure, or alter any Google terms of service or any links to or notices of those terms, or any copyright, trademark, or other proprietary rights notices; or \n    2. falsify or delete any author attributions, legal notices, or other labels of the origin or source of material. \n\n. We want to make sure that the Services remain online and available for all\nusers. To help ensure this, during the agreement term, you will not try to\nshut down the Services that you have been using by seeking an injunction or\nexclusion order.\n\n## 11\\. Licenses from You to Google.\n\n. Google claims no ownership over Your Content, and you retain copyright and\nany other rights you already hold in Your Content. By submitting or displaying\nYour Content through the Service, you give Google a perpetual, irrevocable,\nnon-exclusive, worldwide, sublicensable, royalty-free license to use Your\nContent solely for the following purposes:\n\n  1. enabling Google to provide you with the Service; \n  2. if you opt to do so through your Maps API Implementation’s features, allowing end users to use Your Content in Google Services; and \n  3. if you opt to submit Your Content through the Google Places API(s), allowing Google to use that content in Google Services. \n\n. During the term of this agreement, you give Google a non-exclusive,\nworldwide, sublicensable, royalty-free license to use Your Brand Features and\nYour Content to publicize or advertise that you are using the Service (for\nexample, by using your marks in presentations, marketing materials, customer\nlists, financial reports, and website listings (including links to your\nwebsite), or by creating marketing or advertising materials that show\nscreenshots of the Service in which Your Content is featured).\n\n. You represent and warrant that you have all the rights, power, and authority\nnecessary to grant the above licenses.\n\n## 12\\. Maps API Standard Pricing Plan and Payment Terms.\n\nThis Section 12 applies if you purchase usage capacity (beyond the Service’s\ntransaction limits) through the Maps API Standard pricing plan:\n\n. Certain parts of the Service are provided to you without charge up to the\ntransaction limits described in the Maps APIs Documentation here.\n\n. Google will issue an electronic bill to you for all charges accrued above\nthe transaction limits based on your use of the Service during the previous\nmonth. You will pay all fees specified in the invoice, including the invoice’s\nspecified currency and payment terms. Google’s measurement of your use of the\nService is final.\n\n. In association with your purchase of Maps API usage, you are responsible for\nall applicable government-imposed taxes, except for taxes based on Google’s\nnet income, net worth, employment, and assets (including personal and real\nproperty) (\" Taxes \"), and you will pay Google for the Service without any\nreduction for Taxes. If Google is obligated to collect or pay Taxes, the Taxes\nwill be invoiced to you, unless you provide Google with a timely and valid tax\nexemption certificate authorized by the appropriate taxing authority. In some\nstates the sales tax is due on the total purchase price at the time of sale\nand must be invoiced and collected at the time of the sale.\n\n. To the fullest extent permitted by law, you waive all claims relating to\nfees unless claimed within sixty days after charged (this does not affect any\nof your rights with your credit card issuer). Refunds (if any) are at Google’s\ndiscretion and will only be in the form of credit for the Service. Nothing in\nthese Terms obligates Google to extend credit to any party.\n\n. Late payments may bear interest at the rate of 1.5% per month (or the\nhighest rate permitted by law, if less). Google reserves the right to suspend\nyour access to the Service for any late payments.\n\n## 13\\. Terminating this Agreement.\n\nThe Terms will continue to apply until terminated by either you or Google as\ndescribed below.\n\nYou may terminate your legal agreement with Google by removing the Maps API(s)\ncode from your Maps API Implementation and discontinuing your use of the\nService at any time. You do not need to specifically inform Google when you\nstop using the Service.\n\nGoogle reserves the right to terminate these Terms or discontinue the Service,\nor any portion or feature of the Service, for any reason and at any time\nwithout liability or other obligation to you, except as described under\nSection 4.4 (Changes to the Service; Deprecation Policy).\n\nNothing in this Section 13 will affect Google’s rights under Section 4\n(Provision of Service by Google).\n\nWhen this legal agreement comes to an end, those Terms that by their nature\nare intended to continue indefinitely will continue to apply, including\nSections 3.5 (European Data Protection Terms); 6 (Google’s Proprietary\nRights); 11.1 (Content License); 13.4 and 13.5 (Terminating this Agreement);\n14 (Exclusion of Warranties); 15 (Limitations of Liability); 16 (Indemnities);\nand 19 (General Legal Terms).\n\n## 14\\. EXCLUSION OF WARRANTIES.\n\nNOTHING IN THESE TERMS, INCLUDING SECTIONS 14 AND 15, WILL EXCLUDE OR LIMIT\nGOOGLE’S WARRANTY OR LIABILITY FOR LOSSES THAT MAY NOT BE LAWFULLY EXCLUDED OR\nLIMITED BY APPLICABLE LAW. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF\nCERTAIN WARRANTIES OR CONDITIONS OR THE LIMITATION OR EXCLUSION OF LIABILITY\nFOR CERTAIN TYPES OF LOSS OR DAMAGES. ACCORDINGLY, ONLY THE LIMITATIONS THAT\nARE LAWFUL IN YOUR JURISDICTION WILL APPLY TO YOU, AND GOOGLE’S LIABILITY WILL\nBE LIMITED TO THE MAXIMUM EXTENT PERMITTED BY LAW.\n\nYOU EXPRESSLY UNDERSTAND AND AGREE THAT YOUR USE OF THE SERVICE AND THE\nCONTENT IS AT YOUR SOLE RISK AND THAT THE SERVICE AND THE CONTENT ARE PROVIDED\n\"AS IS\" AND \"AS AVAILABLE.\" IN PARTICULAR, GOOGLE, ITS SUBSIDIARIES AND\nAFFILIATES, AND ITS LICENSORS AND THEIR SUPPLIERS, DO NOT REPRESENT OR WARRANT\nTO YOU THAT:\n\n  1. THE SERVICE WILL MEET YOUR REQUIREMENTS; \n  2. THE SERVICE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; \n  3. THE SERVICE WILL BE ACCURATE OR RELIABLE; AND \n  4. DEFECTS IN THE OPERATION OR FUNCTIONALITY OF ANY SOFTWARE PROVIDED TO YOU AS PART OF THE SERVICE WILL BE CORRECTED. \n\nANY CONTENT OBTAINED THROUGH THE GOOGLE SERVICES IS AT YOUR OWN DISCRETION AND\nRISK AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM\nOR OTHER DEVICE, LOSS OF DATA, OR ANY OTHER DAMAGE OR INJURY THAT RESULTS FROM\nDOWNLOADING OR USING ANY SUCH CONTENT.\n\nNO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM\nGOOGLE, OR THROUGH OR FROM THE SERVICE OR CONTENT, WILL CREATE ANY WARRANTY\nNOT EXPRESSLY STATED IN THE TERMS.\n\nGOOGLE, ITS LICENSORS, AND THEIR SUPPLIERS FURTHER EXPRESSLY DISCLAIM ALL\nWARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING\nTHE IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, AND NON-INFRINGEMENT.\n\n## 15\\. LIMITATIONS OF LIABILITY.\n\nSUBJECT TO SECTION 14.1, YOU EXPRESSLY UNDERSTAND AND AGREE THAT, TO THE\nMAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, GOOGLE, ITS SUBSIDIARIES, AND\nAFFILIATES, AND GOOGLE'S LICENSORS AND THEIR SUPPLIERS, WILL NOT BE LIABLE TO\nYOU FOR:\n\n  1. ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES THAT MAY BE INCURRED BY YOU, HOWEVER CAUSED AND UNDER ANY THEORY OF LIABILITY (INCLUDING CONTRACT, TORT, COMMON LAW, OR STATUTORY DAMAGES); ANY LOSS OF REVENUES OR PROFIT (WHETHER INCURRED DIRECTLY OR INDIRECTLY); ANY LOSS OF GOODWILL OR BUSINESS REPUTATION; ANY LOSS OF DATA; ANY COST TO PROCURE SUBSTITUTE GOODS OR SERVICES; OR ANY INTANGIBLE LOSS; OR \n  2. ANY LOSS OR DAMAGE AS A RESULT OF: \n    1. ANY RELIANCE PLACED BY YOU ON THE COMPLETENESS, ACCURACY, OR EXISTENCE OF ANY ADVERTISING, OR AS A RESULT OF ANY RELATIONSHIP OR TRANSACTION BETWEEN YOU AND ANY ADVERTISER OR SPONSOR WHOSE ADVERTISING APPEARS ON GOOGLE SERVICES; \n    2. ANY CHANGES THAT GOOGLE MAY MAKE TO THE SERVICE, OR ANY PERMANENT OR TEMPORARY DISCONTINUATION OF THE SERVICE (OR ANY FEATURES WITHIN THE SERVICE); \n    3. THE DELETION OR CORRUPTION OF, OR FAILURE TO STORE, ANY CONTENT AND OTHER DATA MAINTAINED OR TRANSMITTED BY OR THROUGH YOUR USE OF THE SERVICE; \n    4. YOUR FAILURE TO PROVIDE GOOGLE WITH ACCURATE ACCOUNT INFORMATION; OR \n    5. YOUR FAILURE TO KEEP YOUR PASSWORD OR ACCOUNT DETAILS SECURE AND CONFIDENTIAL. \n\nTHE LIMITATIONS ON GOOGLE’S LIABILITY IN SECTION 15.1 ABOVE WILL APPLY WHETHER\nOR NOT GOOGLE, ITS SUBSIDIARIES, AFFILIATES, LICENSORS OR THEIR SUPPLIERS HAVE\nBEEN ADVISED OF OR SHOULD HAVE BEEN AWARE OF THE POSSIBILITY OF ANY SUCH\nLOSSES OR DAMAGES.\n\n## 16\\. Indemnities.\n\nYou will defend and indemnify Google and its affiliates, directors, officers,\nemployees, strategic partners, licensors, and their suppliers (the \"\nIndemnified Parties \") against all liabilities, damages, losses, costs,\nfees (including legal fees), and expenses relating to any allegation or third-\nparty legal proceeding to the extent arising from:\n\n  1. your use of the Service or the Content in breach of the Terms or applicable policies; \n  2. your Maps API Implementation, including any claim that your Maps API Implementation infringes a third party’s rights or violates applicable law; or \n  3. Your Content. \n\nYou will cooperate as fully as reasonably required in the defense of any\nallegation or third-party legal proceeding. Google reserves the right, at its\nown expense, to assume the exclusive control and defense of any indemnified\nmatter under this Section 16.\n\n## 17\\. Copyright Policies; Content Removal; Termination of Repeat Offenders’\nAccounts.\n\nIt is Google’s policy to respond to notices of alleged copyright infringement\nthat comply with applicable international intellectual property law\n(including, in the United States, the Digital Millennium Copyright Act) and to\nterminate the accounts of repeat offenders. Details of Google’s policy can be\nfound here.\n\n## 18\\. Other Content.\n\nThe Service may include hyperlinks to other websites or content or resources.\nGoogle has no control over any websites or resources that are provided by\ncompanies or persons other than Google. You understand and agree that Google\nis not responsible for the availability of any such external sites or\nresources, and does not endorse any advertising, products, or other materials\non, or available from, such websites or resources.\n\nYou understand and agree that Google is not liable for any loss or damage that\nyou may incur as a result of the availability of those external sites or\nresources, or as a result of any reliance by you on the completeness,\naccuracy, or existence of any advertising, products, or other materials on, or\navailable from, such websites or resources.\n\n## 19\\. General Legal Terms.\n\n. Google may provide you with notices, including those regarding changes to\nthe Terms, by email, regular mail, or postings on the Service.\n\n. Google may assign any part of this agreement without written consent.\n\n. Google will not be treated as having waived any rights by not exercising (or\ndelaying the exercise of) any rights under these Terms. A waiver will be\neffective only if Google expressly states in a writing signed by an authorized\nrepresentative that Google is waiving a specified Term.\n\n. Google’s affiliates and the Indemnified Parties are third-party\nbeneficiaries to the Terms and are entitled to directly enforce, and rely on,\nany Terms that confer a right or benefit to them. There are no other third-\nparty beneficiaries to the Terms.\n\n. These Terms set out all terms agreed between the parties and supersede all\nother agreements between the parties relating to its subject matter.\n\n. If any term (or part of a term) of these Terms is invalid, illegal or\nunenforceable, the rest of the Terms will remain in effect.\n\n. You understand and agree that damages for improper use of the Maps API(s)\nmay be irreparable; therefore, Google is entitled to seek equitable relief,\nincluding injunctions in any jurisdiction, in addition to all other remedies\nit may have.\n\n. If these Terms are translated into any other language, and there is a\ndiscrepancy between the English text and the translated text, the English text\nwill govern.\n\n. ALL CLAIMS ARISING OUT OF OR RELATING TO THESE TERMS OR ANY RELATED GOOGLE\nSERVICES WILL BE GOVERNED BY CALIFORNIA LAW, EXCLUDING CALIFORNIA'S CONFLICT\nOF LAWS RULES, AND WILL BE LITIGATED EXCLUSIVELY IN THE FEDERAL OR STATE\nCOURTS OF SANTA CLARA COUNTY, CALIFORNIA, USA; THE PARTIES CONSENT TO PERSONAL\nJURISDICTION IN THOSE COURTS.\n\nExcept as otherwise noted, the content of this page is licensed under the\nCreative Commons Attribution 3.0 License, and code samples are licensed under\nthe Apache 2.0 License. For details, see our Site Policies. Java is a\nregistered trademark of Oracle and/or its affiliates.\n\n  * ![](https://developers.google.com/site-assets/logo-stack-overflow.svg) Stack Overflow \n\nAsk a question under the google-maps tag.\n\n  * ![](https://developers.google.com/site-assets/logo-github.svg) GitHub \n\nFork our samples and try them yourself.\n\n  * ![](https://developers.google.com/site-assets/blogger_64dp.png) Blog \n\nRead about the latest updates, customer stories, and tips.\n\n  * ![](https://developers.google.com/site-assets/developers_64dp.png) Issue tracker \n\nSomething wrong? Send us a bug report!\n\n  * ### Learn More\n\n    * Tutorials \n    * Pricing and Plans \n    * API Picker \n    * Maps APIs Overview \n  * ### Platforms\n\n    * Android \n    * iOS \n    * Web \n    * Web Services \n  * ### Product Info\n\n    * Contact sales \n    * Community support \n    * Paid support \n    * Terms of Service \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n### Send feedback about...\n\nThis page\n\nDocumentation feedback\n\n![Google Maps\nAPIs](https://www.gstatic.com/images/branding/product/1x/maps_64dp.png)\n\nGoogle Maps APIs\n\nProduct feedback\n\n"
  },
  {
    "_id":"5b4e64881c746747a0c035e2",
    "date_created":"2018-04-03",
    "date_reviewed":"2018-07-17",
    "url":"https://developers.google.com/terms/",
    "statements":[
      {
        "text":"You will only access (or attempt to access) an API by the means described in the documentation of that API. If Google assigns you developer credentials (e.g. client IDs), you must use them with the applicable APIs. You will not misrepresent or mask either your identity or your API Client's identity when using the APIs or developer accounts.",
        "tag":["technical requirements"],
        "comment":"needs review"
      },
      {
        "text":"You will require your end users to comply with (and not knowingly enable them to violate) applicable law, regulation, and the Terms.",
        "tag":["general requirements"],
        "comment":"needs review"
      },
      {
        "text":"Google sets and enforces limits on your use of the APIs (e.g. limiting the number of API requests that you may make or the number of users you may serve), in our sole discretion. You agree to, and will not attempt to circumvent, such limitations documented with each API. If you would like to use any API beyond these limits, you must obtain Google's express consent (and Google may decline such request or condition acceptance on your agreement to additional terms and/or charges for that use). To seek such approval, contact the relevant Google API team for information (e.g. by using the Google developers console).",
        "tag":["usage limits","payment"],
        "comment":"needs review"
      },
      {
        "text":"The APIs are designed to help you enhance your websites and applications (\"API Client(s)\"). YOU AGREE THAT GOOGLE MAY MONITOR USE OF THE APIS TO ENSURE QUALITY, IMPROVE GOOGLE PRODUCTS AND SERVICES, AND VERIFY YOUR COMPLIANCE WITH THE TERMS. This monitoring may include Google accessing and using your API Client, for example to identify security issues that could affect Google or its users. You will not interfere with this monitoring. Google may use any technical means to overcome such interference. Google may suspend access to the APIs by you or your API Client without notice if we reasonably believe that you are in violation of the Terms.",
        "tag":["monitor/audit"],
        "comment":"needs review"
      },
      {
        "text":"Google does not acquire ownership in your API Clients, and by using our APIs, you do not acquire ownership of any rights in our APIs or the content that is accessed through our APIs.",
        "tag":["ownership"],
        "comment":"needs review"
      },
      {
        "text":"Consequently, you will not create an API Client that functions substantially the same as the APIs and offer it for use by third parties",
        "tag":["technical requirements"],
        "comment":"needs review"
      },
      {
        "text":"Developer credentials (such as passwords, keys, and client IDs) are intended to be used by you and identify your API Client. You will keep your credentials confidential and make reasonable efforts to prevent and discourage other API Clients from using your credentials. Developer credentials may not be embedded in open source projects.",
        "tag":["general requirements"],
        "comment":"needs review"
      },
      {
        "text":"Our APIs contain some third party content (such as text, images, videos, audio, or software). This content is the sole responsibility of the person that makes it available. We may sometimes review content to determine whether it is illegal or violates our policies or the Terms, and we may remove or refuse to display content. Finally, content accessible through our APIs may be subject to intellectual property rights, and, if so, you may not use it unless you are licensed to do so by the owner of that content or are otherwise permitted by law. Your access to the content provided by the API may be restricted, limited, or filtered in accordance with applicable law, regulation, and policy.",
        "tag":["as-is and as-available"],
        "comment":"needs review"
      }
    ],
    "risk_assessment":"Kai's RA\n",
    "dom":"![Google\nDevelopers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14\n/lockup-color.png)\n\nAll Products\n\nSign in\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n#  Google APIs Terms of Service\n\nLast modified: December 5, 2014 (view archived version)\n\nThank you for using Google's APIs, other developer services, and associated\nsoftware (collectively, \"APIs\"). By accessing or using our APIs, you are\nagreeing to the terms below. If there is a conflict between these terms and\nadditional terms applicable to a given API, the additional terms will control\nfor that conflict. Collectively, we refer to the terms below, any additional\nterms, terms within the accompanying API documentation, and any applicable\npolicies and guidelines as the \"Terms.\" You agree to comply with the Terms and\nthat the Terms control your relationship with us. So please read all the Terms\ncarefully. If you use the APIs as an interface to, or in conjunction with\nother Google products or services, then the terms for those other products or\nservices also apply.\n\nUnder the Terms, \"Google\" means Google Inc., with offices at 1600 Amphitheatre\nParkway, Mountain View, California 94043, United States, unless set forth\notherwise in additional terms applicable for a given API. We may refer to\n\"Google\" as \"we\", \"our\", or \"us\" in the Terms.\n\n## Section 1: Account and Registration\n\n### a. Accepting the Terms\n\nYou may not use the APIs and may not accept the Terms if (a) you are not of\nlegal age to form a binding contract with Google, or (b) you are a person\nbarred from using or receiving the APIs under the applicable laws of the\nUnited States or other countries including the country in which you are\nresident or from which you use the APIs.\n\n### b. Entity Level Acceptance\n\nIf you are using the APIs on behalf of an entity, you represent and warrant\nthat you have authority to bind that entity to the Terms and by accepting the\nTerms, you are doing so on behalf of that entity (and all references to \"you\"\nin the Terms refer to that entity).\n\n### c. Registration\n\nIn order to access certain APIs you may be required to provide certain\ninformation (such as identification or contact details) as part of the\nregistration process for the APIs, or as part of your continued use of the\nAPIs. Any registration information you give to Google will always be accurate\nand up to date and you'll inform us promptly of any updates.\n\n### d. Subsidiaries and Affiliates\n\nGoogle has subsidiaries and affiliated legal entities around the world. These\ncompanies may provide the APIs to you on behalf of Google and the Terms will\nalso govern your relationship with these companies.\n\n## Section 2: Using Our APIs\n\n### a. Your End Users\n\nYou will require your end users to comply with (and not knowingly enable them\nto violate) applicable law, regulation, and the Terms.\n\n### b. Compliance with Law, Third Party Rights, and Other Google Terms of\nService\n\nYou will comply with all applicable law, regulation, and third party rights\n(including without limitation laws regarding the import or export of data or\nsoftware, privacy, and local laws). You will not use the APIs to encourage or\npromote illegal activity or violation of third party rights. You will not\nviolate any other terms of service with Google (or its affiliates).\n\n### c. Permitted Access\n\nYou will only access (or attempt to access) an API by the means described in\nthe documentation of that API. If Google assigns you developer credentials\n(e.g. client IDs), you must use them with the applicable APIs. You will not\nmisrepresent or mask either your identity or your API Client's identity when\nusing the APIs or developer accounts.\n\n### d. API Limitations\n\nGoogle sets and enforces limits on your use of the APIs (e.g. limiting the\nnumber of API requests that you may make or the number of users you may\nserve), in our sole discretion. You agree to, and will not attempt to\ncircumvent, such limitations documented with each API. If you would like to\nuse any API beyond these limits, you must obtain Google's express consent (and\nGoogle may decline such request or condition acceptance on your agreement to\nadditional terms and/or charges for that use). To seek such approval, contact\nthe relevant Google API team for information (e.g. by using the Google\ndevelopers console).\n\n### e. Open Source Software\n\nSome of the software required by or included in our APIs may be offered under\nan open source license. Open source software licenses constitute separate\nwritten agreements. For certain APIs, open source software is listed in the\ndocumentation. To the limited extent the open source software license\nexpressly supersedes the Terms, the open source license instead sets forth\nyour agreement with Google for the applicable open source software.\n\n### f. Communication with Google\n\nWe may send you certain communications in connection with your use of the\nAPIs. Please review the applicable API documentation for information about\nopting out of certain types of communication.\n\n### g. Feedback\n\nIf you provide feedback or suggestions about our APIs, then we (and those we\nallow) may use such information without obligation to you.\n\n### h. Non-Exclusivity\n\nThe Terms are non-exclusive. You acknowledge that Google may develop products\nor services that may compete with the API Clients or any other products or\nservices.\n\n## Section 3: Your API Clients\n\n### a. API Clients and Monitoring\n\nThe APIs are designed to help you enhance your websites and applications (\"API\nClient(s)\"). YOU AGREE THAT GOOGLE MAY MONITOR USE OF THE APIS TO ENSURE\nQUALITY, IMPROVE GOOGLE PRODUCTS AND SERVICES, AND VERIFY YOUR COMPLIANCE WITH\nTHE TERMS. This monitoring may include Google accessing and using your API\nClient, for example to identify security issues that could affect Google or\nits users. You will not interfere with this monitoring. Google may use any\ntechnical means to overcome such interference. Google may suspend access to\nthe APIs by you or your API Client without notice if we reasonably believe\nthat you are in violation of the Terms.\n\n### b. Security\n\nYou will use commercially reasonable efforts to protect user information\ncollected by your API Client, including personally identifiable information\n(\"PII\"), from unauthorized access or use and will promptly report to your\nusers any unauthorized access or use of such information to the extent\nrequired by applicable law.\n\n### c. Ownership\n\nGoogle does not acquire ownership in your API Clients, and by using our APIs,\nyou do not acquire ownership of any rights in our APIs or the content that is\naccessed through our APIs.\n\n### d. User Privacy and API Clients\n\nYou will comply with all applicable privacy laws and regulations including\nthose applying to PII. You will provide and adhere to a privacy policy for\nyour API Client that clearly and accurately describes to users of your API\nClient what user information you collect and how you use and share such\ninformation (including for advertising) with Google and third parties.\n\n## Section 4: Prohibitions and Confidentiality\n\n### a. API Prohibitions\n\nWhen using the APIs, you may not (or allow those acting on your behalf to):\n\n  1. Sublicense an API for use by a third party. Consequently, you will not create an API Client that functions substantially the same as the APIs and offer it for use by third parties.\n  2. Perform an action with the intent of introducing to Google products and services any viruses, worms, defects, Trojan horses, malware, or any items of a destructive nature.\n  3. Defame, abuse, harass, stalk, or threaten others.\n  4. Interfere with or disrupt the APIs or the servers or networks providing the APIs.\n  5. Promote or facilitate unlawful online gambling or disruptive commercial messages or advertisements.\n  6. Reverse engineer or attempt to extract the source code from any API or any related software, except to the extent that this restriction is expressly prohibited by applicable law.\n  7. Use the APIs for any activities where the use or failure of the APIs could lead to death, personal injury, or environmental damage (such as the operation of nuclear facilities, air traffic control, or life support systems).\n  8. Use the APIs to process or store any data that is subject to the International Traffic in Arms Regulations maintained by the U.S. Department of State.\n  9. Remove, obscure, or alter any Google terms of service or any links to or notices of those terms.\n\nUnless otherwise specified in writing by Google, Google does not intend use of\nthe APIs to create obligations under the Health Insurance Portability and\nAccountability Act, as amended (\"HIPAA\"), and makes no representations that\nthe APIs satisfy HIPAA requirements. If you are (or become) a \"covered entity\"\nor \"business associate\" as defined in HIPAA, you will not use the APIs for any\npurpose or in any manner involving transmitting protected health information\nto Google unless you have received prior written consent to such use from\nGoogle.\n\n### b. Confidential Matters\n\n  1. Developer credentials (such as passwords, keys, and client IDs) are intended to be used by you and identify your API Client. You will keep your credentials confidential and make reasonable efforts to prevent and discourage other API Clients from using your credentials. Developer credentials may not be embedded in open source projects.\n  2. Our communications to you and our APIs may contain Google confidential information. Google confidential information includes any materials, communications, and information that are marked confidential or that would normally be considered confidential under the circumstances. If you receive any such information, then you will not disclose it to any third party without Google's prior written consent. Google confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose Google confidential information when compelled to do so by law if you provide us reasonable prior notice, unless a court orders that we not receive notice.\n\n## Section 5: Content\n\n### a. Content Accessible Through our APIs\n\nOur APIs contain some third party content (such as text, images, videos,\naudio, or software). This content is the sole responsibility of the person\nthat makes it available. We may sometimes review content to determine whether\nit is illegal or violates our policies or the Terms, and we may remove or\nrefuse to display content. Finally, content accessible through our APIs may be\nsubject to intellectual property rights, and, if so, you may not use it unless\nyou are licensed to do so by the owner of that content or are otherwise\npermitted by law. Your access to the content provided by the API may be\nrestricted, limited, or filtered in accordance with applicable law,\nregulation, and policy.\n\n### b. Submission of Content\n\nSome of our APIs allow the submission of content. Google does not acquire any\nownership of any intellectual property rights in the content that you submit\nto our APIs through your API Client, except as expressly provided in the\nTerms. For the sole purpose of enabling Google to provide, secure, and improve\nthe APIs (and the related service(s)) and only in accordance with the\napplicable Google privacy policies, you give Google a perpetual, irrevocable,\nworldwide, sublicensable, royalty-free, and non-exclusive license to Use\ncontent submitted, posted, or displayed to or from the APIs through your API\nClient. \"Use\" means use, host, store, modify, communicate, and publish. Before\nyou submit content to our APIs through your API Client, you will ensure that\nyou have the necessary rights (including the necessary rights from your end\nusers) to grant us the license.\n\n### c. Retrieval of content\n\nWhen a user's non-public content is obtained through the APIs, you may not\nexpose that content to other users or to third parties without explicit opt-in\nconsent from that user.\n\n### d. Data Portability\n\nGoogle supports data portability. For as long as you use or store any user\ndata that you obtained through the APIs, you agree to enable your users to\nexport their equivalent data to other services or applications of their choice\nin a way that's substantially as fast and easy as exporting such data from\nGoogle products and services, subject to applicable laws, and you agree that\nyou will not make that data available to third parties who do not also abide\nby this obligation.\n\n### e. Prohibitions on Content\n\nUnless expressly permitted by the content owner or by applicable law, you will\nnot, and will not permit your end users or others acting on your behalf to, do\nthe following with content returned from the APIs:\n\n  1. Scrape, build databases, or otherwise create permanent copies of such content, or keep cached copies longer than permitted by the cache header;\n  2. Copy, translate, modify, create a derivative work of, sell, lease, lend, convey, distribute, publicly display, or sublicense to any third party;\n  3. Misrepresent the source or ownership; or\n  4. Remove, obscure, or alter any copyright, trademark, or other proprietary rights notices; or falsify or delete any author attributions, legal notices, or other labels of the origin or source of material.\n\n## Section 6: Brand Features; Attribution\n\n### a. Brand Features\n\n\"Brand Features\" is defined as the trade names, trademarks, service marks,\nlogos, domain names, and other distinctive brand features of each party.\nExcept where expressly stated, the Terms do not grant either party any right,\ntitle, or interest in or to the other party's Brand Features. All use by you\nof Google's Brand Features (including any goodwill associated therewith) will\ninure to the benefit of Google.\n\n### b. Attribution\n\nYou agree to display any attribution(s) required by Google as described in the\ndocumentation for the API. Google hereby grants to you a nontransferable,\nnonsublicenseable, nonexclusive license while the Terms are in effect to\ndisplay Google's Brand Features for the purpose of promoting or advertising\nthat you use the APIs. You must only use the Google Brand Features in\naccordance with the Terms and for the purpose of fulfilling your obligations\nunder this Section. In using Google's Brand Features, you must follow the\nGoogle Brand Features Use Guidelines. You understand and agree that Google has\nthe sole discretion to determine whether your attribution(s) and use of\nGoogle's Brand Features are in accordance with the above requirements and\nguidelines.\n\n### c. Publicity\n\nYou will not make any statement regarding your use of an API which suggests\npartnership with, sponsorship by, or endorsement by Google without Google's\nprior written approval.\n\n### d. Promotional and Marketing Use\n\nIn the course of promoting, marketing, or demonstrating the APIs you are using\nand the associated Google products, Google may produce and distribute\nincidental depictions, including screenshots, video, or other content from\nyour API Client, and may use your company or product name. You grant us all\nnecessary rights for the above purposes.\n\n## Section 7: Privacy and Copyright Protection\n\n### a. Google Privacy Policies\n\nBy using our APIs, Google may use submitted information in accordance with our\nprivacy policies.\n\n### b. Google DMCA Policy\n\nWe provide information to help copyright holders manage their intellectual\nproperty online, but we can't determine whether something is being used\nlegally or not without their input. We respond to notices of alleged copyright\ninfringement and terminate accounts of repeat infringers according to the\nprocess set out in the U.S. Digital Millennium Copyright Act. If you think\nsomebody is violating your copyrights and want to notify us, you can find\ninformation about submitting notices and Google's policy about responding to\nnotices in our Help Center.\n\n## Section 8: Termination\n\n### a. Termination\n\nYou may stop using our APIs at any time with or without notice. Further, if\nyou want to terminate the Terms, you must provide Google with prior written\nnotice and upon termination, cease your use of the applicable APIs. Google\nreserves the right to terminate the Terms with you or discontinue the APIs or\nany portion or feature or your access thereto for any reason and at any time\nwithout liability or other obligation to you.\n\n### b. Your Obligations Post-Termination\n\nUpon any termination of the Terms or discontinuation of your access to an API,\nyou will immediately stop using the API, cease all use of the Google Brand\nFeatures, and delete any cached or stored content that was permitted by the\ncache header under Section 5. Google may independently communicate with any\naccount owner whose account(s) are associated with your API Client and\ndeveloper credentials to provide notice of the termination of your right to\nuse an API.\n\n### c. Surviving Provisions\n\nWhen the Terms come to an end, those terms that by their nature are intended\nto continue indefinitely will continue to apply, including but not limited to:\nSections 4b, 5, 8, 9, and 10.\n\n## Section 9: Liability for our APIs\n\n### a. WARRANTIES\n\nEXCEPT AS EXPRESSLY SET OUT IN THE TERMS, NEITHER GOOGLE NOR ITS SUPPLIERS OR\nDISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE APIS. FOR EXAMPLE, WE DON'T\nMAKE ANY COMMITMENTS ABOUT THE CONTENT ACCESSED THROUGH THE APIS, THE SPECIFIC\nFUNCTIONS OF THE APIS, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET\nYOUR NEEDS. WE PROVIDE THE APIS \"AS IS\".\n\nSOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.\nEXCEPT AS EXPRESSLY PROVIDED FOR IN THE TERMS, TO THE EXTENT PERMITTED BY LAW,\nWE EXCLUDE ALL WARRANTIES, GUARANTEES, CONDITIONS, REPRESENTATIONS, AND\nUNDERTAKINGS.\n\n### b. LIMITATION OF LIABILITY\n\nWHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE'S SUPPLIERS AND DISTRIBUTORS, WILL\nNOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA; FINANCIAL LOSSES; OR\nINDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.\n\nTO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS\nSUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIM UNDER THE TERMS, INCLUDING FOR ANY\nIMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE APPLICABLE\nAPIS (OR, IF WE CHOOSE, TO SUPPLYING YOU THE APIS AGAIN) DURING THE SIX MONTHS\nPRIOR TO THE EVENT GIVING RISE TO THE LIABILITY.\n\nIN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE\nFOR ANY EXPENSE, LOSS, OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.\n\n### c. Indemnification\n\nUnless prohibited by applicable law, if you are a business, you will defend\nand indemnify Google, and its affiliates, directors, officers, employees, and\nusers, against all liabilities, damages, losses, costs, fees (including legal\nfees), and expenses relating to any allegation or third-party legal proceeding\nto the extent arising from:\n\n  1. your misuse or your end user's misuse of the APIs;\n  2. your violation or your end user's violation of the Terms; or\n  3. any content or data routed into or used with the APIs by you, those acting on your behalf, or your end users.\n\n## Section 10: General Provisions\n\n### a. Modification\n\nWe may modify the Terms or any portion to, for example, reflect changes to the\nlaw or changes to our APIs. You should look at the Terms regularly. We'll post\nnotice of modifications to the Terms within the documentation of each\napplicable API, to this website, and/or in the Google developers console.\nChanges will not apply retroactively and will become effective no sooner than\n30 days after they are posted. But changes addressing new functions for an API\nor changes made for legal reasons will be effective immediately. If you do not\nagree to the modified Terms for an API, you should discontinue your use of\nthat API. Your continued use of the API constitutes your acceptance of the\nmodified Terms.\n\n### b. U.S. Federal Agency Entities\n\nThe APIs were developed solely at private expense and are commercial computer\nsoftware and related documentation within the meaning of the applicable U.S.\nFederal Acquisition Regulation and agency supplements thereto.\n\n### c. General Legal Terms\n\nWe each agree to contract in the English language. If we provide a translation\nof the Terms, we do so for your convenience only and the English Terms will\nsolely govern our relationship. The Terms do not create any third party\nbeneficiary rights or any agency, partnership, or joint venture. Nothing in\nthe Terms will limit either party's ability to seek injunctive relief. We are\nnot liable for failure or delay in performance to the extent caused by\ncircumstances beyond our reasonable control. If you do not comply with the\nTerms, and Google does not take action right away, this does not mean that\nGoogle is giving up any rights that it may have (such as taking action in the\nfuture). If it turns out that a particular term is not enforceable, this will\nnot affect any other terms. The Terms are the entire agreement between you and\nGoogle relating to its subject and supersede any prior or contemporaneous\nagreements on that subject. For information about how to contact Google,\nplease visit our contact page.\n\nExcept as set forth below: (i) the laws of California, U.S.A., excluding\nCalifornia's conflict of laws rules, will apply to any disputes arising out of\nor related to the Terms or the APIs and (ii) ALL CLAIMS ARISING OUT OF OR\nRELATING TO THE TERMS OR THE APIS WILL BE LITIGATED EXCLUSIVELY IN THE FEDERAL\nOR STATE COURTS OF SANTA CLARA COUNTY, CALIFORNIA, USA, AND YOU AND GOOGLE\nCONSENT TO PERSONAL JURISDICTION IN THOSE COURTS.\n\nIf you are accepting the Terms on behalf of a United States federal government\nentity, then the following applies instead of the paragraph above: the laws of\nthe United States of America, excluding its conflict of laws rules, will apply\nto any disputes arising out of or related to the Terms or the APIs. Solely to\nthe extent permitted by United States Federal law: (i) the laws of the State\nof California (excluding California's conflict of laws rules) will apply in\nthe absence of applicable federal law; and (ii) FOR ALL CLAIMS ARISING OUT OF\nOR RELATING TO THE TERMS OR THE APIS, THE PARTIES CONSENT TO PERSONAL\nJURISDICTION IN, AND THE EXCLUSIVE VENUE OF, THE COURTS IN SANTA CLARA COUNTY,\nCALIFORNIA.\n\nIf you are accepting the Terms on behalf of a United States city, county, or\nstate government entity, then the following applies instead of the paragraph\nabove: the parties agree to remain silent regarding governing law and venue.\n\n  * ### Connect\n\n    * Blog \n    * Facebook \n    * Google+ \n    * Medium \n    * Twitter \n    * YouTube \n  * ### Programs\n\n    * Women Techmakers \n    * Agency Program \n    * GDG \n    * Google Developers Experts \n    * Startup Launchpad \n  * ### Developer Consoles\n\n    * Google API Console \n    * Google Cloud Platform Console \n    * Google Play Console \n    * Firebase Console \n    * Cast SDK Developer Console \n    * Chrome Web Store Dashboard \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n"
  },
  {
    "_id": "5ac3f7255da9ce588fb5185e",
    "url": "https:\/\/www.linkedin.com\/legal\/user-agreement",
    "date_created":"2018-04-03",
    "date_reviewed": "",
    "risk_assessment": "",
    "dom": "##  LinkedIn\r\n\r\n  * Sign in \r\n  * Join now \r\n\r\nMain content starts below.\r\n\r\n  * User Agreement \r\n  * Privacy Policy \r\n  * Cookie Policy \r\n  * Copyright Policy \r\n\r\n#  User Agreement\r\n\r\n_Effective on June 7, 2017_\r\n\r\nWe will update our User Agreement soon. Please see  the preview  .\r\n\r\nOur mission is to connect the world’s professionals to allow them to be more\r\nproductive and successful. Our services are designed to promote economic\r\nopportunity for our members by enabling you and millions of other\r\nprofessionals to meet, exchange ideas, learn, and find opportunities or\r\nemployees, work, and make decisions in a network of trusted relationships.\r\n\r\n##  Table of Contents:\r\n\r\n  1. Introduction \r\n  2. Obligations \r\n  3. Rights and Limits \r\n  4. Disclaimer and Limit of Liability \r\n  5. Termination \r\n  6. Dispute Resolution \r\n  7. General Terms \r\n  8. LinkedIn “Dos” and “Don’ts” \r\n  9. Complaints Regarding Content \r\n  10. How To Contact Us \r\n\r\n##  1\\. Introduction\r\n\r\n###  1.1 Contract\r\n\r\nWhen you use our Services you agree to all of these terms. Your use of our\r\nServices is also subject to our Cookie Policy and our Privacy Policy, which\r\ncovers how we collect, use, share, and store your personal information.\r\n\r\nYou agree that by clicking “Join Now”, “Join LinkedIn”, “Sign Up” or similar,\r\nregistering, accessing or using our services (described below),  **you are\r\nagreeing to enter into a legally binding contract** with LinkedIn (even if you\r\nare using our Services on behalf of a company). If you do not agree to this\r\ncontract (“Contract” or “User Agreement”), do  **not** click “Join Now” (or\r\nsimilar) and do not access or otherwise use any of our Services.\r\n\r\nYour use of our Services is also subject to our  Privacy Policy  and  Cookie\r\nPolicy  .\r\n\r\n####  Services\r\n\r\nThis Contract applies to LinkedIn.com, LinkedIn-branded apps, Slideshare,\r\nLinkedIn Learning and other LinkedIn-related sites, apps, communications and\r\nother services that state that they are offered under this Contract\r\n(“Services”), including the offsite collection of data for those Services,\r\nsuch as our ads and the “Apply with LinkedIn” and “Share with LinkedIn”\r\nplugins. Registered users of our Services are “Members” and unregistered users\r\nare “Visitors”. This Contract applies to both.\r\n\r\n####  LinkedIn\r\n\r\nYou are entering into this Contract with LinkedIn (also referred to as “we”\r\nand “us”). If you reside in the United States, you are entering into this\r\nContract with LinkedIn Corporation and your personal data provided to, or\r\ncollected by or for, our Services is controlled by LinkedIn Corporation. If\r\nyou reside outside the United States, you are entering into this Contract with\r\nLinkedIn Ireland U.C. and your personal data provided to, or collected by or\r\nfor, our Services is controlled by LinkedIn Ireland U.C.\r\n\r\n###  1.2 Members and Visitors\r\n\r\nWhen you register and join the LinkedIn Service, you become a Member. If you\r\nhave chosen not to register for our Services, you may access certain features\r\nas a visitor.\r\n\r\n###  1.3 Change\r\n\r\nWe may modify this Contract, our Privacy Policy and our Cookies Policies from\r\ntime to time. If we make material changes to it, we will provide you notice\r\nthrough our Services, or by other means, to provide you the opportunity to\r\nreview the changes before they become effective. If you object to any changes,\r\nyou may  close your account  . Your continued use of our Services after we\r\npublish or send a notice about our changes to these terms means that you are\r\nconsenting to the updated terms.\r\n\r\n##  2\\. Obligations\r\n\r\n###  2.1 Service Eligibility\r\n\r\nHere are some promises you make to us in this Contract:\r\n\r\nYou’re eligible to enter into this Contract and you are at least our “Minimum\r\nAge.”\r\n\r\nThe Services are not for use by anyone under the age of 16.\r\n\r\nTo use the Services, you agree that: (1) you must be the “ ” (described below)\r\nor older; (2) you will only have one LinkedIn account (and\/or one SlideShare\r\naccount, if applicable), which must be in your real name; and (3) you are not\r\nalready restricted by LinkedIn from using the Services.\r\n\r\nMembers who were below this new Minimum Age when they started using the\r\nServices under a previous User Agreement may continue to use them, as they\r\nhave already reached the new Minimum Age since then or will reach it in the\r\nnear future.\r\n\r\n“Minimum Age” means 16 years old. However, if law requires that you must be\r\nolder in order for LinkedIn to lawfully provide the Services to you without\r\nparental consent (including using of your personal data) then the Minimum Age\r\nis such older age.\r\n\r\n###  2.2 Your Account\r\n\r\nYou’ll keep your password a secret.\r\n\r\nYou will not share an account with anyone else and will follow our rules and\r\nthe law.\r\n\r\nMembers are account holders. You agree to: (1) try to choose a strong and\r\nsecure password; (2) keep your password secure and confidential; (3) not\r\ntransfer any part of your account (e.g., connections) and (4) follow the law\r\nand our list of Dos and Don’ts. You are responsible for anything that happens\r\nthrough your account unless you close it or report misuse.\r\n\r\nAs between you and others (including your employer), your account belongs to\r\nyou. However, if the Services were purchased by another party for you to use\r\n(e.g. Recruiter seat bought by your employer), the party paying for such\r\nService has the right to control access to and get reports on your use of such\r\npaid Service; however, they do not have rights to your personal account.\r\n\r\n###  2.3 Payment\r\n\r\nYou’ll honor your payment obligations and you are okay with us storing your\r\npayment information. You understand that there may be fees and taxes that are\r\nadded to our prices.\r\n\r\nWe don't guarantee refunds.\r\n\r\nIf you buy any of our paid Services (“Premium Services”), you agree to pay us\r\nthe applicable fees and taxes and to  additional terms  specific to the paid\r\nServices. Failure to pay these fees will result in the termination of your\r\npaid Services. Also, you agree that:\r\n\r\n  * Your purchase may be subject to foreign exchange fees or differences in prices based on location (e.g. exchange rates). \r\n  * We may store and continue billing your payment method (e.g. credit card) even after it has expired, to avoid interruptions in your Services and to use to pay other Services you may buy. \r\n  * If you purchase a subscription, your payment method automatically will be charged at the start of each subscription period for the fees and taxes applicable to that period. To avoid future charges, cancel before the renewal date. Learn how to  cancel or suspend  your Premium Services. \r\n  * All of your purchases of Services are subject to LinkedIn’s refund policy. \r\n  * We may calculate taxes payable by you based on the billing information that you provide us at the time of purchase. \r\n\r\nYou can get a copy of your invoice through your LinkedIn account settings\r\nunder “  Purchase History  ”.\r\n\r\n###  2.4 Notices and Service Messages\r\n\r\nYou’re okay with us providing notices to you through our websites, apps, and\r\ncontact information your provided to us. If the contact information you\r\nprovide is out of date, you may miss out on important notices.\r\n\r\nYou agree that we will provide notices to you in the following ways: (1) a\r\nnotice within the Service, or (2) a message sent to the contact information\r\nyou provided us (e.g., email, mobile number, physical address). You agree to\r\nkeep your  contact information  up to date.\r\n\r\nPlease review your settings to  control and limit  the messages you receive\r\nfrom us.\r\n\r\n###  2.5 Sharing\r\n\r\nWhen you share information, others can see, copy and use that information.\r\n\r\nOur Services allow messaging and sharing of information in many ways, such as\r\nyour profile, slide deck, links to news articles, job postings, InMails and\r\nblogs. Information and content that you share or post may be seen by other\r\nMembers or Visitors. Where we have made settings available, we will honor the\r\nchoices you make about who can see content or information (e.g., message\r\ncontent to your addressees, sharing content only to LinkedIn connections,\r\nrestricting your profile visibility from search engines, or opting not to\r\nnotify others of your LinkedIn profile update). For job searching activities,\r\nwe default to not notifying your connections network or the public. So if you\r\napply for a job through our Service or opt to signal that you are interested\r\nin a job, our default is to share it only with the job poster.\r\n\r\nWe are not obligated to publish any information or content on our Service and\r\ncan remove it in our sole discretion, with or without notice.\r\n\r\n##  3\\. Rights and Limits\r\n\r\n###  3.1. Your License to LinkedIn\r\n\r\nYou own all of the content, feedback, and personal information you provide to\r\nus, but you also grant us a non-exclusive license to it.\r\n\r\nWe’ll honor the choices you make about who gets to see your information and\r\ncontent\r\n\r\nYou promise to only provide information and content that you have the right to\r\nshare, and that your LinkedIn profile will be truthful.\r\n\r\nAs between you and LinkedIn, you own the content and information that you\r\nsubmit or post to the Services and you are only granting LinkedIn and our the\r\nfollowing non-exclusive license: A worldwide, transferable and sublicensable\r\nright to use, copy, modify, distribute, publish, and process, information and\r\ncontent that you provide through our Services, without any further consent,\r\nnotice and\/or compensation to you or others. These rights are limited in the\r\nfollowing ways:\r\n\r\n  1. You can end this license for specific content by deleting such content from the Services, or generally by closing your account, except (a) to the extent you shared it with others as part of the Service and they copied, re-shared it or stored it and (b) for the reasonable time it takes to remove from backup and other systems. \r\n  2. We will not include your content in advertisements for the products and services of third parties to others without your separate consent (including sponsored content). However, we have the right, without payment to you or others, to serve ads near your content and information, and your on sponsored content and company pages may be visible, as noted in the Privacy Policy. \r\n  3. We will get your consent if we want to give third parties the right to publish your posts beyond the Service. However, other Members and\/or Visitors may access and share your content and information, consistent with your choices. \r\n  4. While we may edit and make formatting changes to your content (such as translating it, modifying the size, layout or file type or removing metadata), we will not modify the meaning of your expression. \r\n  5. Because you own your content and information and we only have non-exclusive rights to it, you may choose to make it available to others, including under the terms of a  Creative Commons license  . \r\n\r\nYou agree that we may access, store and use any information that you provide\r\nin accordance with the terms of the Privacy Policy and your choices (including\r\nsettings).\r\n\r\nBy submitting suggestions or other feedback regarding our Services to\r\nLinkedIn, you agree that LinkedIn can use and share (but does not have to)\r\nsuch feedback for any purpose without compensation to you.\r\n\r\nYou agree to only provide content or information that does not violate the law\r\nnor anyone’s rights (including intellectual property rights). You also agree\r\nthat your profile information will be truthful. LinkedIn may be required by\r\nlaw to remove certain information or content in certain countries.\r\n\r\n###  3.2 Service Availability\r\n\r\nWe may change, suspend or end any Service, or change and modify prices\r\nprospectively in our discretion. To the extent allowed under law, these\r\nchanges may be effective upon notice provided to you.\r\n\r\nWe may change or discontinue any of our Services. We don’t promise to store or\r\nkeep showing any information and content that you’ve posted.\r\n\r\nLinkedIn is not a storage service. You agree that we have no obligation to\r\nstore, maintain or provide you a copy of any content or information that you\r\nor others provide, except to the extent required by applicable law and as\r\nnoted in our Privacy Policy.\r\n\r\n###  3.3 Other Content, Sites and Apps\r\n\r\nYour use of others’ content and information posted on our Services, is at your\r\nown risk.\r\n\r\nOthers may offer their own products and services through LinkedIn, and we\r\naren’t responsible for those third-party activities.\r\n\r\nBy using the Services, you may encounter content or information that might be\r\ninaccurate, incomplete, delayed, misleading, illegal, offensive or otherwise\r\nharmful. LinkedIn generally does not review content provided by our Members or\r\nothers. You agree that we are not responsible for others’ (including other\r\nMembers’) content or information. We cannot always prevent this misuse of our\r\nservices, and you agree that we are not responsible for any such misuse. You\r\nalso acknowledge the risk that you or your organization may be mistakenly\r\nassociated with content about others when we let connections and followers\r\nknow you or your organization were mentioned in the news. You may  opt out  of\r\nthis  feature  .\r\n\r\nYou are responsible for deciding if you want to access or use third party apps\r\nor sites that link from our Services. If you allow a third party app or site\r\nto authenticate you or connect with your LinkedIn account, that app or site\r\ncan access information on LinkedIn related to you and your connections. Third\r\nparty apps and sites have their own legal terms and privacy policies, and you\r\nmay be giving others permission to use your information in ways we would not.\r\nExcept to the limited extent it may be required by applicable law, LinkedIn is\r\nnot responsible for these other sites and apps – use these at your own risk.\r\nPlease see our  Privacy Policy  .\r\n\r\n###  3.4 Limits\r\n\r\nWe have the right to limit how you connect and interact on our Services.\r\n\r\nLinkedIn reserves the right to limit your use of the Services, including the\r\nnumber of your connections and your ability to contact other Members. LinkedIn\r\nreserves the right to restrict, suspend, or terminate your account if LinkedIn\r\nbelieves that you may be in breach of this Contract or law or are misusing the\r\nServices (e.g. violating any Do and Don’ts).\r\n\r\n###  3.5 Intellectual Property Rights\r\n\r\nWe’re providing you notice about our intellectual property rights.\r\n\r\nLinkedIn reserves all of its intellectual property rights in the Services.\r\nUsing the Services does not give you any ownership in our Services or the\r\ncontent or information made available through our Services. Trademarks and\r\nlogos used in connection with the Services are be the trademarks of their\r\nrespective owners. LinkedIn, SlideShare, and “in” logos and other LinkedIn\r\ntrademarks, service marks, graphics, and logos used for our Services are\r\ntrademarks or registered trademarks of LinkedIn.\r\n\r\n##  4\\. Disclaimer and Limit of Liability\r\n\r\n###  4.1 No Warranty\r\n\r\nThis is our disclaimer of legal liability for the quality, safety, or\r\nreliability of our Services.\r\n\r\nTO THE EXTENT ALLOWED UNDER LAW, LINKEDIN AND ITS AFFILIATES (AND THOSE THAT\r\nLINKEDIN WORKS WITH TO PROVIDE THE SERVICES) (A) DISCLAIM ALL IMPLIED\r\nWARRANTIES AND REPRESENTATIONS (E.G. WARRANTIES OF MERCHANTABILITY, FITNESS\r\nFOR A PARTICULAR PURPOSE, ACCURACY OF DATA, AND NONINFRINGEMENT); (B) DO NOT\r\nGUARANTEE THAT THE SERVICES WILL FUNCTION WITHOUT INTERRUPTION OR ERRORS, AND\r\n(C) PROVIDE THE SERVICE (INCLUDING CONTENT AND INFORMATION) ON AN “AS IS” AND\r\n“AS AVAILABLE” BASIS.\r\n\r\nSOME LAWS DO NOT ALLOW CERTAIN DISCLAIMERS, SO SOME OR ALL OF THESE\r\nDISCLAIMERS MAY NOT APPLY TO YOU.\r\n\r\n###  4.2 Exclusion of Liability\r\n\r\nThese are the limits of legal liability we may have to you.\r\n\r\nTO THE EXTENT PERMITTED UNDER LAW (AND UNLESS LINKEDIN HAS ENTERED INTO A\r\nSEPARATE WRITTEN AGREEMENT THAT OVERRIDES THIS CONTRACT), LINKEDIN AND ITS\r\nAFFILIATES (AND THOSE THAT LINKEDIN WORKS WITH TO PROVIDE THE SERVICES) SHALL\r\nNOT BE LIABLE TO YOU OR OTHERS FOR ANY INDIRECT, INCIDENTAL, SPECIAL,\r\nCONSEQUENTIAL OR PUNITIVE DAMAGES, OR ANY LOSS OF DATA, OPPORTUNITIES,\r\nREPUTATION, PROFITS OR REVENUES, RELATED TO THE SERVICES (E.G. OFFENSIVE OR\r\nDEFAMATORY STATEMENTS, DOWN TIME OR LOSS, USE OF, OR CHANGES TO, YOUR\r\nINFORMATION OR CONTENT).\r\n\r\nIN NO EVENT SHALL THE LIABILITY OF LINKEDIN AND ITS AFFILIATES (AND THOSE THAT\r\nLINKEDIN WORKS WITH TO PROVIDE THE SERVICES) EXCEED, IN THE AGGREGATE FOR ALL\r\nCLAIMS, AN AMOUNT THAT IS THE LESSER OF (A) FIVE TIMES THE MOST RECENT MONTHLY\r\nOR YEARLY FEE THAT YOU PAID FOR A PREMIUM SERVICE, IF ANY, OR (B) US $1000.\r\n\r\nTHIS LIMITATION OF LIABILITY IS PART OF THE BASIS OF THE BARGAIN BETWEEN YOU\r\nAND LINKEDIN AND SHALL APPLY TO ALL CLAIMS OF LIABILITY (E.G. WARRANTY, TORT,\r\nNEGLIGENCE, CONTRACT, LAW) AND EVEN IF LINKEDIN OR ITS AFFILIATES HAS BEEN\r\nTOLD OF THE POSSIBILITY OF ANY SUCH DAMAGE, AND EVEN IF THESE REMEDIES FAIL\r\nTHEIR ESSENTIAL PURPOSE.\r\n\r\nSOME LAWS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY, SO THESE\r\nLIMITS MAY NOT APPLY TO YOU.\r\n\r\n##  5\\. Termination\r\n\r\nWe can each end this Contract anytime we want.\r\n\r\nBoth you and LinkedIn may terminate this Contract at any time with notice to\r\nthe other. On termination, you lose the right to access or use the Services.\r\nThe following shall survive termination:\r\n\r\n  * Our rights to use and disclose your feedback; \r\n  * Members and\/or Visitors’ rights to further re-share content and information you shared through the Service to the extent copied or re-shared prior to termination; \r\n  * Sections 4, 6 and 7 of this Contract; \r\n  * Any amounts owed by either party prior to termination remain owed after termination. \r\n\r\nYou can visit our  Help Center  to close your account.\r\n\r\n##  6\\. Dispute Resolution\r\n\r\nIn the unlikely event we end up in a legal dispute, we agree to resolve it in\r\nCalifornia courts (using California law) or Dublin, Ireland courts (using\r\nIrish law).\r\n\r\n**If you live in the European Union** : You agree that the laws of Ireland,\r\nexcluding conflict of laws rules, shall exclusively govern any dispute\r\nrelating to this Contract and\/or the Services. We both agree that all of these\r\nclaims can only be litigated in Dublin, Ireland, and we each agree to personal\r\njurisdiction of the courts located in Dublin, Ireland.\r\n\r\n**For all others, including those who live outside of the United States** ,\r\nyou agree that the laws of the State of California, U.S.A., excluding its\r\nconflict of laws rules, shall exclusively govern any dispute relating to this\r\nContract and\/or the Services. We both agree that all of these claims can only\r\nbe litigated in the federal or state courts in Santa Clara County, California,\r\nUSA, and we each agree to personal jurisdiction in those courts.\r\n\r\n##  7\\. General Terms\r\n\r\nHere are some important details about how to read the Contract.\r\n\r\nIf a court with authority over this Contract finds any part of it not\r\nenforceable, you and us agree that the court should modify the terms to make\r\nthat part enforceable while still achieving its intent. If the court cannot do\r\nthat, you and us agree to ask the court to remove that unenforceable part and\r\nstill enforce the rest of this Contract. To the extent allowed by law, the\r\nEnglish language version of this Contract is binding and other translations\r\nare for convenience only. This Contract (including additional terms that may\r\nbe provided by us when you engage with a feature of the Services) is the only\r\nagreement between us regarding the Services and supersedes all prior\r\nagreements for the Services.\r\n\r\nIf we don't act to enforce a breach of this Contract, that does not mean that\r\nLinkedIn has waived its right to enforce this Contract. You may not assign or\r\ntransfer this Contract (or your membership or use of Services) to anyone\r\nwithout our consent. However, you agree that LinkedIn may assign this Contract\r\nto its affiliates or a party that buys it without your consent. There are no\r\nthird party beneficiaries to this Contract.\r\n\r\nWe reserve the right to change the terms of this Contract and will provide you\r\nnotice if we do and we agree that changes cannot be retroactive. If you don't\r\nagree to these changes, you must stop using the Services.\r\n\r\nYou agree that the only way to provide us legal notice is at the addresses\r\nprovided in Section 10.\r\n\r\n##  8\\. LinkedIn “Dos” and “Don’ts”\r\n\r\n###  8.1. Dos\r\n\r\n**You agree that you will:**\r\n\r\n  1. Comply with all applicable laws, including, without limitation, privacy laws, intellectual property laws, anti-spam laws, export control laws, tax laws, and regulatory requirements; \r\n  2. Provide accurate information to us and keep it updated; \r\n  3. Use your real name on your profile; \r\n  4. Use the Services in a professional manner. \r\n\r\n###  8.2. Don’ts\r\n\r\n**You agree that you will _not_ : **\r\n\r\n  1. Act in an unlawful or unprofessional manner in connection with our Services, including being dishonest, abusive or discriminatory; \r\n  2. Post inaccurate, defamatory obscene, shocking, hateful, threatening or otherwise inappropriate content or airing personal grievances or disputes; \r\n  3. Use an  image  that is not your likeness or a head-shot photo for your profile; \r\n  4. Create a false identity on LinkedIn. The occasional creation of clearly fictional profiles by LinkedIn or with its express permission in connection with a promotional campaign does not waive this obligation; \r\n  5. Misrepresent your identity (e.g. by using a pseudonym), your current or previous positions, qualifications or affiliations with a person or entity; \r\n  6. Create a Member profile for anyone other than yourself (a real person); \r\n  7. Invite people you do not know to join your network; \r\n  8. Use or attempt to use another's account; \r\n  9. Harass, abuse or harm another person; \r\n  10. Send or post any unsolicited or unauthorized advertising, “junk mail,” “spam,” “chain letters,” “pyramid schemes,” or any form of solicitation unauthorized by LinkedIn; \r\n  11. Develop, support or use software, devices, scripts, robots, or any other means or processes (including crawlers, browser plugins and add-ons, or any other technology or manual work) to scrape the Services or otherwise copy profiles and other data from the Services; \r\n  12. Bypass or circumvent any access controls or Service use limits (such as caps on keyword searches); \r\n  13. Copy, use, disclose or distribute any information obtained from the Services, whether directly or through third parties (such as search engines), without the consent of LinkedIn; \r\n  14. Solicit email addresses or other personal information from Members you don’t know, without authorization. \r\n  15. Use, disclose or distribute any data obtained in violation of this policy; \r\n  16. Disclose information that you do not have the consent to disclose (such as confidential information of others (including your employer)); \r\n  17. Violate the intellectual property rights of others, including copyrights, patents, trademarks, trade secrets, or other proprietary rights. For example, do not copy or distribute (except through the available sharing functionality) the posts or other content of others without their permission, which they may give by posting under a Creative Commons license; \r\n  18. Violate the intellectual property or other rights of LinkedIn, including, without limitation, (i) copying or distributing our learning videos or other materials or (ii) copying or distributing our technology, unless it is released under open source licenses; (iii) using the word “LinkedIn” or our logos in any business name, email, or URL except as provided in the  Brand Guidelines  ; \r\n  19. Use LinkedIn invitations to send messages to people who don’t know you or who are unlikely to recognize you as a known contact; \r\n  20. Post anything that contains software viruses, worms, or any other harmful code; \r\n  21. Manipulate identifiers in order to disguise the origin of any message or post transmitted through the Services. \r\n  22. Create profiles or provide content that promotes escort services or prostitution. \r\n  23. Create or operate a pyramid scheme, fraud or other similar practice; \r\n  24. Reverse engineer, decompile, disassemble, decipher or otherwise attempt to derive the source code for the Services or any related technology that is not open source; \r\n  25. Imply or state that you are affiliated with or endorsed by LinkedIn without our express consent (e.g., representing yourself as an accredited LinkedIn trainer); \r\n  26. Rent, lease, loan, trade, sell\/re-sell access to the Services or related data; \r\n  27. Sell, sponsor, or otherwise monetize any Service without LinkedIn’s consent; \r\n  28. Deep-link to our Services for any purpose other than to promote your profile or a Group on our Services, without LinkedIn’s consent; \r\n  29. Remove any copyright, trademark or other proprietary rights notices contained in or on our Service; \r\n  30. Remove, cover or obscure any advertisement included on the Services; \r\n  31. Use bots or other automated methods to access the Services, add or download contacts, send or redirect messages; \r\n  32. Monitor the Services’ availability, performance or functionality for any competitive purpose; \r\n  33. Engage in “framing,” “mirroring,” or otherwise simulating the appearance or function of the Services; \r\n  34. Overlaying or otherwise modifying the Services or their appearance; \r\n  35. Access the Services except through the interfaces expressly provided by LinkedIn, such as its mobile applications, linkedin.com and slideshare.net; \r\n  36. Use a Service for tasks that it is not intended for; \r\n  37. Override any security feature of the Services; \r\n  38. Interfere with the operation of, or place an unreasonable load on, the Services (e.g., spam, denial of service attack, viruses, gaming algorithms); and\/or \r\n  39. Violate the  Professional Community Guidelines  or any additional terms concerning a specific Service that are provided when you sign up for or start using such Service. \r\n\r\n##  9\\. Complaints Regarding Content\r\n\r\nWe respect the intellectual property rights of others. We require that\r\ninformation posted by Members be accurate and not in violation of the\r\nintellectual property rights or other rights of third parties. We provide a\r\npolicy and process  for complaints concerning content posted by our Members.\r\n\r\n##  10\\. How To Contact Us\r\n\r\nIf you want to send us notices or service of process, please contact us:\r\n\r\nONLINE\r\n\r\nOR BY  MAIL\r\n\r\n  * Sign up \r\n  * Help Center \r\n  * About \r\n    * Press \r\n    * Blog \r\n    * Developers \r\n  * Careers \r\n  * Advertising \r\n  * Talent Solutions \r\n  * Sales Solutions \r\n  * Small Business \r\n  * Mobile \r\n  * Language \r\n  * Online Learning \r\n\r\n  * Search Jobs \r\n\r\n  * Directories \r\n  * Members \r\n  * Pulse \r\n  * Topics \r\n  * Companies \r\n  * Universities \r\n  * Titles \r\n  * ProFinder \r\n\r\n_© 2018_\r\n\r\n  * User Agreement \r\n  * Privacy Policy \r\n  * Community Guidelines \r\n  * Cookie Policy \r\n  * Copyright Policy \r\n  * Unsubscribe",
    "statements": [
      {
        "text": "You agree that by clicking “Join Now”, “Join LinkedIn”, “Sign Up” or similar, registering, accessing or using our services (described below), you are agreeing to enter into a legally binding contract with LinkedIn (even if you are using our Services on behalf of a company). If you do not agree to this contract (“Contract” or “User Agreement”), do not click “Join Now” (or similar) and do not access or otherwise use any of our Services.",
        "tag": [
          "technical requirements"
        ]
      },
      {
        "text": "You are entering into this Contract with LinkedIn (also referred to as “we” and “us”). If you reside in the United States, you are entering into this Contract with LinkedIn Corporation and your personal data provided to, or collected by or for, our Services is controlled by LinkedIn Corporation. If you reside outside the United States, you are entering into this Contract with LinkedIn Ireland U.C. and your personal data provided to, or collected by or for, our Services is controlled by LinkedIn Ireland U.C.",
        "tag": [
          "jurisdiction"
        ]
      },
      {
        "text": "We may modify this Contract, our Privacy Policy and our Cookies Policies from time to time. If we make material changes to it, we will provide you notice through our Services, or by other means, to provide you the opportunity to review the changes before they become effective. If you object to any changes, you may close your account. Your continued use of our Services after we publish or send a notice about our changes to these terms means that you are consenting to the updated terms",
        "tag": [
          "changes to terms"
        ]
      },
      {
        "text": "If you buy any of our paid Services (“Premium Services”), you agree to pay us the applicable fees and taxes and to additional terms specific to the paid Services. ",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "Your purchase may be subject to foreign exchange fees or differences in prices based on location (e.g. exchange rates).",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "We may store and continue billing your payment method (e.g. credit card) even after it has expired, to avoid interruptions in your Services and to use to pay other Services you may buy.",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "If you purchase a subscription, your payment method automatically will be charged at the start of each subscription period for the fees and taxes applicable to that period. To avoid future charges, cancel before the renewal date. Learn how to cancel or suspend your Premium Services.",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "All of your purchases of Services are subject to LinkedIn’s refund policy.",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "We may calculate taxes payable by you based on the billing information that you provide us at the time of purchase",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "We are not obligated to publish any information or content on our Service and can remove it in our sole discretion, with or without notice.",
        "tag": [
          "publication risk"
        ]
      },
      {
        "text": "As between you and LinkedIn, you own the content and information that you submit or post to the Services and you are only granting LinkedIn and our affiliates the following non-exclusive license: A worldwide, transferable and sublicensable right to use, copy, modify, distribute, publish, and process, information and content that you provide through our Services, without any further consent, notice and\/or compensation to you or others.",
        "tag": [
          "use\/modification of sap content"
        ]
      },
      {
        "text": "We will get your consent if we want to give third parties the right to publish your posts beyond the Service. However, other Members and\/or Visitors may access and share your content and information, consistent with your choices.",
        "tag": [
          "informed consent"
        ]
      },
      {
        "text": "Because you own your content and information and we only have non-exclusive rights to it, you may choose to make it available to others, including under the terms of a Creative Commons license.",
        "tag": [
          "use\/modification of sap content"
        ]
      },
      {
        "text": "We may change or discontinue any of our Services. We don’t promise to store or keep showing any information and content that you’ve posted.",
        "tag": [
          "use\/modification of sap content",
          "changes to service",
          "termination\/suspension"
        ]
      },
      {
        "text": "LinkedIn is not a storage service. You agree that we have no obligation to store, maintain or provide you a copy of any content or information that you or others provide, except to the extent required by applicable law and as noted in our Privacy Policy.",
        "tag": [
          "use\/modification of sap content"
        ]
      },
      {
        "text": "By using the Services, you may encounter content or information that might be inaccurate, incomplete, delayed, misleading, illegal, offensive or otherwise harmful. LinkedIn generally does not review content provided by our Members or others. You agree that we are not responsible for others’ (including other Members’) content or information. We cannot always prevent this misuse of our services, and you agree that we are not responsible for any such misuse. You also acknowledge the risk that you or your organization may be mistakenly associated with content about others when we let connections and followers know you or your organization were mentioned in the news.",
        "tag": [
          "liability"
        ]
      },
      {
        "text": "LinkedIn reserves the right to limit your use of the Services, including the number of your connections and your ability to contact other Members. LinkedIn reserves the right to restrict, suspend, or terminate your account if LinkedIn believes that you may be in breach of this Contract or law or are misusing the Services (e.g. violating any Do and Don’ts).",
        "tag": [
          "changes to service",
          "usage limits",
          "termination\/suspension"
        ]
      },
      {
        "text": "TO THE EXTENT ALLOWED UNDER LAW, LINKEDIN AND ITS AFFILIATES (AND THOSE THAT LINKEDIN WORKS WITH TO PROVIDE THE SERVICES) (A) DISCLAIM ALL IMPLIED WARRANTIES AND REPRESENTATIONS (E.G. WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY OF DATA, AND NONINFRINGEMENT); (B) DO NOT GUARANTEE THAT THE SERVICES WILL FUNCTION WITHOUT INTERRUPTION OR ERRORS, AND (C) PROVIDE THE SERVICE (INCLUDING CONTENT AND INFORMATION) ON AN “AS IS” AND “AS AVAILABLE” BASIS.",
        "tag": [
          "as-is and as-available"
        ]
      },
      {
        "text": "TO THE EXTENT PERMITTED UNDER LAW (AND UNLESS LINKEDIN HAS ENTERED INTO A SEPARATE WRITTEN AGREEMENT THAT OVERRIDES THIS CONTRACT), LINKEDIN AND ITS AFFILIATES (AND THOSE THAT LINKEDIN WORKS WITH TO PROVIDE THE SERVICES) SHALL NOT BE LIABLE TO YOU OR OTHERS FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, OR ANY LOSS OF DATA, OPPORTUNITIES, REPUTATION, PROFITS OR REVENUES, RELATED TO THE SERVICES (E.G. OFFENSIVE OR DEFAMATORY STATEMENTS, DOWN TIME OR LOSS, USE OF, OR CHANGES TO, YOUR INFORMATION OR CONTENT).",
        "tag": [
          "liability"
        ]
      },
      {
        "text": "SOME LAWS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY, SO THESE LIMITS MAY NOT APPLY TO YOU.",
        "tag": [
          "liability"
        ]
      },
      {
        "text": "IN NO EVENT SHALL THE LIABILITY OF LINKEDIN AND ITS AFFILIATES (AND THOSE THAT LINKEDIN WORKS WITH TO PROVIDE THE SERVICES) EXCEED, IN THE AGGREGATE FOR ALL CLAIMS, AN AMOUNT THAT IS THE LESSER OF (A) FIVE TIMES THE MOST RECENT MONTHLY OR YEARLY FEE THAT YOU PAID FOR A PREMIUM SERVICE, IF ANY, OR (B) US $1000.",
        "tag": [
          "liability"
        ]
      },
      {
        "text": "THIS LIMITATION OF LIABILITY IS PART OF THE BASIS OF THE BARGAIN BETWEEN YOU AND LINKEDIN AND SHALL APPLY TO ALL CLAIMS OF LIABILITY (E.G. WARRANTY, TORT, NEGLIGENCE, CONTRACT, LAW) AND EVEN IF LINKEDIN OR ITS AFFILIATES HAS BEEN TOLD OF THE POSSIBILITY OF ANY SUCH DAMAGE, AND EVEN IF THESE REMEDIES FAIL THEIR ESSENTIAL PURPOSE.",
        "tag": [
          "liability"
        ]
      },
      {
        "text": "Both you and LinkedIn may terminate this Contract at any time with notice to the other. On termination, you lose the right to access or use the Services.",
        "tag": [
          "termination\/suspension"
        ]
      },
      {
        "text": "If you live in the European Union: You agree that the laws of Ireland, excluding conflict of laws rules, shall exclusively govern any dispute relating to this Contract and\/or the Services. We both agree that all of these claims can only be litigated in Dublin, Ireland, and we each agree to personal jurisdiction of the courts located in Dublin, Ireland.",
        "tag": [
          "jurisdiction"
        ]
      },
      {
        "text": "For all others, including those who live outside of the United States, you agree that the laws of the State of California, U.S.A., excluding its conflict of laws rules, shall exclusively govern any dispute relating to this Contract and\/or the Services. We both agree that all of these claims can only be litigated in the federal or state courts in Santa Clara County, California, USA, and we each agree to personal jurisdiction in those courts.",
        "tag": [
          "jurisdiction"
        ]
      },
      {
        "text": "We reserve the right to change the terms of this Contract and will provide you notice if we do and we agree that changes cannot be retroactive. If you don't agree to these changes, you must stop using the Services.",
        "tag": [
          "changes to terms"
        ]
      },
      {
        "text": "Develop, support or use software, devices, scripts, robots, or any other means or processes (including crawlers, browser plugins and add-ons, or any other technology or manual work) to scrape the Services or otherwise copy profiles and other data from the Services;",
        "tag": [
          "usage limits",
          "general requirements"
        ]
      },
      {
        "text": "Use, disclose or distribute any data obtained in violation of this policy;",
        "tag": [
          "privacy\/data protection"
        ]
      },
      {
        "text": "Disclose information that you do not have the consent to disclose (such as confidential information of others (including your employer));",
        "tag": [
          "privacy\/data protection"
        ]
      },
      {
        "text": "Reverse engineer, decompile, disassemble, decipher or otherwise attempt to derive the source code for the Services or any related technology that is not open source;",
        "tag": [
          "general requirements"
        ]
      },
      {
        "text": "Monitor the Services’ availability, performance or functionality for any competitive purpose;",
        "tag": [
          "monitor\/audit"
        ]
      }
    ]
  },
  {
    "_id": "5ac3f96a5da9ce588fb51860",
    "url": "https:\/\/www.linkedin.com\/legal\/privacy-policy",
    "date_created":"2018-04-03",
    "date_reviewed": "",
    "risk_assessment": "",
    "dom": "##  LinkedIn\n\n  * Sign in \n  * Join now \n\nMain content starts below.\n\n  * User Agreement \n  * Privacy Policy \n  * Cookie Policy \n  * Copyright Policy \n\n#  Privacy Policy\n\n_Effective on June 7, 2017_\n\nWe will update our Privacy Policy soon. Please see  the preview  .\n\n##  Your Privacy Matters\n\nLinkedIn’s mission is to connect the world’s professionals to allow them to be\nmore productive and successful. Central to this mission is our commitment to\nbe transparent with you about the data we collect about you and how it is used\nand shared.\n\nBy using our Services, you consent to our use of your data under this Privacy\nPolicy.\n\n##  Table of Contents:\n\n  * Introduction \n  * Information We Collect \n  * How We Use Your Data \n  * How We Share Information \n  * Your Choices & Obligations \n  * Other Important Information \n\n##  Introduction\n\nWe are a social network and online platform for professionals. People use our\nservices to find and be found for business opportunities and to connect with\nothers and information. Our Privacy Policy applies to any Member or Visitor to\nthe covered Services.\n\nOur registered users (“  **Members** ”) share their professional identities,\nengage with their network, exchange knowledge and professional insights, post\nand view relevant content, learn and find business and career opportunities.\nContent on some of our services is available to non-members (“  **Visitors**\n”).\n\n####  Data Controllers\n\nIf you reside in the United States, you are entering into the  User Agreement\nwith LinkedIn Corporation, who will be responsible for your personal data\nprovided to, or collected by or for, our Services. If you reside outside the\nUnited States, you are entering into the User Agreement with LinkedIn Ireland\nU.C., who will be the controller of your personal data provided to, or\ncollected by or for, our Services.\n\n####  Services\n\nThis Privacy Policy applies to LinkedIn.com, LinkedIn-branded apps,\nSlideshare, LinkedIn Learning and other LinkedIn-related sites, apps,\ncommunications and services (“  **Services** ”), including off-site Services,\nsuch as our ad services and the “Apply with LinkedIn” and “Share with\nLinkedIn” plugins, but excluding services that state that they are offered\nunder a different privacy policy.\n\nIf you use our Services, you consent to this Privacy Policy, including our\nCookies Policy.\n\n####  Consent\n\nIf you use our Services, you consent to the collection, use and sharing of\nyour personal data under this Privacy Policy (which includes our Cookie Policy\nand other documents referenced in this Privacy Policy) and agree to the  User \nAgreement. We provide you  choices  that allow you to opt-out or control how we \nuse and share your data.\n\nIf you use our Services after an update to this Privacy Policy, you consent to\nthe changed policy.\n\n####  Change\n\nWe may modify this Privacy Policy, and if we make material changes to it, we\nwill provide notice through our Services, or by other means, to provide you\nthe opportunity to review the changes before they become effective. If you\nobject to any changes, you may  close your account  . Your continued use of\nour Services after we publish or send a notice about our changes to this\nPrivacy Policy means that you are consenting to the updated Privacy Policy.\n\n##  1\\. Information We Collect\n\n###  1.1 Information You Provide To Us\n\nYou provide data to create an account with us.\n\n####  Registration\n\nTo create an account you provide data including your name, email address\nand\/or mobile number, and a password. If you register for a premium Service,\nwe ask you for payment (e.g., credit card) and billing information.\n\nYou create your LinkedIn profile (a complete profile helps you get the most\nfrom our Services).\n\n####  Profile\n\nYou have  choices  about the information on your profile, such as your\neducation, work experience, skills, photo,  city or area  and endorsements.\nSome professionals may choose to complete a separate  ProFinder  profile  .\nProfile information helps you to get more from our Services, including helping\nrecruiters and business opportunities find you. It’s your choice whether to\ninclude on your profile.  **Please do not post or add personal data to your\nprofile that you would not want to be publicly available.**\n\nYou give other data to us, such as by syncing your address book or calendar.\n\n####  Posting and Uploading\n\nWe collect personal data from you when you provide, post or upload it to our\nServices, such as when you fill out a form, respond to a survey (e.g.,\nMembers’  salary  ), submit a resume and apply for or save jobs or send\ninvitations. If you opt to import your address book, we receive your contacts\n(including contact information your service provider(s) or app automatically\nadded to your address book when you communicated with addresses or numbers not\nalready in your list). If you sync your email or calendars with our Services,\nwe will collect your “email header” and calendar meeting information (e.g.\ntimes, places, attendees and contacts).\n\n###  1.2 Information From Others\n\nOthers may post or write about you.\n\n####  Content and News\n\nYou and others may post content that includes information about you on our\nServices (as part of blog posts, feed updates and comments, videos). Unless\nyou  opt-out  , we collect public information about you, such as professional-\nrelated news and accomplishments (e.g., patents granted, professional\nrecognition, conference speakers, projects, etc.) and make it available as\npart of our Services (e.g. , or notifications of  mentions in the news  ).\n\nOthers may sync their contacts or calendar with our Services.\n\n####  Contact and Calendar Information\n\nWe receive personal data about you when others import or sync their address\nbook or calendar with our Services, or send messages using our Services\n(including invites or connection requests).\n\nCustomers and partners may provide data to us.\n\n####  Partners\n\nWe receive personal data about you when you use the services of our customers\nand partners, such as prospective employers and applicant tracking systems\nproviding us job application data.\n\n###  1.3 Service Use\n\nWe log your visits and use of our Services, including mobile apps.\n\nWe log usage data when you visit or otherwise use our Services, including our\nsites, app and platform technology (e.g., our off-site plugins), such as when\nyou view or click on content (e.g., learning video) or ads (on or off our\nsites and apps), perform a search, install one of our mobile apps, share\narticles or apply for jobs. We use log-ins, cookies,  device information  and\ninternet protocol (“IP”) addresses to identify you and log your use.\n\n###  1.4 Cookies, Web Beacons and Other Similar Technologies\n\nWe collect data through cookies and similar technologies.\n\nAs further described in our  Cookie Policy  , we use cookies and similar\ntechnologies (e.g., web beacons, pixels, ad tags and device identifiers) to\nrecognize you and\/or your device(s) on, off and across different Services and\ndevices. We also allow some others to use cookies as described in our Cookie\nPolicy. You can control cookies through your browser settings and other tools.\nYou can also  opt out  from our use of cookies and similar technologies that\ntrack your behavior on the sites of others for third party advertising. For\nVisitors, the opt out is  here  .\n\n###  1.5 Your Device and Location\n\nWe receive data from your devices and networks, including location data.\n\nWhen you visit or leave our Services (including our plugins or cookies or\nsimilar technology on the sites of others), we receive the URL of both the\nsite you came from and the one you go to next. We also get information about\nyour IP address, proxy server, operating system, web browser and add-ons,\ndevice identifier and features, and\/or ISP or your mobile carrier. If you use\nour Services from a mobile device, that device will send us data about your\nlocation. Most devices allow you to prevent location data from being sent to\nus and we honor your settings.\n\n###  1.6 Messages\n\nIf you communicate through our Services, we learn about that.\n\nWe collect information about you when you send, receive, or engage with\nmessages in connection with our Services. For example, if you get a LinkedIn\nconnection request, we track whether you have acted on it and will send you\nreminders. We also use  automatic scanning  technology on messages.\n\n###  1.7 Workplace Provided Information\n\nWhen your employer buys a premium Service for you to use at work, they may\ngive us data about you.\n\nAn employer (or other person or entity procuring our Services for your use)\nmay provide us information about their employees or contractors who make use\nof these Services. For example, we will get contact information for “  Company\nPage  ” administrators and for authorizing users of our premium Services, such\nas our recruiting, sales or learning products.\n\n###  1.8 Sites and Services of Others\n\nWe get data when you visit sites that include our plugins, ads or cookies or\nlog-in to others’ services with your LinkedIn account.\n\nWe receive information about your visits and interaction with services\nprovided by others when you log-in with LinkedIn or visit others’ services\nthat include our plugins (such as “Share on LinkedIn” or “Apply with\nLinkedIn”), ads, cookies or similar technologies.\n\n###  1.9 Other\n\nWe are improving our Services, which means we get new data and create new ways\nto use data.\n\nOur Services are dynamic and we often introduce new features, which may\nrequire the collection of new information. If we collect materially different\npersonal data or materially change how we use your data, we will notify you\nand may also modify this Privacy Policy.\n\n##  2\\. How We Use Your Data\n\nWe use your data to provide, support, personalize and develop our Services.\n\nHow we use your personal data will depend on which Services you use, how you\nuse those Services and the choices you make in your  settings  . We use the\ndata that we have about you to provide, support, personalize and make our\nServices (including ads) more relevant and useful to you and others.\n\n###  2.1 Services\n\nOur Services help you connect with others, find and be found for work and\nbusiness opportunities, stay informed, get training and be more productive.\n\nWe use your data to authenticate you and authorize access to our Services.\n\n####  Stay Connected\n\nOur Services allow you to stay in touch, in communication and up to date with\ncolleagues, partners, clients, and other professional contacts. To do so, you\nwill “connect” with the professionals who you choose, and who also wish to\n“connect” with you. When you connect, you will be able to search each others’\nconnections in order to exchange professional opportunities.\n\nWe will use data about you (such as profiles you have viewed or data provided\nthrough address book uploads or partner integrations) to suggest connections\nfor you and others (e.g. Members who share your contacts) and enable you to\ninvite others to become a Member and connect with you. You can also opt to\nallow us to use your precise location or proximity to others to suggest other\nnearby  for you to connect with. It is your choice whether to invite someone\nto our Services, send a connection request, or allow another Member to become\nyour connection. When you invite someone to connect with you, your invitation\nwill include your name, photo, network and contact information. We will send\ninvitation reminders to the person you invited. You can  choose  whether or\nnot to share your own list of connections with your connections.\n\nVisitors have  choices  about how we use their data.\n\n####  Stay Informed\n\nOur Services allow you to stay informed about news, events and ideas regarding\nprofessional topics you care about, and from professionals you respect. Our\nServices also allow you to improve your professional skills, or learn new\nones. We use the information about you to recommend relevant content across\nour Services, suggest skills you may have to add to your profile and skills\nthat you might need to pursue your next opportunity. So, if you let us know\nthat you are interested in a new skill (e.g., by watching a learning video),\nwe will use this information to personalize content in your feed, suggest that\nyou follow certain members on our site, or watch related learning content to\nhelp you towards that new skill. We use your content, activity and other data,\nincluding your name and picture, to provide notices to your network and\nothers. For example, subject to your settings, we may notify others that you\nhave updated your profile, posted a blog, took a , made new connections or\nwere  mentioned in the news  .\n\n####  Career\n\nOur Services allow you to explore careers, evaluate educational opportunities,\nand seek out, and be found for, career opportunities. Your profile can be\nfound by those looking to hire (for a job or a  specific task  ) or be hired\nby you. We will use your data to recommend jobs, show you and others who work\nat a company, in an industry, function or location or have certain skills and\nconnections. You can signal that you are  interested  in changing jobs and\nshare information with job recruiters. We may use your profile and activity to\nrecommend jobs to you and you to recruiters.\n\n####  Productivity\n\nOur Services allow you to collaborate with colleagues, search for potential\nclients, customers, partners and others to do business with. Our Services\nallow you to communicate with other professionals and schedule and prepare\nmeetings with them. Subject to your settings, we scan  messages  to provide\n“bots” or similar tools that facilitate tasks such as scheduling meetings,\ndraft responses, summarize messages or .\n\n###  2.2 Premium Services\n\nOur premium Services allow paying users to search for and contact Members\nthrough our Services, such as searching for and contacting job candidates,\nsales leads and co-workers, manage talent and promote content through social\nmedia.\n\nWe sell premium Services that provide our customers customized-search\nfunctionality and tools (including messaging and activity alerts) as part of\nour talent, marketing and sales solutions. These subscribers can export\nlimited information from your profile, such as name, headline, current\ncompany, current title, and general location (e.g., Dublin), in order to\nmanage sales leads or talent, unless you  opt out  . We do not provide contact\ninformation to these subscribers as part of these premium Services without\nyour consent. A premium Services subscriber can store information he\/she has\nabout you in our premium Services, such as a resume or contact information or\nsales history. The data provided about you by these subscribers is subject to\nthe policies of those subscribers. Other enterprise Services that use your\ndata include LinkedIn  Referrals  (job referrals),  Lookup  (enterprise\ndirectory) and  Elevate  (social promotion of content).  Learn more  .\n\n###  2.3 Communications\n\nWe contact you and enable communications between members. We offer settings to\ncontrol what and how often you receive some types of messages.\n\nWe will contact you through email, notices posted on our websites or apps,\nmessages to your LinkedIn inbox, and other ways through our Services,\nincluding text messages and push notifications. We will send you messages\nabout the availability of our Services, security, or other service-related\nissues. We also send messages about how to use the Services, network updates,\nreminders, job suggestions and promotional messages from us and our partners.\nYou may change your communication  preferences  at any time. Please be aware\nthat you cannot opt out of receiving service messages from us, including\nsecurity and legal notices.\n\nWe also enable  communications  between you and others through our Services,\nincluding for example  invitations  ,  InMail  ,  groups  and  messages\nbetween connections.\n\n###  2.4 Advertising\n\nWe serve you tailored ads both on and off of our Services. We offer you\nchoices to opt out of interest based ads, but you cannot opt out of seeing\ngeneric ads.\n\nWe target (and measure the performance of) ads to Members, Visitors and others\nboth on and off of our Services through a variety of ad networks and\nexchanges, using the following data, whether separately or combined:\n\n  * Data from advertising technologies on and off of our Services, like web beacons, pixels, ad tags, cookies, and device identifiers; \n  * Member-provided information (e.g., contact information, title and industry); \n  * Data from your use of our Services (e.g., search history, feed, content you read, who you follow or is following you, connections, groups participation, page visits, videos you watch, clicking on an ad, etc.), including as described in Section 1.3; \n  * Information from others (e.g. advertising partners, publishers and data aggregators); \n  * Information inferred from data described above (e.g., using job titles to infer age, industry, seniority, and compensation bracket; or names to infer gender). \n\nWe will show you ads called  sponsored content  which look like similar non-\nsponsored content, except that they are labeled ads or sponsored. If you take\nan action (such as like, comment or share) on these ads, your action is\nassociated with your name and viewable by others, including the ad provider.\n\n####  Ad Choices\n\nWe adhere to  self-regulatory principles  for interest-based advertising and\nparticipate in industry  opt outs  from such ads. This does not opt you out of\nreceiving advertising - you will continue to get generic ads or ads by\nadvertisers not listed with these self regulatory tools. You can also  opt out\nspecifically from interest-based advertising served through our platform for\nthird parties. For non-Members, this setting is  here  .\n\n####  Info to Advertisers\n\nWe do not share your personal data with any third-party advertisers or (other\nthan hashed or device identifiers, to the extent they are personal data in\nsome countries) ad networks for their advertising without your separate\npermission. However, if you click on an ad, the ad poster will know you\nvisited the page that you clicked on. Also, advertising partners can associate\npersonal data collected by the advertiser directly from you with our cookies\nand similar technologies. In such instances, we seek to contractually require\nsuch advertisers to obtain your explicit, opt-in consent before doing so.\n\n###  2.5 Marketing\n\nWe promote our Services to you and others.\n\nWe use data and content about Members for invitations and communications\npromoting membership and network growth, engagement and our Services.\n\n###  2.6 Developing Services and Research\n\nWe develop our Services and conduct research.\n\n####  Service Development\n\nWe use data, including public feedback, to conduct  research  and development\nfor the further development of our Services in order to provide you and others\nwith a better, more intuitive and personalized experience, drive membership\ngrowth and engagement on our Services, and help connect professionals to each\nother and to economic opportunity.\n\n####  Other Research\n\nWe seek to create economic opportunity for members of the global workforce and\nto help them be more productive and successful. We use the data available to\nus to research social, economic and workplace trends such as jobs availability\nand skills needed for these  jobs  and policies that help bridge the gap in\nvarious industries and geographic areas. In some cases, we work with trusted\nthird parties to perform this research, under  controls  that are designed to\nprotect your privacy. We publish or allow others to publish economic insights,\npresented as aggregated data rather than personal data.\n\n####  Surveys\n\nPolls and surveys are conducted by us and others through our Services. You are\nnot obligated to respond to polls or surveys and you have choices about the\ninformation you provide. You may  opt out  of survey invitations.\n\n###  2.7 Customer Support\n\nWe use data to help you and fix problems.\n\nWe use the data (which can include your communications) needed to investigate,\nrespond to and resolve complaints and Service issues (e.g., bugs).\n\n###  2.8 Aggregate Insights\n\nWe use data to generate aggregate insights.\n\nWe use your information to produce aggregate insights that do not identify\nyou. For example we may use your data to generate statistics about our users,\ntheir profession or industry, the number of ad impressions served or clicked\non, or the demographic distribution of visitors to a site.\n\n###  2.9 Security and Investigations\n\nWe use data for security, fraud prevention and investigations.\n\nWe use your data (including your communications) if we think it’s necessary\nfor security purposes or to investigate possible fraud or other violations of\nour User Agreement or this Privacy Policy and\/or attempts to harm our Members\nor Visitors.\n\n##  3\\. How We Share Information\n\n###  3.1 Our Services\n\nAny information you include on your profile and any content you post or social\naction (e.g. likes, follows, comments, shares) you take on our Services will\nbe seen by others.\n\n####  Profile\n\nYour profile is fully visible to all Members and customers of our Services. As\ndetailed in our  Help Center  , your settings, degree of connection with the\nviewing Member, the subscriptions they may have, their  usage of our Services\n, access channels and search types (e.g., by name or by keyword) impact the\navailability of your profile and certain fields.\n\n####  Posts, Likes, Follows, Comments, Messages\n\nOur Services allow viewing and sharing information including through posts,\nfollows, likes and comments.\n\n  * When you share a post (e.g., an update, video or blog), the default (which you can  change  ) is to share it publicly. Others who are not your connections will be able to find (including through search engines) and see your post. \n  * When you like, comment on or share another’s post, others will see it, including the person who initiated the post. \n  * In a  group  , posts are visible to others in the group. Your membership in groups is public and part of your profile unless you change the default  settings  . \n  * Any information you share through companies’ or other organizations’ pages on our Services will be viewable by it and others who visit those pages. \n  * When you follow a person or organization, you are visible to others and that “page owner” as a follower. We provide aggregate insights about the followers and viewers to the respective page owners. \n  * We let senders know when you act on their message, subject to your  settings  where applicable. \n\nYour employer can see how you use Services they provided for your work (e.g.\nas a recruiter or sales agent) and related information. We will not show them\nyour job searches or personal messages.\n\n####  Enterprise Accounts\n\nYour employer may offer you access to our enterprise Services such as\nRecruiter, Sales Navigator, Elevate, Referrals, Lookup or our advertising\nCampaign Manager. They can also buy access for you to our online learning\nproducts. Your employer can review and manage your use of such enterprise\nServices.\n\nDepending on the enterprise Service, before you use such Service, we will ask\nfor permission to share relevant data from your profile or use of our non-\nenterprise Services. For example, users of  Sales Navigator  will be asked to\nshare their “social selling index”, a score  calculated  in part based on\ntheir personal account activity. We understand that certain activities such as\njob hunting and personal messages are sensitive and so we do not share those\nwith your employer unless you choose to share it with them through our\nServices (for example, by applying for a new position in the same company or\nmention your job hunting in a message to a co-worker through our Services).\n\n###  3.2 Communication Archival\n\nRegulated Members may need to store communications outside of our Service.\n\nSome Members (or their employers) need, for legal or professional compliance,\nto archive their communications and social media activity, and will use\nservices of others to provide these archival services. We enable such\narchiving outside of our Services. For example, a financial advisor needs to\narchive communications with her clients through our Services in order to\nmaintain her professional financial advisor license.\n\n###  3.3 Others’ Services\n\nYou may link your account with others’ services so that they can look up your\ncontacts’ profiles or post your shares on such platforms.\n\nSubject to your preference, other services may look-up your profile.\n\nWhen you opt to link your account with other services, personal data will\nbecome available to them. The sharing and use of that personal data will be\ndescribed in, or linked to, a consent screen when you opt to link the\naccounts. For example, you may link your Twitter or WeChat account to share\ncontent from our Services into these other services, or your email provider\nmay give you the option to upload your LinkedIn contacts into its own service.\nYou may  revoke  the link with such accounts.\n\nSubject to your  settings  , (e.g., search engine results, mail and calendar\napplications that show a user a “mini” LinkedIn profile of the person they are\nmeeting or messaging, social media , talent and lead managers). “Old” profile\ninformation remains on these services until they update their data cache with\nchanges you made to your profile.\n\n###  3.4 Related Services\n\nWe share your data across our different Services and LinkedIn-affiliated\nentities.\n\nWe will share your personal data with our to provide and develop our Services.\nWe combine information internally across the different Services covered by\nthis Privacy Policy. For example, SlideShare will recommend better content to\nyou based on your LinkedIn profile or the articles you read on Pulse, and\nLinkedIn could personalize your feed or job recommendations based on your\nlearning video history, because we are able to identify you across different\nServices using cookies or similar technologies.\n\n###  3.5 Service Providers\n\nWe may use others to help us with our Services.\n\nWe use others to help us provide our Services (e.g., maintenance, analysis,\naudit, payments, fraud detection, marketing and development). They will have\naccess to your information as reasonably necessary to perform these tasks on\nour behalf and are obligated to not to disclose or use it for other purposes.\n\n###  3.6 Legal Disclosures\n\nWe may need to share your data when we believe it’s required by law or to\nprotect your and our rights and security.\n\nIt is possible that we will need to disclose information about you when\nrequired by law, subpoena, or other legal process or if we have a good faith\nbelief that disclosure is reasonably necessary to (1) investigate, prevent, or\ntake action regarding suspected or actual illegal activities or to assist\ngovernment enforcement agencies; (2) enforce our agreements with you, (3)\ninvestigate and defend ourselves against any third-party claims or\nallegations, (4) protect the security or integrity of our Service (such as by\nsharing with companies facing similar threats); or (5) exercise or protect the\nrights and safety of LinkedIn, our Members, personnel, or others. We attempt\nto notify Members about legal demands for their personal data when appropriate\nin our judgment, unless prohibited by law or court order or when the request\nis an emergency. We may dispute such demands when we believe, in our\ndiscretion, that the requests are overbroad, vague or lack proper authority,\nbut we do not promise to challenge every demand. To learn more see our  Data\nRequest Guidelines  and  Transparency Report  .\n\n###  3.7 Change in Control or Sale\n\nWe may share your data when our business is sold to others, but it must\ncontinue to be used in accordance with this Privacy Policy.\n\nWe can also share your personal data as part of a sale, merger or change in\ncontrol, or in preparation for any of these events. Any other entity which\nbuys us or part of our business will have the right to continue to use your\ndata, but only in the manner set out in this Privacy Policy unless you agree\notherwise.\n\n##  4\\. Your Choices & Obligations\n\n###  4.1 Data Retention\n\nWe keep most of your personal data for as long as your account is open.\n\nWe retain the personal data you provide while your account is in existence or\nas needed to provide you Services. Even if you only use our Services when\nlooking for a new job every few years, we will retain your information and\nkeep your profile open until you decide to close your account. In some cases\nwe choose to retain certain information (e.g., visits to sites carrying our\n“share with LinkedIn” or “apply with LinkedIn”  plugins  without clicking on\nthe plugin) in a depersonalized or aggregated form.\n\n###  4.2 Rights to Access and Control Your Personal Data\n\nYou can access or delete your personal data. You have many choices about how\nyour data is collected, used and shared.\n\nWe provide many  choices  about the collection, use and sharing of your data,\nfrom deleting or correcting data you include in your  profile  and controlling\nthe visibility of your  posts  to advertising  opt-outs  and  communication\ncontrols. We offer  access  to the personal data we have about you (for\nSlideShare, please  contact us  ).\n\n###  4.3 Account Closure\n\nWe keep some of your data even after you close your account.\n\nIf you choose to close your  Linkedin  (or  SlideShare  ) account, your\npersonal data will generally stop being visible to others on our Services\nwithin 24 hours. We generally delete closed account information within 30 days\nof account closure, except as noted below.\n\nWe retain your personal data even after you have closed your account if\nreasonably necessary to comply with our legal obligations (including law\nenforcement requests), meet regulatory requirements, resolve disputes,\nmaintain security, prevent fraud and abuse, enforce our User Agreement, or\nfulfill your request to “unsubscribe” from further messages from us. We will\nretain de-personalized information after your account has been closed.\n\nInformation you have shared with others (e.g., through InMail, updates or\ngroup posts) will remain visible after you closed your account or deleted the\ninformation from your own profile or mailbox, and we do not control data that\nother Members copied out of our Services. Groups content associated with\nclosed accounts will show an unknown user as the source. Your profile may\ncontinue to be displayed in the services of others (e.g., search engine\nresults) until they refresh their cache.\n\n##  5\\. Other Important Information\n\n###  5.1. Security\n\nWe monitor for and try to prevent security breaches. Please use the security\nfeatures available through our Services.\n\nWe implement security safeguards designed to protect your data, such as HTTPS.\nWe regularly monitor our systems for possible vulnerabilities and attacks.\nHowever, we cannot warrant the security of any information that you send us.\nThere is no guarantee that data may not be accessed, disclosed, altered, or\ndestroyed by breach of any of our physical, technical, or managerial\nsafeguards. Please visit our  Safety Center  for additional information about\nsafely using our Services, including  two-factor authentication  .\n\n###  5.2. Cross-Border Data Transfers\n\nWe store and use your data outside your country.\n\nWe process data both inside and outside of the United States.  Learn more\nabout the legal mechanisms we rely on to transfer data across borders.\n\nLinkedIn participates in the EU-U.S. and Swiss-U.S. Privacy Shield frameworks.\nTo learn more, read our  Privacy Shield Statement  .\n\n###  5.3. Direct Marketing and Do Not Track Signals\n\nOur statements regarding direct marketing and “do not track” signals.\n\nWe currently do not share personal data with third parties for their direct\nmarketing purposes without your permission.  Learn more  about this and about\nour response to “do not track” signals.\n\n###  5.4. Contact Information\n\nYou can contact us or use other options to resolve any complaints.\n\nIf you have questions or complaints regarding this Policy, please first\ncontact LinkedIn  online. You can also reach us by  physical mail  . If\ncontacting us does not resolve your complaint, you have more  options  .\n\n  \n\n  * Sign up \n  * Help Center \n  * About \n    * Press \n    * Blog \n    * Developers \n  * Careers \n  * Advertising \n  * Talent Solutions \n  * Sales Solutions \n  * Small Business \n  * Mobile \n  * Language \n  * Online Learning \n\n  * Search Jobs \n\n  * Directories \n  * Members \n  * Pulse \n  * Topics \n  * Companies \n  * Universities \n  * Titles \n  * ProFinder \n\n_© 2018_\n\n  * User Agreement \n  * Privacy Policy \n  * Community Guidelines \n  * Cookie Policy \n  * Copyright Policy \n  * Unsubscribe ",
    "statements": [
      {
        "text": "If you use our Services, you consent to the collection, use and sharing of your personal data under this Privacy Policy (which includes our Cookie Policy and other documents referenced in this Privacy Policy) and agree to the User Agreement. We provide you choices that allow you to opt-out or control how we use and share your data.",
        "tag": [
          "use\/modification of sap content",
          "privacy\/data protection",
          "informed consent"
        ]
      },
      {
        "text": "We may modify this Privacy Policy, and if we make material changes to it, we will provide notice through our Services, or by other means, to provide you the opportunity to review the changes before they become effective. If you object to any changes, you may close your account. Your continued use of our Services after we publish or send a notice about our changes to this Privacy Policy means that you are consenting to the updated Privacy Policy.",
        "tag": [
          "changes to terms"
        ]
      },
      {
        "text": "To create an account you provide data including your name, email address and\/or mobile number, and a password. If you register for a premium Service, we ask you for payment (e.g., credit card) and billing information.",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "We collect personal data from you when you provide, post or upload it to our Services, such as when you fill out a form, respond to a survey (e.g., Members’ salary), submit a resume and apply for or save jobs or send invitations. If you opt to import your address book, we receive your contacts (including contact information your service provider(s) or app automatically added to your address book when you communicated with addresses or numbers not already in your list). If you sync your email or calendars with our Services, we will collect your “email header” and calendar meeting information (e.g. times, places, attendees and contacts).",
        "tag": [
          "privacy\/data protection"
        ]
      },
      {
        "text": "We receive personal data about you when others import or sync their address book or calendar with our Services, or send messages using our Services (including invites or connection requests).",
        "tag": [
          "privacy\/data protection"
        ]
      },
      {
        "text": "We receive personal data about you when you use the services of our customers and partners, such as prospective employers and applicant tracking systems providing us job application data.",
        "tag": [
          "data management and usage"
        ]
      },
      {
        "text": "We log usage data when you visit or otherwise use our Services, including our sites, app and platform technology (e.g., our off-site plugins), such as when you view or click on content (e.g., learning video) or ads (on or off our sites and apps), perform a search, install one of our mobile apps, share articles or apply for jobs. We use log-ins, cookies, device information and internet protocol (“IP”) addresses to identify you and log your use.",
        "tag": [
          "monitor\/audit",
          "data management and usage"
        ]
      },
      {
        "text": "We collect information about you when you send, receive, or engage with messages in connection with our Services. For example, if you get a LinkedIn connection request, we track whether you have acted on it and will send you reminders. We also use automatic scanning technology on messages.",
        "tag": [
          "monitor\/audit",
          "data management and usage"
        ]
      },
      {
        "text": "Our Services are dynamic and we often introduce new features, which may require the collection of new information. If we collect materially different personal data or materially change how we use your data, we will notify you and may also modify this Privacy Policy.",
        "tag": [
          "changes to terms",
          "changes to service"
        ]
      },
      {
        "text": "We sell premium Services that provide our customers customized-search functionality and tools (including messaging and activity alerts) as part of our talent, marketing and sales solutions. These subscribers can export limited information from your profile, such as name, headline, current company, current title, and general location (e.g., Dublin), in order to manage sales leads or talent, unless you opt out. ",
        "tag": [
          "payment"
        ]
      },
      {
        "text": "We use data and content about Members for invitations and communications promoting membership and network growth, engagement and our Services.",
        "tag": [
          "data management and usage"
        ]
      },
      {
        "text": "We use data, including public feedback, to conduct research and development for the further development of our Services in order to provide you and others with a better, more intuitive and personalized experience, drive membership growth and engagement on our Services, and help connect professionals to each other and to economic opportunity.",
        "tag": [
          "data management and usage"
        ]
      },
      {
        "text": "We use the data (which can include your communications) needed to investigate, respond to and resolve complaints and Service issues (e.g., bugs).",
        "tag": [
          "data management and usage"
        ]
      },
      {
        "text": "We use your data (including your communications) if we think it’s necessary for security purposes or to investigate possible fraud or other violations of our User Agreement or this Privacy Policy and\/or attempts to harm our Members or Visitors.",
        "tag": [
          "data security standards"
        ]
      }
    ]
  }
]
