{"_id":{"$oid":"5b312b941c74674b40f84769"},"date_created":"2018-06-24","date_reviewed":"","url":"https://policies.google.com/terms","statements":[{"text":"Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.","tag":["Update to terms"],"comment":"will change with next version."}],"risk_assessment":"To use this ToS do ### and dont do ###","dom":"Google Terms of Service – Privacy & Terms – Google  #  ![Google](/images/branding/googlelogo/1x/googlelogo_color_116x41dp.png)  ##  Privacy & Terms  Skip to content    * Overview    * Privacy Policy    * Terms of Service    * Technologies and Principles    * FAQ    * My Account     * Terms of Service    * Updates   #  Google Terms of Service  This is an archived version of our Terms of Service. View the  current version or  all past versions  .  Last modified: April 14, 2014 (  view archived versions  )  ##  Welcome to Google!  Thanks for using our products and services (“Services”). The Services are provided by Google Inc. (“Google”), located at 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States.  By using our Services, you are agreeing to these terms. Please read them carefully.  Our Services are very diverse, so sometimes additional terms or product requirements (including age requirements) may apply. Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.  ##  Using our Services  You must follow any policies made available to you within the Services.  Don’t misuse our Services. For example, don’t interfere with our Services or try to access them using a method other than the interface and the instructions that we provide. You may use our Services only as permitted by law, including applicable export and re-export control laws and regulations. We may suspend or stop providing our Services to you if you do not comply with our terms or policies or if we are investigating suspected misconduct.  Using our Services does not give you ownership of any intellectual property rights in our Services or the content you access. You may not use content from our Services unless you obtain permission from its owner or are otherwise permitted by law. These terms do not grant you the right to use any branding or logos used in our Services. Don’t remove, obscure, or alter any legal notices displayed in or along with our Services.  Our Services display some content that is not Google’s. This content is the sole responsibility of the entity that makes it available. We may review content to determine whether it is illegal or violates our policies, and we may remove or refuse to display content that we reasonably believe violates our policies or the law. But that does not necessarily mean that we review content, so please don’t assume that we do.  In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.  Some of our Services are available on mobile devices. Do not use such Services in a way that distracts you and prevents you from obeying traffic or safety laws.  ##  Your Google Account  You may need a Google Account in order to use some of our Services. You may create your own Google Account, or your Google Account may be assigned to you by an administrator, such as your employer or educational institution. If you are using a Google Account assigned to you by an administrator, different or additional terms may apply and your administrator may be able to access or disable your account.  To protect your Google Account, keep your password confidential. You are responsible for the activity that happens on or through your Google Account. Try not to reuse your Google Account password on third-party applications. If you learn of any unauthorized use of your password or Google Account,  follow these instructions  .  ##  Privacy and Copyright Protection  Google’s  privacy policies  explain how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policies.  We respond to notices of alleged copyright infringement and terminate accounts of repeat infringers according to the process set out in the U.S. Digital Millennium Copyright Act.  We provide information to help copyright holders manage their intellectual property online. If you think somebody is violating your copyrights and want to notify us, you can find information about submitting notices and Google’s policy about responding to notices  in our Help Center  .  ##  Your Content in our Services  Some of our Services allow you to upload, submit, store, send or receive content. You retain ownership of any intellectual property rights that you hold in that content. In short, what belongs to you stays yours.  When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. The rights you grant in this license are for the limited purpose of operating, promoting, and improving our Services, and to develop new ones. This license continues even if you stop using our Services (for example, for a business listing you have added to Google Maps). Some Services may offer you ways to access and remove content that has been provided to that Service. Also, in some of our Services, there are terms or settings that narrow the scope of our use of the content submitted in those Services. Make sure you have the necessary rights to grant us this license for any content that you submit to our Services.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection. This analysis occurs as the content is sent, received, and when it is stored.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our Services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account. For example, you can choose your settings so your name and photo do not appear in an ad.  You can find more information about how Google uses and stores content in the privacy policy or additional terms for particular Services. If you submit feedback or suggestions about our Services, we may use your feedback or suggestions without obligation to you.  ##  About Software in our Services  When a Service requires or includes downloadable software, this software may update automatically on your device once a new version or feature is available. Some Services may let you adjust your automatic update settings.  Google gives you a personal, worldwide, royalty-free, non-assignable and non- exclusive license to use the software provided to you by Google as part of the Services. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by these terms. You may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  Open source software is important to us. Some software used in our Services may be offered under an open source license that we will make available to you. There may be provisions in the open source license that expressly override some of these terms.  ##  Modifying and Terminating our Services  We are constantly changing and improving our Services. We may add or remove functionalities or features, and we may suspend or stop a Service altogether.  You can stop using our Services at any time, although we’ll be sorry to see you go. Google may also stop providing Services to you, or add or create new limits to our Services at any time.  We believe that you own your data and preserving your access to such data is important. If we discontinue a Service, where reasonably possible, we will give you reasonable advance notice and a chance to get information out of that Service.  ##  Our Warranties and Disclaimers  We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don’t promise about our Services.  OTHER THAN AS EXPRESSLY SET OUT IN THESE TERMS OR ADDITIONAL TERMS, NEITHER GOOGLE NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE SERVICES. FOR EXAMPLE, WE DON’T MAKE ANY COMMITMENTS ABOUT THE CONTENT WITHIN THE SERVICES, THE SPECIFIC FUNCTIONS OF THE SERVICES, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE THE SERVICES “AS IS”.  SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES.  ##  Liability for our Services  WHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE’S SUPPLIERS AND DISTRIBUTORS, WILL NOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA, FINANCIAL LOSSES OR INDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.  TO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIMS UNDER THESE TERMS, INCLUDING FOR ANY IMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE SERVICES (OR, IF WE CHOOSE, TO SUPPLYING YOU THE SERVICES AGAIN).  IN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.  ##  Business uses of our Services  If you are using our Services on behalf of a business, that business accepts these terms. It will hold harmless and indemnify Google and its affiliates, officers, agents, and employees from any claim, suit or action arising from or related to the use of the Services or violation of these terms, including any liability or expense arising from claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees.  ##  About these Terms  We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of that Service.  If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.  These terms control the relationship between Google and you. They do not create any third party beneficiary rights.  If you do not comply with these terms, and we don’t take action right away, this doesn’t mean that we are giving up any rights that we may have (such as taking action in the future).  If it turns out that a particular term is not enforceable, this will not affect any other terms.  The laws of California, U.S.A., excluding California’s conflict of laws rules, will apply to any disputes arising out of or relating to these terms or the Services. All claims arising out of or relating to these terms or the Services will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.  For information about how to contact Google, please visit our  contact page  .  ###  Our legal policies    * Privacy Policy    * Terms of Service    * FAQ   ###  More information    * Technologies and Principles    * Advertising    * How Google uses cookies    * How Google uses pattern recognition    * Types of location data used by Google     * How Google Wallet uses credit card numbers    * How Google Voice works    * How Google uses data when you use our partners' sites or apps   ###  Additional resources    * My Account    * Google Safety Center    * Google Product Privacy Guide    * Your privacy, security, and controls     * Google    * About Google    * Privacy    * Terms "}
{"_id":{"$oid":"5b312c4d1c74674b40f8476b"},"date_created":"2018-06-25","date_reviewed":"","url":"https://policies.google.com/terms","statements":[{"text":"In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.","tag":["Update to terms","technical requirements"],"comment":"Important clause."}],"risk_assessment":"To use this ToS do ### and dont do ###","dom":"# ![Google](https://www.google.com/images/branding/googlelogo/1x/googlelogo_color_74x24dp.png)  ##  Privacy & Terms  #  Terms of Service    * Overview    * Privacy Policy    * Terms of Service    * Technologies and Principles    * FAQ    * Google Account   # ![Google](https://www.google.com/images/branding/googlelogo/1x/googlelogo_color_74x24dp.png)  ##  Privacy & Terms  #  Privacy & Terms    * Overview    * Privacy Policy    * Terms of Service      * Updates    * Technologies and Principles    * FAQ    * Google Account     *     * Using our Services      * Your Google Account      * Privacy and Copyright Protection      * Your Content in our Services      * About Software in our Services      * Modifying and Terminating our Services      * Our Warranties and Disclaimers      * Liability for our Services      * Business uses of our Services      * About these Terms    * Updates   #  Google Terms of Service  Last modified: October 25, 2017 (  view archived versions  )  ##  Welcome to Google!  Thanks for using our products and services (“Services”). The Services are provided by Google LLC (“Google”), located at 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States.  By using our Services, you are agreeing to these terms. Please read them carefully.  Our Services are very diverse, so sometimes additional terms or product requirements (including age requirements) may apply. Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.  ##  Using our Services  You must follow any policies made available to you within the Services.  Don’t misuse our Services. For example, don’t interfere with our Services or try to access them using a method other than the interface and the instructions that we provide. You may use our Services only as permitted by law, including applicable export and re-export control laws and regulations. We may suspend or stop providing our Services to you if you do not comply with our terms or policies or if we are investigating suspected misconduct.  Using our Services does not give you ownership of any intellectual property rights in our Services or the content you access. You may not use content from our Services unless you obtain permission from its owner or are otherwise permitted by law. These terms do not grant you the right to use any branding or logos used in our Services. Don’t remove, obscure, or alter any legal notices displayed in or along with our Services.  Our Services display some content that is not Google’s. This content is the sole responsibility of the entity that makes it available. We may review content to determine whether it is illegal or violates our policies, and we may remove or refuse to display content that we reasonably believe violates our policies or the law. But that does not necessarily mean that we review content, so please don’t assume that we do.  In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.  Some of our Services are available on mobile devices. Do not use such Services in a way that distracts you and prevents you from obeying traffic or safety laws.  ##  Your Google Account  You may need a Google Account in order to use some of our Services. You may create your own Google Account, or your Google Account may be assigned to you by an administrator, such as your employer or educational institution. If you are using a Google Account assigned to you by an administrator, different or additional terms may apply and your administrator may be able to access or disable your account.  To protect your Google Account, keep your password confidential. You are responsible for the activity that happens on or through your Google Account. Try not to reuse your Google Account password on third-party applications. If you learn of any unauthorized use of your password or Google Account,  follow these instructions  .  ##  Privacy and Copyright Protection  Google’s  privacy policies  explain how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policies.  We respond to notices of alleged copyright infringement and terminate accounts of repeat infringers according to the process set out in the U.S. Digital Millennium Copyright Act.  We provide information to help copyright holders manage their intellectual property online. If you think somebody is violating your copyrights and want to notify us, you can find information about submitting notices and Google’s policy about responding to notices  in our Help Center  .  ##  Your Content in our Services  Some of our Services allow you to upload, submit, store, send or receive content. You retain ownership of any intellectual property rights that you hold in that content. In short, what belongs to you stays yours.  When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. The rights you grant in this license are for the limited purpose of operating, promoting, and improving our Services, and to develop new ones. This license continues even if you stop using our Services (for example, for a business listing you have added to Google Maps). Some Services may offer you ways to access and remove content that has been provided to that Service. Also, in some of our Services, there are terms or settings that narrow the scope of our use of the content submitted in those Services. Make sure you have the necessary rights to grant us this license for any content that you submit to our Services.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection. This analysis occurs as the content is sent, received, and when it is stored.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our Services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account. For example, you can choose your settings so your name and photo do not appear in an ad.  You can find more information about how Google uses and stores content in the privacy policy or additional terms for particular Services. If you submit feedback or suggestions about our Services, we may use your feedback or suggestions without obligation to you.  ##  About Software in our Services  When a Service requires or includes downloadable software, this software may update automatically on your device once a new version or feature is available. Some Services may let you adjust your automatic update settings.  Google gives you a personal, worldwide, royalty-free, non-assignable and non- exclusive license to use the software provided to you by Google as part of the Services. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by these terms. You may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  Open source software is important to us. Some software used in our Services may be offered under an open source license that we will make available to you. There may be provisions in the open source license that expressly override some of these terms.  ##  Modifying and Terminating our Services  We are constantly changing and improving our Services. We may add or remove functionalities or features, and we may suspend or stop a Service altogether.  You can stop using our Services at any time, although we’ll be sorry to see you go. Google may also stop providing Services to you, or add or create new limits to our Services at any time.  We believe that you own your data and preserving your access to such data is important. If we discontinue a Service, where reasonably possible, we will give you reasonable advance notice and a chance to get information out of that Service.  ##  Our Warranties and Disclaimers  We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don’t promise about our Services.  Other than as expressly set out in these terms or additional terms, neither Google nor its suppliers or distributors make any specific promises about the Services. For example, we don’t make any commitments about the content within the Services, the specific functions of the Services, or their reliability, availability, or ability to meet your needs. We provide the Services “as is”.  Some jurisdictions provide for certain warranties, like the implied warranty of merchantability, fitness for a particular purpose and non-infringement. To the extent permitted by law, we exclude all warranties.  ##  Liability for our Services  When permitted by law, Google, and Google’s suppliers and distributors, will not be responsible for lost profits, revenues, or data, financial losses or indirect, special, consequential, exemplary, or punitive damages.  To the extent permitted by law, the total liability of Google, and its suppliers and distributors, for any claims under these terms, including for any implied warranties, is limited to the amount you paid us to use the Services (or, if we choose, to supplying you the Services again).  In all cases, Google, and its suppliers and distributors, will not be liable for any loss or damage that is not reasonably foreseeable.  We recognize that in some countries, you might have legal rights as a consumer. If you are using the Services for a personal purpose, then nothing in these terms or any additional terms limits any consumer legal rights which may not be waived by contract.  ##  Business uses of our Services  If you are using our Services on behalf of a business, that business accepts these terms. It will hold harmless and indemnify Google and its affiliates, officers, agents, and employees from any claim, suit or action arising from or related to the use of the Services or violation of these terms, including any liability or expense arising from claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees.  ##  About these Terms  We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of that Service.  If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.  These terms control the relationship between Google and you. They do not create any third party beneficiary rights.  If you do not comply with these terms, and we don’t take action right away, this doesn’t mean that we are giving up any rights that we may have (such as taking action in the future).  If it turns out that a particular term is not enforceable, this will not affect any other terms.  The courts in some countries will not apply California law to some types of disputes. If you reside in one of those countries, then where California law is excluded from applying, your country’s laws will apply to such disputes related to these terms. Otherwise, you agree that the laws of California, U.S.A., excluding California’s choice of law rules, will apply to any disputes arising out of or relating to these terms or the Services. Similarly, if the courts in your country will not permit you to consent to the jurisdiction and venue of the courts in Santa Clara County, California, U.S.A., then your local jurisdiction and venue will apply to such disputes related to these terms. Otherwise, all claims arising out of or relating to these terms or the services will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.  For information about how to contact Google, please visit our  contact page  .    * Google    * About Google    * Privacy    * Terms "}
{"_id":{"$oid":"5b4e63f91c746747a0c035de"},"date_created":"2018-04-03","date_reviewed":"","url":"https://developers.google.com/terms/site-terms","statements":[{"text":"By using Google Developers (the \"Service\"), you agree to be bound by our Google Terms of Services located at http://www.google.com/accounts/TOS as well as these additional terms. Google may change these terms from time to time and post any modified terms at http://developers.google.com/site-terms. You understand and agree that if you use the Service after the date on which these terms have changed, Google will treat your use as acceptance of the updated terms.","tag":["technical requirements"],"comment":""}],"risk_assessment":"","dom":"![Google\nDevelopers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14\n/lockup-color.png)\n\nAll Products\n\nSign in\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n#  Google Developers Site Terms of Service\n\nImportant: This Terms of Service applies to the developers.google.com\nwebsite. Please click the \"Terms\" link found in the sidebar of each API or\nother product or service for its specific Terms of Service.\n\n## Google Developers Additional Terms\n\nBy using Google Developers (the \"Service\"), you agree to be bound by our\nGoogle Terms of Services located at http://www.google.com/accounts/TOS as well\nas these additional terms. Google may change these terms from time to time and\npost any modified terms at http://developers.google.com/site-terms. You\nunderstand and agree that if you use the Service after the date on which these\nterms have changed, Google will treat your use as acceptance of the updated\nterms.\n\n## Your feedback and suggestions\n\nBy submitting feedback and suggestions, you grant a non-exclusive, perpetual,\nirrevocable, and royalty-free license to any intellectual property rights you\nmay have in your feedback and suggestions to Google to use to improve any\nGoogle products or services. You acknowledge that submission of feedback and\nsuggestions is voluntarily and Google may consider or is developing technology\nthat is the same or similar to your feedback or suggestions.\n\n  * ### Connect\n\n    * Blog \n    * Facebook \n    * Google+ \n    * Medium \n    * Twitter \n    * YouTube \n  * ### Programs\n\n    * Women Techmakers \n    * Agency Program \n    * GDG \n    * Google Developers Experts \n    * Startup Launchpad \n  * ### Developer Consoles\n\n    * Google API Console \n    * Google Cloud Platform Console \n    * Google Play Console \n    * Firebase Console \n    * Cast SDK Developer Console \n    * Chrome Web Store Dashboard \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n"}
{"_id":{"$oid":"5b4e646a1c746747a0c035e0"},"date_created":"2018-04-03","date_reviewed":"2018-07-18","url":"https://developers.google.com/maps/terms","statements":[{"text":"If you use the Maps API(s) in conjunction with any other Google products, including any other Google API(s), (collectively, the Service and all other Google products and services are referred to as the \"Google Services\"), your agreement with Google will also include the terms applicable to those Google Services. All of these are referred to as the \"Additional Terms.\" If Additional Terms apply, they will be accessible to you either within or through your use of the applicable Google Services. If there is any contradiction between the Additional Terms and the Maps APIs Terms, then the Maps APIs Terms will take precedence only as they relate to the Maps API(s), and not to any other Google Services.","tag":["technical requirements"],"comment":""},{"text":"Google reserves the right to make changes to the Terms from time to time. When these changes are made, Google will make a new copy of the Terms available at http://developers.google.com/maps/terms (or such other URL as Google may provide). You understand and agree that if you use the Service after the date on which the Terms have changed, Google will treat your use as acceptance of the updated Terms. If a modification is unacceptable to you, you may terminate this agreement by ceasing use of the Maps API(s).","tag":["changes to terms"],"comment":"needs review"},{"text":"You must not provide to Google: (a) any personally identifiable information or device identifiers; or (b) any European person’s Personal Data (where “European” means “European Economic Area or Switzerland” and “Personal Data” has the meaning provided in the General Data Protection Regulation (EU) 2016/679 of the European Parliament and of the Council of April 27, 2016). Users of your Maps API Implementation may provide information directly to Google through your Maps API Implementation, as needed.","tag":["technical requirements"],"comment":"needs review"},{"text":"You understand and agree that Google may limit the number of transactions you may send or receive through the Service; such fixed upper limits may be set by Google at any time, at Google’s discretion. ","tag":["changes to service","usage limits"],"comment":"needs review"},{"text":"Google will announce if it intends to remove major features from, or discontinue, an API or the Service.","tag":["changes to service"],"comment":"needs review"},{"text":"In order to access the Service, you must have and maintain a Google Account in good standing. You must ensure that any information you give to Google in connection with your Google Account or the Service will always be accurate, correct, and up to date.","tag":["general requirements"],"comment":"needs review"},{"text":"You understand and agree that Google and its licensors and their suppliers (as applicable) own all legal right, title, and interest in and to the Service and Content, including any intellectual property rights in the Service and Content (whether those rights are registered or not, and wherever in the world those rights may exist).","tag":["ownership"],"comment":"needs review"},{"text":"Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to use the Service as provided by Google, in the manner permitted by the Terms.","tag":["Rights"],"comment":"needs review"},{"text":"Subject to these Terms (including Section 8.4(b), Section 9 (License Requirements), and Section 10 (License Restrictions)), during the term of this agreement, Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to display Google’s Brand Features solely for the purposes of (i) promoting or advertising your authorized use of the Service in accordance with this Section and (ii) fulfilling your obligations under the Terms","tag":["publicity"],"comment":"needs review"}],"risk_assessment":"new RA\n","dom":"![Google Maps\nAPIs](https://www.gstatic.com/images/branding/product/1x/maps_64dp.png)\n\n  * Home \n  * Documentation \n  * Pricing and Plans \n\nAll Products\n\nSign in\n\n  * Home \n  * Documentation \n  * Pricing and Plans \n  * All Products \n\n  * Products \n  * Google Maps APIs \n\n#  Google Maps APIs Terms of Service\n\nThank you for your interest in the Google Maps APIs. The Google Maps APIs are\na collection of services that allow you to include maps, geocoding, places,\nand other content from Google in your web pages or applications.\n\nLast Updated: January 4, 2018\n\nThis page contains the Google Maps APIs Terms of Service. If you have\nquestions about these terms, please consult the FAQ’s Terms of Service\nsection. These terms do not apply if you have entered into a separate written\nagreement with Google (such as a Google Maps APIs Premium Plan or Google Maps\nAPIs for Work agreement) related to the Google Maps APIs.\n\n## 1\\. Your relationship with Google.\n\n. Your use of any of the Google Maps APIs (referred to in this document as the\n\" Maps API(s) \" or the \" Service \") is subject to the terms of a legal\nagreement between you and Google (the \" Terms \"). \" Google \" means\neither (a) Google Ireland Limited, with offices at Gordon House, Barrow\nStreet, Dublin 4, Ireland, if your billing address is in any country within\nEurope, the Middle East, or Africa (\" EMEA \"); (b) Google Asia Pacific\nPte. Ltd., with offices at 70 Pasir Panjang Road, #03-71, Mapletree Business\nCity, Singapore 117371, if your billing address is in any country within the\nAsia Pacific region excluding Australia (\" APAC \"); (c) Google Australia\nPty Ltd. with offices at Level 5, 48 Pirrama Road, Pyrmont 2009, NSW,\nAustralia, if your billing address is in Australia; or (d) Google Inc., with\noffices at 1600 Amphitheatre Parkway, Mountain View, California 94043, USA, if\nyour billing address is in any country in the world other than those in EMEA,\nAPAC or Australia.\n\n.\n\n  1. Unless otherwise agreed in writing with Google, the Terms will include the following: \n    1. the terms and conditions in this document (the \" Maps APIs Terms \"); \n    2. the  Legal Notices; and \n    3. the  Privacy Policy. \n  2. Before you use the Maps API(s), you should read each of the documents comprising the Terms, and print or save a local copy for your records. \n\n. If you use the Maps API(s) in conjunction with any other Google products,\nincluding any other Google API(s), (collectively, the Service and all other\nGoogle products and services are referred to as the \" Google Services \"),\nyour agreement with Google will also include the terms applicable to those\nGoogle Services. All of these are referred to as the \" Additional Terms.\"\nIf Additional Terms apply, they will be accessible to you either within or\nthrough your use of the applicable Google Services. If there is any\ncontradiction between the Additional Terms and the Maps APIs Terms, then the\nMaps APIs Terms will take precedence only as they relate to the Maps API(s),\nand not to any other Google Services.\n\n. If there is any contradiction between the Maps APIs Terms and other Maps\nAPI(s)-related documents (including the Maps APIs Documentation), then the\nMaps APIs Terms will take precedence.\n\n. Google reserves the right to make changes to the Terms from time to time.\nWhen these changes are made, Google will make a new copy of the Terms\navailable at http://developers.google.com/maps/terms (or such other URL as\nGoogle may provide). You understand and agree that if you use the Service\nafter the date on which the Terms have changed, Google will treat your use as\nacceptance of the updated Terms. If a modification is unacceptable to you, you\nmay terminate this agreement by ceasing use of the Maps API(s).\n\n## 2\\. Accepting the Terms.\n\n. In order to use the Maps API(s), you must agree to the Terms by:\n\n  1. clicking to accept the Terms, where this option is made available to you by Google in the Service’s user interface; or \n  2. using the Maps API(s). You understand and agree that Google will treat your use of the Maps API(s) as acceptance of the Terms from that point onwards. \n\n. You may not use the Maps API(s) and may not accept the Terms if you are a\nperson barred from using the Service under United States law.\n\n. You represent that you have full power, capacity, and authority to accept\nthese Terms. If you are accepting on behalf of your employer or another\nentity, you represent that you have full legal authority to bind your employer\nor such entity to these Terms. If you don't have the legal authority to bind,\nplease ensure that an authorized person from your entity consents to and\naccepts these Terms.\n\n## 3\\. Privacy and Personal Information.\n\n. For information about Google's data protection practices, please read\nGoogle's Privacy Policy. This policy explains how Google treats your personal\ninformation and protects your privacy when you use the Service.\n\n. You agree to the use of your data in accordance with Google's Privacy\nPolicy.\n\n. You must post and abide by an appropriate privacy policy in your Maps API\nImplementation in accordance with Section 9.3 (End User Terms and Privacy\nPolicy).\n\n. You will comply with all applicable laws relating to the collection of\ninformation from visitors to your Maps API Implementation.\n\n. You and Google agree to the  Google Maps Controller-Controller Data\nProtection Terms.\n\n. You must not provide to Google: (a) any personally identifiable information\nor device identifiers; or (b) any European person’s Personal Data (where\n“European” means “European Economic Area or Switzerland” and “Personal Data”\nhas the meaning provided in the General Data Protection Regulation (EU)\n2016/679 of the European Parliament and of the Council of April 27, 2016).\nUsers of your Maps API Implementation may provide information directly to\nGoogle through your Maps API Implementation, as needed.\n\n## 4\\. Provision of the Service by Google.\n\n. Google has subsidiaries and affiliated legal entities around the world (\"\nSubsidiaries and Affiliates \"). Sometimes, these companies will be\nproviding the Service to you on behalf of Google itself. You understand and\nagree that Subsidiaries and Affiliates will be entitled to provide the Service\nto you.\n\n. You understand and agree that Google may limit the number of transactions\nyou may send or receive through the Service; such fixed upper limits may be\nset by Google at any time, at Google’s discretion. For further information,\nsee Section 10.4(b) below.\n\n.\n\n  1. _In places results_. Google reserves the right to include advertising in the places results provided to you through the Maps API(s). By using the Maps API(s) to obtain places results, you agree to display such advertising in the form provided to you by Google. \n  2. _In maps images_. Google also reserves the right to include advertising in the maps images provided to you through the Maps API(s), subject to the following provisions. In this Section, \"Ads Notice\" means a notice from Google that it will include advertising in a particular Maps API. The Ads Notice may be provided on relevant Google websites, including the  Google Geo Developers Blog (or such other URL as Google may provide) and the applicable Google Maps API Groups. \n    1. _New Maps API(s) and major version upgrades of existing Maps API(s) launched with an Ads Notice_. A \"major version\" of a Maps API is denoted by a new \"whole number\" in the version name (for example, a \"major version\" change occurs if API v4.5 is replaced by v5.0). By using the maps images in these new or major version upgrades of the Maps API(s), you agree to display the advertising included in those maps images in the form provided to you by Google. \n    2. _Maps API(s) and major version upgrades of existing Maps API(s) launched without an Ads Notice_. For any Maps API that Google has launched (or launches in the future) without an Ads Notice, Google will not include advertising in that API’s maps images unless Google provides you with an Ads Notice at least 90 days beforehand (the \"Ads Notice Period\"). \n    3. _Maps API Implementations that incorporated the Maps API(s) before April 8, 2011_. If your Maps API Implementation incorporated a major version of a Maps API before April 8, 2011, you have a limited right to opt out of advertising in the maps images provided through that major version of that Maps API by providing written notice to Google during the Ads Notice Period; your notice must state that you refuse to accept advertising in the maps images and must be provided to Google in accordance with Google's notice requirements (as specified in Google's Ads Notice). \n  3. _Opting out of ads_. You may at any time opt out of advertising in the places results and the maps images by either: \n    1. contacting the  Google Maps sales team to obtain a Google enterprise license; or \n    2. terminating your use of the Service. \n  4. _Indexing and caching for ads serving_. By using an API that serves ads, you give Google the right to access, index, and cache the web pages or applications that contain your Maps API Implementation. \n\n. The following is the Service’s \"Deprecation Policy\":\n\n  1. Google will announce if it intends to remove major features from, or discontinue, an API or the Service. \n  2. Google will use commercially reasonable efforts to continue to operate those Google Maps API versions and features identified at  http://developers.google.com/maps/maps-api-list without these changes until one year after the announcement, unless Google determines in its reasonable good faith judgment that: \n    1. it is required by law or third-party relationship (including changes in law or relationships) to make those changes earlier; or \n    2. doing so could create a security risk or substantial economic or material technical burden. \n\n## 5\\. Your Google Account.\n\n. In order to access the Service, you must have and maintain a Google Account\nin good standing. You must ensure that any information you give to Google in\nconnection with your Google Account or the Service will always be accurate,\ncorrect, and up to date.\n\n. You will be solely responsible to Google for your use of the Service. You\nmust notify Google immediately if you become aware of any unauthorized use of\nyour password; your Google Account; or any unique identifier that Google\nrequires you to use, such as an API Key or client ID (a \" Developer\nIdentifier \").\n\n## 6\\. Google’s Proprietary Rights.\n\nYou understand and agree that Google and its licensors and their suppliers (as\napplicable) own all legal right, title, and interest in and to the Service and\nContent, including any intellectual property rights in the Service and Content\n(whether those rights are registered or not, and wherever in the world those\nrights may exist).\n\n## 7\\. Permitted Uses.\n\nYou will use the Service only for purposes that:\n\n  1. are permitted by the Terms (including the Licenses in Section 8); \n  2. are permitted by any applicable law or third-party contract in the relevant jurisdictions; and \n  3. comply with all applicable policies or guidelines made available by Google, including in the Maps APIs Documentation and the  Permission Guidelines for Google Maps and Google Earth. \n\n## 8\\. Licenses from Google to You.\n\n.\n\n  1. \" Brand Features \" means trade names, trademarks, logos, domain names, and other distinctive brand features. \n  2. \" Content \" means any content provided through the Service (whether created by Google or its third-party licensors), including map and terrain data, imagery, traffic data, and places data (including business listings). \n  3. \" Maps API Implementation \" means a software application, website, or other implementation that uses the Maps API(s) to obtain and display Content in conjunction with Your Content. \n  4. \" Your Content \" means any content that you provide in your Maps API Implementation, including data, images, video, or software. Your Content does not include the Content as defined in Subsection (b). \n\n. Subject to these Terms (including Section 9 (License Requirements) and\nSection 10 (License Restrictions)), during the term of this agreement, Google\ngives you a non-exclusive, worldwide, personal, non-transferable, non-\nassignable, non-sublicensable, royalty-free license to use the Service as\nprovided by Google, in the manner permitted by the Terms.\n\n. Subject to these Terms (including Sections 8.3(a) and (b), Section 9\n(License Requirements), and Section 10 (License Restrictions)), during the\nterm of this agreement, Google gives you a non-exclusive, worldwide, personal,\nnon-transferable,non-assignable, non-sublicensable, royalty-free license to\nuse the Content in your Maps API Implementation, as the Content is provided in\nthe Service, and in the manner permitted by the Terms.\n\n  1. Content (including map data, traffic, directions, and places) is provided for planning purposes only. You may find that weather conditions, construction projects, closures,or other events may cause road conditions or directions to differ from the results depicted in the Content. You should exercise judgment in your use of the Content. \n  2. Certain Content is provided under  license from third parties, and is subject to copyright and other intellectual property rights owned by or licensed to such third parties. You may be held liable for any unauthorized use of this content. Your use of third-party Content (including certain business listings Content) is subject to additional restrictions located in the  Legal Notices page. \n\n.\n\n  1. _Grant_. Subject to these Terms (including Section 8.4(b), Section 9 (License Requirements), and Section 10 (License Restrictions)), during the term of this agreement, Google gives you a non-exclusive, worldwide, personal, non-transferable, non-assignable, non-sublicensable, royalty-free license to display Google’s Brand Features solely for the purposes of (i) promoting or advertising your authorized use of the Service in accordance with this Section and (ii) fulfilling your obligations under the Terms. \n  2. _Restrictions_. In using Google Brand Features, you will not: \n    1. display a Google Brand Feature in any manner that implies a relationship or affiliation with, sponsorship, or endorsement by Google (other than your use of the Service), or that can be reasonably interpreted to suggest editorial content has been authored by, or represents the views or opinions of, Google or its personnel; \n    2. display a Google Brand Feature in your Maps API Implementation, site, or other propert(ies) if any of them contain or display adult content or promote illegal activities, gambling, or the sale of tobacco or alcohol to persons under 21 years of age; \n    3. have the Google logo as the largest logo in your Maps API Implementation, site, or other propert(ies) (except as displayed in the map image itself); \n    4. display a Google Brand Feature as the most prominent element in your Maps API Implementation, on any page of your site, or on any of your other propert(ies); \n    5. display a Google Brand Feature in a manner that is misleading, defamatory, infringing, libelous, disparaging, obscene, or otherwise objectionable to Google; \n    6. use Google Brand Features to disparage Google or the Google Services; \n    7. display a Google Brand Feature in your Maps API Implementation, site, or other propert(ies) that violate any law or regulation; or \n    8. remove, distort, or alter any element of a Google Brand Feature (including squeezing, stretching, inverting, or discoloring). \n  3. _No further license grant; no challenges_. Except as stated in this Section, nothing in the Terms grants or will be deemed to grant you any right, title, or interest in Google’s Brand Features. Your use of Google’s Brand Features (including any goodwill associated with them) will inure to Google’s benefit. During and after the Term, and to the maximum extent permitted by applicable law, you will not challenge or assist others to challenge Google’s Brand Features (or their registration by Google), and you will not attempt to register any Brand Features (including domain names) that are confusingly similar to Google’s in any way (including in sound, appearance, or spelling). \n\n. You will not remove, obscure, or alter any proprietary rights notices\n(including copyright and trademark notices, Terms of Use links, or Brand\nFeatures) displayed or provided through the Service. Where such notices are\nnot displayed or provided within the Service, you must display such notices\naccording to the Maps APIs Documentation.\n\n. If the Service or Content is being used or accessed by or on behalf of the\nUnited States government, such use is subject to additional terms located in\nour  Legal Notices page’s \"Government End Users\" section.\n\n. Google reserves the sole right and discretion to determine whether your use\nof the Service, Content, and Brand Features complies with these Terms.\n\n## 9\\. License Requirements.\n\nGoogle’s licenses above are subject to your compliance with the following\nrequirements:\n\n.\n\n9.1.1 General Rules.\n\n  1. _Free access (no fees)_. Subject to Section 9.1.2 (Exceptions), your Maps API Implementation must be accessible to the general public without charge and must not require a fee-based subscription or other fee-based restricted access. This rule applies to Your Content and any other content in your Maps API Implementation, whether Your Content or the other content exists now or is added later. \n  2. _Public access (no firewall)_. Your Maps API Implementation must not operate (i) only behind a firewall; or (ii) only on an internal network (except during the development and testing phase); or (iii) in a closed community (for example, through invitation-only access). \n\n9.1.2 Exceptions.\n\n  1. _Enterprise agreement with Google_. The rules in Section 9.1.1 (Free access, Public access) do not apply if you have entered into a separate written agreement with Google (such as a  Google Maps agreement) or obtained Google's written permission. \n  2. _Mobile applications_. \n    1. The rule in Section 9.1.1(a) (Free access) does not apply if your Maps API Implementation is used in a mobile application that is sold for a fee through an online store and is downloadable to a mobile device that can access the online store. \n    2. The rule in Section 9.1.1(b) (Public access) does not apply if your Maps API Implementation is an Android application that uses the Google Maps Android API. (However, the rule in Section 9.1.1(b) (Public access) will continue to apply if your Maps API Implementation is an Android application that uses any other Maps APIs, unless the Maps API Implementation qualifies for the exception in Section 9.1.2(a) (Enterprise agreement with Google).) \n\n9.1.3 Examples.\n\n  1. You can require users to log in to your Maps API Implementation if you do not require users to pay a fee. \n  2. You can charge a fee for your Maps API Implementation if it is an Android application downloadable to mobile devices from the Google Play Store. \n  3. If you are a consultant who creates or hosts Maps API Implementations for third-party customers, you may charge those customers a fee for your consulting or hosting services (but not for the Maps API Implementations themselves, except as permitted under Section 9.1.2 (Exceptions)). \n\n. You must implement those reporting mechanisms that Google requires (as\nupdated from time to time in these Terms and in the Maps APIs Documentation).\n\n. If you develop a Maps API Implementation for use by other users, you must:\n\n  1. display to the users of your Maps API Implementation the link to Google’s Terms of Service as presented through the Service or described in the Maps APIs Documentation; \n  2. explicitly state in your Maps API Implementation’s terms of use that, by using your Maps API Implementation, your users are agreeing to be bound by Google’s Terms of Service; and \n  3. protect the privacy and legal rights of those users. \n    1. _Your privacy policy_. You must make publicly available, and must abide by, an appropriate privacy policy in your Maps API Implementation. In particular, if your Maps API Implementation enables you or any party to gain access to information about users of the Maps API(s), including personally identifiable information (such as user names) or non-personally identifiable usage information (such as location), your privacy policy must describe your use and retention of this information. \n      1. _Geolocation privacy_\n        1. Your Maps API Implementation must notify the user in advance of the type(s) of data that you intend to collect from the user or the user’s device. Your Maps API Implementation must not obtain or cache any user’s location in any manner except with the user's prior consent. Your Maps API Implementation must let the user revoke the user's consent at any time. \n        2. If your Maps API Implementation provides Google with geolocation data, that geolocation data must not enable Google to identify an individual user. For example, if your Maps API Implementation sends Google Your Content, and Your Content includes geolocation data, Your Content must not also include unique device identifiers associated with individual users. \n        3. If you intend to obtain the user’s location and use it with any other data provider's data, you must disclose this fact to the user. \n      2. _Google’s Privacy Policy_. Your privacy policy must notify users that you are using the Maps API(s) and incorporate by reference Google’s Privacy Policy by including a link to Google’s then-current Privacy Policy (at  http://www.google.com/policies/privacy or such other URL as Google may provide). \n      3. _Cookies_. As noted in the Documentation, certain Maps API(s) store and access cookies and other information on end users’ devices. If you use any of these cookie-enabled Maps API(s) in your Maps API Implementation, then for end users in the European Union, you must comply with the  EU User Consent Policy. \n\n.\n\n  1. Content provided to you through the Service may contain the Brand Features of Google, its strategic partners, or other third-party rights holders of content that Google indexes. When Google provides those Brand Features or other attribution through the Service, you must display such attribution as provided (or as described in the Maps APIs Documentation) and must not delete or alter the attribution. \n  2. You must conspicuously display the \"powered by Google\" attribution (and any other attribution(s) required by Google in the  Maps APIs Documentation) on or adjacent to the relevant Service search box and Google search results. If you use the standard Google search control, or the standard Google search control form, this attribution will be included automatically, and you must not modify or obscure this automatically-generated attribution. \n  3. You understand and agree that Google has the sole right and discretion to determine whether your attribution(s) are in compliance with the above requirements. \n\n. You will use all reasonable efforts to prevent unauthorized use of the\nService and to terminate any such unauthorized use.\n\n. You are solely responsible for (and Google has no responsibility to you or\nany third party for) any breach of your obligations under the Terms and for\nthe consequences of any such breach (including any loss or damage that Google\nmay suffer).\n\n## 10\\. License Restrictions.\n\nExcept as expressly permitted under the Terms, or unless you have received\nprior written authorization from Google (or, as applicable, from the\nparticular Content provider), Google’s licenses above are conditioned on your\nadherence to all of the restrictions below. In this Section 10, the phrase\n\"you will not\" means \"when using the Service, you will not, and will not\npermit a third party to.\"\n\n.\n\n  1. _No access to APIs or Content except through the Service_. You will not access the Maps API(s) or the Content except through the Service. For example, you must not access map tiles or imagery through interfaces or channels (including undocumented Google interfaces) other than the Maps API(s). \n  2. _No access to Service without applicable Developer Identifier(s)_. For certain versions or features of the Maps API(s), Google may require you to use a Developer Identifier to access and administer the Service. If a Developer Identifier is required under the Maps APIs Documentation, you will not access the Service without the Developer Identifier. \n  3. _No hiding identity_. You will not hide from Google the identity of your Maps API Implementation. You must follow the identification conventions in the Maps APIs Documentation. \n\n. The following restrictions apply generally to all Google Services, including\nthe Google application programming interfaces at\nhttps://developers.google.com/products/ (or such other URL as Google may\nprovide) (the “ Google API(s) ”). You will not:\n\n  1. Sublicense a Google API for use by a third party. Consequently, you will not create an API client that functions substantially the same as the Google APIs and offer it for use by third parties. \n  2. Perform an action with the intent of introducing to Google Services any viruses, worms, defects, Trojan horses, malware, or any items of a destructive nature. \n  3. Defame, abuse, harass, stalk, or threaten others. \n  4. Interfere with or disrupt the Google APIs or the servers or networks providing the Google APIs. \n  5. Promote or facilitate unlawful online gambling or disruptive commercial messages or advertisements. \n  6. Reverse engineer or attempt to extract the source code from any Google API or any related software, except to the extent that this restriction is expressly prohibited by applicable law. \n  7. Use the Google APIs for any activities where the use or failure of the Google APIs could lead to death, personal injury, or environmental damage (such as the operation of nuclear facilities, air traffic control, or life support systems). \n  8. Use the Google APIs to process or store any data that is subject to the International Traffic in Arms Regulations maintained by the U.S. Department of State. \n  9. Remove, obscure, or alter any Google terms of service, or any links to or notices of those terms. \n\n.\n\n  1. _No violation of Google’s Software Principles_. You will not violate Google’s Software Principles at  http://www.google.com/intl/en/about/company/software-principles.html (or such other URLs that Google may designate). \n  2. _No modification of search results_. You will not modify, reorder, augment, or manipulate search results in any way unless you explicitly notify the end user of your actions. \n\n.\n\n  1. _No use except under these Terms_. You will not use the Service or Content except as expressly permitted under these Terms. For example: \n    1. _No fees_. You will not charge any third party a fee to use your Maps API Implementation, the Service, or the Content, unless you have purchased an applicable Google Maps APIs Premium Plan or Google Maps APIs for Work license that expressly permits this use. \n    2. _No printing 5,000+ copies for direct marketing_. You will not print more than 5,000 copies of sales collateral materials containing a screenshot of the Content for purposes of commercial sales lead generation. \n    3. _No use as a core part of printed matter_. You will not incorporate the Content as a core part of printed matter (such as a printed map or guide book) that is redistributed for a fee. \n  2. _No use beyond transaction limits and usage policies_. If your Maps API Implementation generates a high volume of transactions, Google reserves the right to set transaction limits, as described in the Maps APIs Documentation here. Google also reserves the right to set other usage policies in the Documentation from time to time. If you want to engage in use outside these transaction limits or usage policies, you can purchase more usage capacity through the Maps API Standard pricing plan, or you can contact the  Google Maps sales team for licensing options to address your needs. Google may decline your request, or condition acceptance on your agreement to additional terms and/or charges for that use. \n  3. _Restrictions on your Maps API Implementations_. \n    1. _No creation of a substitute service_. You will not use the Service to create a Maps API Implementation that is a substitute for, or substantially similar service to, Google Maps (at  https://www.google.com/maps (or such other URL as Google may provide)) (\" Google Maps \") or the Service. \n    2. _No creation or augmentation of data sets based on Google’s Content or Services_. You will not use Google’s Content or Services to create or augment your own mapping-related dataset (or that of a third party), including a mapping or navigation dataset, business listings database, mailing list, or telemarketing list. \n    3. _No navigation_. You will not use the Service or Content for or in connection with (a) real-time navigation or route guidance; or (b) automatic or autonomous vehicle control. \n    4. _No asset-tracking unless you have purchased the applicable enterprise license_. Unless you have purchased an applicable Premium Plan or Maps APIs for Work license that expressly permits you to do so, you will not use the Service or Content for commercial asset-tracking or in Maps API Implementations whose primary purpose is to assess vehicle insurance risks. \n      1. Commercial asset-tracking includes dispatch, fleet management, and Maps API Implementations that track your (or your end users’) assets (for example, private or commercial transportation applications, including taxi and vehicle-for-hire applications). \n      2. Non-commercial asset-tracking implementations include applications used for a non-commercial purpose (for example, a free, publicly accessible Maps API Implementation that displays real-time public transit or other transportation status information or that allows end users to share real-time location with others). \n    5. _No use of Content in a listings service_. You will not use business listings-related Content in any Customer Implementation that has the primary purpose of making available business, residential address, or telephone directory listings. \n    6. _No use of Content for an Ads product_. You will not use business listings-related Content to create or augment an advertising product. \n  4. _No use of Content without a Google map_. Unless the Maps APIs Documentation expressly permits you to do so, you will not use the Content in a Maps API Implementation without a corresponding Google map. For example, you may display Street View imagery without a corresponding Google map because the Maps APIs Documentation expressly permits this use. \n  5. _No use of Content with a non-Google map_. You must not use the Content in a Maps API Implementation that contains a non-Google map. \n\n.\n\n  1. _No distribution or sale except as permitted under the Terms_. You will not distribute, sell, or otherwise make any part of the Service available to third parties except as permitted by these Terms. \n  2. _No derivative works_. You will not modify or create a derivative work based on any Content unless expressly permitted to do so under these Terms. For example, the following are prohibited: (i) creating server-side modification of map tiles; (ii) stitching multiple static map images together to display a map that is larger than permitted in the Maps APIs Documentation; or (iii) tracing or copying the copyrightable elements of Google’s maps or building outlines and creating a new work, such as a new mapping or navigation dataset. \n  3. _No use of Content outside the Service_. You will not use any Content outside of the Service except as expressly permitted to do so in Subsection (d). For example, you will not export or save the Content to a third party’s platform or service. \n  4. _No caching or storage_. You will not pre-fetch, cache, index, or store any Content to be used outside the Service, except that you may store limited amounts of Content solely for the purpose of improving the performance of your Maps API Implementation due to network latency (and not for the purpose of preventing Google from accurately tracking usage), and only if such storage: \n    1. is temporary (and in no event more than 30 calendar days); \n    2. is secure; \n    3. does not manipulate or aggregate any part of the Content or Service; and \n    4. does not modify attribution in any way. \n  5. _No mass downloading_. You will not use the Service in a manner that gives you or a third party access to mass downloads or bulk feeds of any Content. For example, you are not permitted to offer a batch geocoding service that uses Content contained in the Maps API(s). \n  6. _No incorporating Google software into other software_. You will not incorporate any software provided as part of the Service into other software. \n  7. _No removing, obscuring, or altering terms of service, links, or proprietary rights notices_. You will not: \n    1. remove, obscure, or alter any Google terms of service or any links to or notices of those terms, or any copyright, trademark, or other proprietary rights notices; or \n    2. falsify or delete any author attributions, legal notices, or other labels of the origin or source of material. \n\n. We want to make sure that the Services remain online and available for all\nusers. To help ensure this, during the agreement term, you will not try to\nshut down the Services that you have been using by seeking an injunction or\nexclusion order.\n\n## 11\\. Licenses from You to Google.\n\n. Google claims no ownership over Your Content, and you retain copyright and\nany other rights you already hold in Your Content. By submitting or displaying\nYour Content through the Service, you give Google a perpetual, irrevocable,\nnon-exclusive, worldwide, sublicensable, royalty-free license to use Your\nContent solely for the following purposes:\n\n  1. enabling Google to provide you with the Service; \n  2. if you opt to do so through your Maps API Implementation’s features, allowing end users to use Your Content in Google Services; and \n  3. if you opt to submit Your Content through the Google Places API(s), allowing Google to use that content in Google Services. \n\n. During the term of this agreement, you give Google a non-exclusive,\nworldwide, sublicensable, royalty-free license to use Your Brand Features and\nYour Content to publicize or advertise that you are using the Service (for\nexample, by using your marks in presentations, marketing materials, customer\nlists, financial reports, and website listings (including links to your\nwebsite), or by creating marketing or advertising materials that show\nscreenshots of the Service in which Your Content is featured).\n\n. You represent and warrant that you have all the rights, power, and authority\nnecessary to grant the above licenses.\n\n## 12\\. Maps API Standard Pricing Plan and Payment Terms.\n\nThis Section 12 applies if you purchase usage capacity (beyond the Service’s\ntransaction limits) through the Maps API Standard pricing plan:\n\n. Certain parts of the Service are provided to you without charge up to the\ntransaction limits described in the Maps APIs Documentation here.\n\n. Google will issue an electronic bill to you for all charges accrued above\nthe transaction limits based on your use of the Service during the previous\nmonth. You will pay all fees specified in the invoice, including the invoice’s\nspecified currency and payment terms. Google’s measurement of your use of the\nService is final.\n\n. In association with your purchase of Maps API usage, you are responsible for\nall applicable government-imposed taxes, except for taxes based on Google’s\nnet income, net worth, employment, and assets (including personal and real\nproperty) (\" Taxes \"), and you will pay Google for the Service without any\nreduction for Taxes. If Google is obligated to collect or pay Taxes, the Taxes\nwill be invoiced to you, unless you provide Google with a timely and valid tax\nexemption certificate authorized by the appropriate taxing authority. In some\nstates the sales tax is due on the total purchase price at the time of sale\nand must be invoiced and collected at the time of the sale.\n\n. To the fullest extent permitted by law, you waive all claims relating to\nfees unless claimed within sixty days after charged (this does not affect any\nof your rights with your credit card issuer). Refunds (if any) are at Google’s\ndiscretion and will only be in the form of credit for the Service. Nothing in\nthese Terms obligates Google to extend credit to any party.\n\n. Late payments may bear interest at the rate of 1.5% per month (or the\nhighest rate permitted by law, if less). Google reserves the right to suspend\nyour access to the Service for any late payments.\n\n## 13\\. Terminating this Agreement.\n\nThe Terms will continue to apply until terminated by either you or Google as\ndescribed below.\n\nYou may terminate your legal agreement with Google by removing the Maps API(s)\ncode from your Maps API Implementation and discontinuing your use of the\nService at any time. You do not need to specifically inform Google when you\nstop using the Service.\n\nGoogle reserves the right to terminate these Terms or discontinue the Service,\nor any portion or feature of the Service, for any reason and at any time\nwithout liability or other obligation to you, except as described under\nSection 4.4 (Changes to the Service; Deprecation Policy).\n\nNothing in this Section 13 will affect Google’s rights under Section 4\n(Provision of Service by Google).\n\nWhen this legal agreement comes to an end, those Terms that by their nature\nare intended to continue indefinitely will continue to apply, including\nSections 3.5 (European Data Protection Terms); 6 (Google’s Proprietary\nRights); 11.1 (Content License); 13.4 and 13.5 (Terminating this Agreement);\n14 (Exclusion of Warranties); 15 (Limitations of Liability); 16 (Indemnities);\nand 19 (General Legal Terms).\n\n## 14\\. EXCLUSION OF WARRANTIES.\n\nNOTHING IN THESE TERMS, INCLUDING SECTIONS 14 AND 15, WILL EXCLUDE OR LIMIT\nGOOGLE’S WARRANTY OR LIABILITY FOR LOSSES THAT MAY NOT BE LAWFULLY EXCLUDED OR\nLIMITED BY APPLICABLE LAW. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF\nCERTAIN WARRANTIES OR CONDITIONS OR THE LIMITATION OR EXCLUSION OF LIABILITY\nFOR CERTAIN TYPES OF LOSS OR DAMAGES. ACCORDINGLY, ONLY THE LIMITATIONS THAT\nARE LAWFUL IN YOUR JURISDICTION WILL APPLY TO YOU, AND GOOGLE’S LIABILITY WILL\nBE LIMITED TO THE MAXIMUM EXTENT PERMITTED BY LAW.\n\nYOU EXPRESSLY UNDERSTAND AND AGREE THAT YOUR USE OF THE SERVICE AND THE\nCONTENT IS AT YOUR SOLE RISK AND THAT THE SERVICE AND THE CONTENT ARE PROVIDED\n\"AS IS\" AND \"AS AVAILABLE.\" IN PARTICULAR, GOOGLE, ITS SUBSIDIARIES AND\nAFFILIATES, AND ITS LICENSORS AND THEIR SUPPLIERS, DO NOT REPRESENT OR WARRANT\nTO YOU THAT:\n\n  1. THE SERVICE WILL MEET YOUR REQUIREMENTS; \n  2. THE SERVICE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; \n  3. THE SERVICE WILL BE ACCURATE OR RELIABLE; AND \n  4. DEFECTS IN THE OPERATION OR FUNCTIONALITY OF ANY SOFTWARE PROVIDED TO YOU AS PART OF THE SERVICE WILL BE CORRECTED. \n\nANY CONTENT OBTAINED THROUGH THE GOOGLE SERVICES IS AT YOUR OWN DISCRETION AND\nRISK AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM\nOR OTHER DEVICE, LOSS OF DATA, OR ANY OTHER DAMAGE OR INJURY THAT RESULTS FROM\nDOWNLOADING OR USING ANY SUCH CONTENT.\n\nNO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM\nGOOGLE, OR THROUGH OR FROM THE SERVICE OR CONTENT, WILL CREATE ANY WARRANTY\nNOT EXPRESSLY STATED IN THE TERMS.\n\nGOOGLE, ITS LICENSORS, AND THEIR SUPPLIERS FURTHER EXPRESSLY DISCLAIM ALL\nWARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING\nTHE IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, AND NON-INFRINGEMENT.\n\n## 15\\. LIMITATIONS OF LIABILITY.\n\nSUBJECT TO SECTION 14.1, YOU EXPRESSLY UNDERSTAND AND AGREE THAT, TO THE\nMAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, GOOGLE, ITS SUBSIDIARIES, AND\nAFFILIATES, AND GOOGLE'S LICENSORS AND THEIR SUPPLIERS, WILL NOT BE LIABLE TO\nYOU FOR:\n\n  1. ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES THAT MAY BE INCURRED BY YOU, HOWEVER CAUSED AND UNDER ANY THEORY OF LIABILITY (INCLUDING CONTRACT, TORT, COMMON LAW, OR STATUTORY DAMAGES); ANY LOSS OF REVENUES OR PROFIT (WHETHER INCURRED DIRECTLY OR INDIRECTLY); ANY LOSS OF GOODWILL OR BUSINESS REPUTATION; ANY LOSS OF DATA; ANY COST TO PROCURE SUBSTITUTE GOODS OR SERVICES; OR ANY INTANGIBLE LOSS; OR \n  2. ANY LOSS OR DAMAGE AS A RESULT OF: \n    1. ANY RELIANCE PLACED BY YOU ON THE COMPLETENESS, ACCURACY, OR EXISTENCE OF ANY ADVERTISING, OR AS A RESULT OF ANY RELATIONSHIP OR TRANSACTION BETWEEN YOU AND ANY ADVERTISER OR SPONSOR WHOSE ADVERTISING APPEARS ON GOOGLE SERVICES; \n    2. ANY CHANGES THAT GOOGLE MAY MAKE TO THE SERVICE, OR ANY PERMANENT OR TEMPORARY DISCONTINUATION OF THE SERVICE (OR ANY FEATURES WITHIN THE SERVICE); \n    3. THE DELETION OR CORRUPTION OF, OR FAILURE TO STORE, ANY CONTENT AND OTHER DATA MAINTAINED OR TRANSMITTED BY OR THROUGH YOUR USE OF THE SERVICE; \n    4. YOUR FAILURE TO PROVIDE GOOGLE WITH ACCURATE ACCOUNT INFORMATION; OR \n    5. YOUR FAILURE TO KEEP YOUR PASSWORD OR ACCOUNT DETAILS SECURE AND CONFIDENTIAL. \n\nTHE LIMITATIONS ON GOOGLE’S LIABILITY IN SECTION 15.1 ABOVE WILL APPLY WHETHER\nOR NOT GOOGLE, ITS SUBSIDIARIES, AFFILIATES, LICENSORS OR THEIR SUPPLIERS HAVE\nBEEN ADVISED OF OR SHOULD HAVE BEEN AWARE OF THE POSSIBILITY OF ANY SUCH\nLOSSES OR DAMAGES.\n\n## 16\\. Indemnities.\n\nYou will defend and indemnify Google and its affiliates, directors, officers,\nemployees, strategic partners, licensors, and their suppliers (the \"\nIndemnified Parties \") against all liabilities, damages, losses, costs,\nfees (including legal fees), and expenses relating to any allegation or third-\nparty legal proceeding to the extent arising from:\n\n  1. your use of the Service or the Content in breach of the Terms or applicable policies; \n  2. your Maps API Implementation, including any claim that your Maps API Implementation infringes a third party’s rights or violates applicable law; or \n  3. Your Content. \n\nYou will cooperate as fully as reasonably required in the defense of any\nallegation or third-party legal proceeding. Google reserves the right, at its\nown expense, to assume the exclusive control and defense of any indemnified\nmatter under this Section 16.\n\n## 17\\. Copyright Policies; Content Removal; Termination of Repeat Offenders’\nAccounts.\n\nIt is Google’s policy to respond to notices of alleged copyright infringement\nthat comply with applicable international intellectual property law\n(including, in the United States, the Digital Millennium Copyright Act) and to\nterminate the accounts of repeat offenders. Details of Google’s policy can be\nfound here.\n\n## 18\\. Other Content.\n\nThe Service may include hyperlinks to other websites or content or resources.\nGoogle has no control over any websites or resources that are provided by\ncompanies or persons other than Google. You understand and agree that Google\nis not responsible for the availability of any such external sites or\nresources, and does not endorse any advertising, products, or other materials\non, or available from, such websites or resources.\n\nYou understand and agree that Google is not liable for any loss or damage that\nyou may incur as a result of the availability of those external sites or\nresources, or as a result of any reliance by you on the completeness,\naccuracy, or existence of any advertising, products, or other materials on, or\navailable from, such websites or resources.\n\n## 19\\. General Legal Terms.\n\n. Google may provide you with notices, including those regarding changes to\nthe Terms, by email, regular mail, or postings on the Service.\n\n. Google may assign any part of this agreement without written consent.\n\n. Google will not be treated as having waived any rights by not exercising (or\ndelaying the exercise of) any rights under these Terms. A waiver will be\neffective only if Google expressly states in a writing signed by an authorized\nrepresentative that Google is waiving a specified Term.\n\n. Google’s affiliates and the Indemnified Parties are third-party\nbeneficiaries to the Terms and are entitled to directly enforce, and rely on,\nany Terms that confer a right or benefit to them. There are no other third-\nparty beneficiaries to the Terms.\n\n. These Terms set out all terms agreed between the parties and supersede all\nother agreements between the parties relating to its subject matter.\n\n. If any term (or part of a term) of these Terms is invalid, illegal or\nunenforceable, the rest of the Terms will remain in effect.\n\n. You understand and agree that damages for improper use of the Maps API(s)\nmay be irreparable; therefore, Google is entitled to seek equitable relief,\nincluding injunctions in any jurisdiction, in addition to all other remedies\nit may have.\n\n. If these Terms are translated into any other language, and there is a\ndiscrepancy between the English text and the translated text, the English text\nwill govern.\n\n. ALL CLAIMS ARISING OUT OF OR RELATING TO THESE TERMS OR ANY RELATED GOOGLE\nSERVICES WILL BE GOVERNED BY CALIFORNIA LAW, EXCLUDING CALIFORNIA'S CONFLICT\nOF LAWS RULES, AND WILL BE LITIGATED EXCLUSIVELY IN THE FEDERAL OR STATE\nCOURTS OF SANTA CLARA COUNTY, CALIFORNIA, USA; THE PARTIES CONSENT TO PERSONAL\nJURISDICTION IN THOSE COURTS.\n\nExcept as otherwise noted, the content of this page is licensed under the\nCreative Commons Attribution 3.0 License, and code samples are licensed under\nthe Apache 2.0 License. For details, see our Site Policies. Java is a\nregistered trademark of Oracle and/or its affiliates.\n\n  * ![](https://developers.google.com/site-assets/logo-stack-overflow.svg) Stack Overflow \n\nAsk a question under the google-maps tag.\n\n  * ![](https://developers.google.com/site-assets/logo-github.svg) GitHub \n\nFork our samples and try them yourself.\n\n  * ![](https://developers.google.com/site-assets/blogger_64dp.png) Blog \n\nRead about the latest updates, customer stories, and tips.\n\n  * ![](https://developers.google.com/site-assets/developers_64dp.png) Issue tracker \n\nSomething wrong? Send us a bug report!\n\n  * ### Learn More\n\n    * Tutorials \n    * Pricing and Plans \n    * API Picker \n    * Maps APIs Overview \n  * ### Platforms\n\n    * Android \n    * iOS \n    * Web \n    * Web Services \n  * ### Product Info\n\n    * Contact sales \n    * Community support \n    * Paid support \n    * Terms of Service \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n### Send feedback about...\n\nThis page\n\nDocumentation feedback\n\n![Google Maps\nAPIs](https://www.gstatic.com/images/branding/product/1x/maps_64dp.png)\n\nGoogle Maps APIs\n\nProduct feedback\n\n"}
{"_id":{"$oid":"5b4e64881c746747a0c035e2"},"date_created":"2018-04-03","date_reviewed":"2018-07-17","url":"https://developers.google.com/terms/","statements":[{"text":"You will only access (or attempt to access) an API by the means described in the documentation of that API. If Google assigns you developer credentials (e.g. client IDs), you must use them with the applicable APIs. You will not misrepresent or mask either your identity or your API Client's identity when using the APIs or developer accounts.","tag":["technical requirements"],"comment":"needs review"},{"text":"You will require your end users to comply with (and not knowingly enable them to violate) applicable law, regulation, and the Terms.","tag":["general requirements"],"comment":"needs review"},{"text":"Google sets and enforces limits on your use of the APIs (e.g. limiting the number of API requests that you may make or the number of users you may serve), in our sole discretion. You agree to, and will not attempt to circumvent, such limitations documented with each API. If you would like to use any API beyond these limits, you must obtain Google's express consent (and Google may decline such request or condition acceptance on your agreement to additional terms and/or charges for that use). To seek such approval, contact the relevant Google API team for information (e.g. by using the Google developers console).","tag":["usage limits","payment"],"comment":"needs review"},{"text":"The APIs are designed to help you enhance your websites and applications (\"API Client(s)\"). YOU AGREE THAT GOOGLE MAY MONITOR USE OF THE APIS TO ENSURE QUALITY, IMPROVE GOOGLE PRODUCTS AND SERVICES, AND VERIFY YOUR COMPLIANCE WITH THE TERMS. This monitoring may include Google accessing and using your API Client, for example to identify security issues that could affect Google or its users. You will not interfere with this monitoring. Google may use any technical means to overcome such interference. Google may suspend access to the APIs by you or your API Client without notice if we reasonably believe that you are in violation of the Terms.","tag":["monitor/audit"],"comment":"needs review"},{"text":"Google does not acquire ownership in your API Clients, and by using our APIs, you do not acquire ownership of any rights in our APIs or the content that is accessed through our APIs.","tag":["ownership"],"comment":"needs review"},{"text":"Consequently, you will not create an API Client that functions substantially the same as the APIs and offer it for use by third parties","tag":["technical requirements"],"comment":"needs review"},{"text":"Developer credentials (such as passwords, keys, and client IDs) are intended to be used by you and identify your API Client. You will keep your credentials confidential and make reasonable efforts to prevent and discourage other API Clients from using your credentials. Developer credentials may not be embedded in open source projects.","tag":["general requirements"],"comment":"needs review"},{"text":"Our APIs contain some third party content (such as text, images, videos, audio, or software). This content is the sole responsibility of the person that makes it available. We may sometimes review content to determine whether it is illegal or violates our policies or the Terms, and we may remove or refuse to display content. Finally, content accessible through our APIs may be subject to intellectual property rights, and, if so, you may not use it unless you are licensed to do so by the owner of that content or are otherwise permitted by law. Your access to the content provided by the API may be restricted, limited, or filtered in accordance with applicable law, regulation, and policy.","tag":["as-is and as-available"],"comment":"needs review"}],"risk_assessment":"Kai's RA\n","dom":"![Google\nDevelopers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14\n/lockup-color.png)\n\nAll Products\n\nSign in\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n  * Google APIs Terms of Service\n  * Site Terms of Service\n  * Site Policies\n\n#  Google APIs Terms of Service\n\nLast modified: December 5, 2014 (view archived version)\n\nThank you for using Google's APIs, other developer services, and associated\nsoftware (collectively, \"APIs\"). By accessing or using our APIs, you are\nagreeing to the terms below. If there is a conflict between these terms and\nadditional terms applicable to a given API, the additional terms will control\nfor that conflict. Collectively, we refer to the terms below, any additional\nterms, terms within the accompanying API documentation, and any applicable\npolicies and guidelines as the \"Terms.\" You agree to comply with the Terms and\nthat the Terms control your relationship with us. So please read all the Terms\ncarefully. If you use the APIs as an interface to, or in conjunction with\nother Google products or services, then the terms for those other products or\nservices also apply.\n\nUnder the Terms, \"Google\" means Google Inc., with offices at 1600 Amphitheatre\nParkway, Mountain View, California 94043, United States, unless set forth\notherwise in additional terms applicable for a given API. We may refer to\n\"Google\" as \"we\", \"our\", or \"us\" in the Terms.\n\n## Section 1: Account and Registration\n\n### a. Accepting the Terms\n\nYou may not use the APIs and may not accept the Terms if (a) you are not of\nlegal age to form a binding contract with Google, or (b) you are a person\nbarred from using or receiving the APIs under the applicable laws of the\nUnited States or other countries including the country in which you are\nresident or from which you use the APIs.\n\n### b. Entity Level Acceptance\n\nIf you are using the APIs on behalf of an entity, you represent and warrant\nthat you have authority to bind that entity to the Terms and by accepting the\nTerms, you are doing so on behalf of that entity (and all references to \"you\"\nin the Terms refer to that entity).\n\n### c. Registration\n\nIn order to access certain APIs you may be required to provide certain\ninformation (such as identification or contact details) as part of the\nregistration process for the APIs, or as part of your continued use of the\nAPIs. Any registration information you give to Google will always be accurate\nand up to date and you'll inform us promptly of any updates.\n\n### d. Subsidiaries and Affiliates\n\nGoogle has subsidiaries and affiliated legal entities around the world. These\ncompanies may provide the APIs to you on behalf of Google and the Terms will\nalso govern your relationship with these companies.\n\n## Section 2: Using Our APIs\n\n### a. Your End Users\n\nYou will require your end users to comply with (and not knowingly enable them\nto violate) applicable law, regulation, and the Terms.\n\n### b. Compliance with Law, Third Party Rights, and Other Google Terms of\nService\n\nYou will comply with all applicable law, regulation, and third party rights\n(including without limitation laws regarding the import or export of data or\nsoftware, privacy, and local laws). You will not use the APIs to encourage or\npromote illegal activity or violation of third party rights. You will not\nviolate any other terms of service with Google (or its affiliates).\n\n### c. Permitted Access\n\nYou will only access (or attempt to access) an API by the means described in\nthe documentation of that API. If Google assigns you developer credentials\n(e.g. client IDs), you must use them with the applicable APIs. You will not\nmisrepresent or mask either your identity or your API Client's identity when\nusing the APIs or developer accounts.\n\n### d. API Limitations\n\nGoogle sets and enforces limits on your use of the APIs (e.g. limiting the\nnumber of API requests that you may make or the number of users you may\nserve), in our sole discretion. You agree to, and will not attempt to\ncircumvent, such limitations documented with each API. If you would like to\nuse any API beyond these limits, you must obtain Google's express consent (and\nGoogle may decline such request or condition acceptance on your agreement to\nadditional terms and/or charges for that use). To seek such approval, contact\nthe relevant Google API team for information (e.g. by using the Google\ndevelopers console).\n\n### e. Open Source Software\n\nSome of the software required by or included in our APIs may be offered under\nan open source license. Open source software licenses constitute separate\nwritten agreements. For certain APIs, open source software is listed in the\ndocumentation. To the limited extent the open source software license\nexpressly supersedes the Terms, the open source license instead sets forth\nyour agreement with Google for the applicable open source software.\n\n### f. Communication with Google\n\nWe may send you certain communications in connection with your use of the\nAPIs. Please review the applicable API documentation for information about\nopting out of certain types of communication.\n\n### g. Feedback\n\nIf you provide feedback or suggestions about our APIs, then we (and those we\nallow) may use such information without obligation to you.\n\n### h. Non-Exclusivity\n\nThe Terms are non-exclusive. You acknowledge that Google may develop products\nor services that may compete with the API Clients or any other products or\nservices.\n\n## Section 3: Your API Clients\n\n### a. API Clients and Monitoring\n\nThe APIs are designed to help you enhance your websites and applications (\"API\nClient(s)\"). YOU AGREE THAT GOOGLE MAY MONITOR USE OF THE APIS TO ENSURE\nQUALITY, IMPROVE GOOGLE PRODUCTS AND SERVICES, AND VERIFY YOUR COMPLIANCE WITH\nTHE TERMS. This monitoring may include Google accessing and using your API\nClient, for example to identify security issues that could affect Google or\nits users. You will not interfere with this monitoring. Google may use any\ntechnical means to overcome such interference. Google may suspend access to\nthe APIs by you or your API Client without notice if we reasonably believe\nthat you are in violation of the Terms.\n\n### b. Security\n\nYou will use commercially reasonable efforts to protect user information\ncollected by your API Client, including personally identifiable information\n(\"PII\"), from unauthorized access or use and will promptly report to your\nusers any unauthorized access or use of such information to the extent\nrequired by applicable law.\n\n### c. Ownership\n\nGoogle does not acquire ownership in your API Clients, and by using our APIs,\nyou do not acquire ownership of any rights in our APIs or the content that is\naccessed through our APIs.\n\n### d. User Privacy and API Clients\n\nYou will comply with all applicable privacy laws and regulations including\nthose applying to PII. You will provide and adhere to a privacy policy for\nyour API Client that clearly and accurately describes to users of your API\nClient what user information you collect and how you use and share such\ninformation (including for advertising) with Google and third parties.\n\n## Section 4: Prohibitions and Confidentiality\n\n### a. API Prohibitions\n\nWhen using the APIs, you may not (or allow those acting on your behalf to):\n\n  1. Sublicense an API for use by a third party. Consequently, you will not create an API Client that functions substantially the same as the APIs and offer it for use by third parties.\n  2. Perform an action with the intent of introducing to Google products and services any viruses, worms, defects, Trojan horses, malware, or any items of a destructive nature.\n  3. Defame, abuse, harass, stalk, or threaten others.\n  4. Interfere with or disrupt the APIs or the servers or networks providing the APIs.\n  5. Promote or facilitate unlawful online gambling or disruptive commercial messages or advertisements.\n  6. Reverse engineer or attempt to extract the source code from any API or any related software, except to the extent that this restriction is expressly prohibited by applicable law.\n  7. Use the APIs for any activities where the use or failure of the APIs could lead to death, personal injury, or environmental damage (such as the operation of nuclear facilities, air traffic control, or life support systems).\n  8. Use the APIs to process or store any data that is subject to the International Traffic in Arms Regulations maintained by the U.S. Department of State.\n  9. Remove, obscure, or alter any Google terms of service or any links to or notices of those terms.\n\nUnless otherwise specified in writing by Google, Google does not intend use of\nthe APIs to create obligations under the Health Insurance Portability and\nAccountability Act, as amended (\"HIPAA\"), and makes no representations that\nthe APIs satisfy HIPAA requirements. If you are (or become) a \"covered entity\"\nor \"business associate\" as defined in HIPAA, you will not use the APIs for any\npurpose or in any manner involving transmitting protected health information\nto Google unless you have received prior written consent to such use from\nGoogle.\n\n### b. Confidential Matters\n\n  1. Developer credentials (such as passwords, keys, and client IDs) are intended to be used by you and identify your API Client. You will keep your credentials confidential and make reasonable efforts to prevent and discourage other API Clients from using your credentials. Developer credentials may not be embedded in open source projects.\n  2. Our communications to you and our APIs may contain Google confidential information. Google confidential information includes any materials, communications, and information that are marked confidential or that would normally be considered confidential under the circumstances. If you receive any such information, then you will not disclose it to any third party without Google's prior written consent. Google confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose Google confidential information when compelled to do so by law if you provide us reasonable prior notice, unless a court orders that we not receive notice.\n\n## Section 5: Content\n\n### a. Content Accessible Through our APIs\n\nOur APIs contain some third party content (such as text, images, videos,\naudio, or software). This content is the sole responsibility of the person\nthat makes it available. We may sometimes review content to determine whether\nit is illegal or violates our policies or the Terms, and we may remove or\nrefuse to display content. Finally, content accessible through our APIs may be\nsubject to intellectual property rights, and, if so, you may not use it unless\nyou are licensed to do so by the owner of that content or are otherwise\npermitted by law. Your access to the content provided by the API may be\nrestricted, limited, or filtered in accordance with applicable law,\nregulation, and policy.\n\n### b. Submission of Content\n\nSome of our APIs allow the submission of content. Google does not acquire any\nownership of any intellectual property rights in the content that you submit\nto our APIs through your API Client, except as expressly provided in the\nTerms. For the sole purpose of enabling Google to provide, secure, and improve\nthe APIs (and the related service(s)) and only in accordance with the\napplicable Google privacy policies, you give Google a perpetual, irrevocable,\nworldwide, sublicensable, royalty-free, and non-exclusive license to Use\ncontent submitted, posted, or displayed to or from the APIs through your API\nClient. \"Use\" means use, host, store, modify, communicate, and publish. Before\nyou submit content to our APIs through your API Client, you will ensure that\nyou have the necessary rights (including the necessary rights from your end\nusers) to grant us the license.\n\n### c. Retrieval of content\n\nWhen a user's non-public content is obtained through the APIs, you may not\nexpose that content to other users or to third parties without explicit opt-in\nconsent from that user.\n\n### d. Data Portability\n\nGoogle supports data portability. For as long as you use or store any user\ndata that you obtained through the APIs, you agree to enable your users to\nexport their equivalent data to other services or applications of their choice\nin a way that's substantially as fast and easy as exporting such data from\nGoogle products and services, subject to applicable laws, and you agree that\nyou will not make that data available to third parties who do not also abide\nby this obligation.\n\n### e. Prohibitions on Content\n\nUnless expressly permitted by the content owner or by applicable law, you will\nnot, and will not permit your end users or others acting on your behalf to, do\nthe following with content returned from the APIs:\n\n  1. Scrape, build databases, or otherwise create permanent copies of such content, or keep cached copies longer than permitted by the cache header;\n  2. Copy, translate, modify, create a derivative work of, sell, lease, lend, convey, distribute, publicly display, or sublicense to any third party;\n  3. Misrepresent the source or ownership; or\n  4. Remove, obscure, or alter any copyright, trademark, or other proprietary rights notices; or falsify or delete any author attributions, legal notices, or other labels of the origin or source of material.\n\n## Section 6: Brand Features; Attribution\n\n### a. Brand Features\n\n\"Brand Features\" is defined as the trade names, trademarks, service marks,\nlogos, domain names, and other distinctive brand features of each party.\nExcept where expressly stated, the Terms do not grant either party any right,\ntitle, or interest in or to the other party's Brand Features. All use by you\nof Google's Brand Features (including any goodwill associated therewith) will\ninure to the benefit of Google.\n\n### b. Attribution\n\nYou agree to display any attribution(s) required by Google as described in the\ndocumentation for the API. Google hereby grants to you a nontransferable,\nnonsublicenseable, nonexclusive license while the Terms are in effect to\ndisplay Google's Brand Features for the purpose of promoting or advertising\nthat you use the APIs. You must only use the Google Brand Features in\naccordance with the Terms and for the purpose of fulfilling your obligations\nunder this Section. In using Google's Brand Features, you must follow the\nGoogle Brand Features Use Guidelines. You understand and agree that Google has\nthe sole discretion to determine whether your attribution(s) and use of\nGoogle's Brand Features are in accordance with the above requirements and\nguidelines.\n\n### c. Publicity\n\nYou will not make any statement regarding your use of an API which suggests\npartnership with, sponsorship by, or endorsement by Google without Google's\nprior written approval.\n\n### d. Promotional and Marketing Use\n\nIn the course of promoting, marketing, or demonstrating the APIs you are using\nand the associated Google products, Google may produce and distribute\nincidental depictions, including screenshots, video, or other content from\nyour API Client, and may use your company or product name. You grant us all\nnecessary rights for the above purposes.\n\n## Section 7: Privacy and Copyright Protection\n\n### a. Google Privacy Policies\n\nBy using our APIs, Google may use submitted information in accordance with our\nprivacy policies.\n\n### b. Google DMCA Policy\n\nWe provide information to help copyright holders manage their intellectual\nproperty online, but we can't determine whether something is being used\nlegally or not without their input. We respond to notices of alleged copyright\ninfringement and terminate accounts of repeat infringers according to the\nprocess set out in the U.S. Digital Millennium Copyright Act. If you think\nsomebody is violating your copyrights and want to notify us, you can find\ninformation about submitting notices and Google's policy about responding to\nnotices in our Help Center.\n\n## Section 8: Termination\n\n### a. Termination\n\nYou may stop using our APIs at any time with or without notice. Further, if\nyou want to terminate the Terms, you must provide Google with prior written\nnotice and upon termination, cease your use of the applicable APIs. Google\nreserves the right to terminate the Terms with you or discontinue the APIs or\nany portion or feature or your access thereto for any reason and at any time\nwithout liability or other obligation to you.\n\n### b. Your Obligations Post-Termination\n\nUpon any termination of the Terms or discontinuation of your access to an API,\nyou will immediately stop using the API, cease all use of the Google Brand\nFeatures, and delete any cached or stored content that was permitted by the\ncache header under Section 5. Google may independently communicate with any\naccount owner whose account(s) are associated with your API Client and\ndeveloper credentials to provide notice of the termination of your right to\nuse an API.\n\n### c. Surviving Provisions\n\nWhen the Terms come to an end, those terms that by their nature are intended\nto continue indefinitely will continue to apply, including but not limited to:\nSections 4b, 5, 8, 9, and 10.\n\n## Section 9: Liability for our APIs\n\n### a. WARRANTIES\n\nEXCEPT AS EXPRESSLY SET OUT IN THE TERMS, NEITHER GOOGLE NOR ITS SUPPLIERS OR\nDISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE APIS. FOR EXAMPLE, WE DON'T\nMAKE ANY COMMITMENTS ABOUT THE CONTENT ACCESSED THROUGH THE APIS, THE SPECIFIC\nFUNCTIONS OF THE APIS, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET\nYOUR NEEDS. WE PROVIDE THE APIS \"AS IS\".\n\nSOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.\nEXCEPT AS EXPRESSLY PROVIDED FOR IN THE TERMS, TO THE EXTENT PERMITTED BY LAW,\nWE EXCLUDE ALL WARRANTIES, GUARANTEES, CONDITIONS, REPRESENTATIONS, AND\nUNDERTAKINGS.\n\n### b. LIMITATION OF LIABILITY\n\nWHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE'S SUPPLIERS AND DISTRIBUTORS, WILL\nNOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA; FINANCIAL LOSSES; OR\nINDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.\n\nTO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS\nSUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIM UNDER THE TERMS, INCLUDING FOR ANY\nIMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE APPLICABLE\nAPIS (OR, IF WE CHOOSE, TO SUPPLYING YOU THE APIS AGAIN) DURING THE SIX MONTHS\nPRIOR TO THE EVENT GIVING RISE TO THE LIABILITY.\n\nIN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE\nFOR ANY EXPENSE, LOSS, OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.\n\n### c. Indemnification\n\nUnless prohibited by applicable law, if you are a business, you will defend\nand indemnify Google, and its affiliates, directors, officers, employees, and\nusers, against all liabilities, damages, losses, costs, fees (including legal\nfees), and expenses relating to any allegation or third-party legal proceeding\nto the extent arising from:\n\n  1. your misuse or your end user's misuse of the APIs;\n  2. your violation or your end user's violation of the Terms; or\n  3. any content or data routed into or used with the APIs by you, those acting on your behalf, or your end users.\n\n## Section 10: General Provisions\n\n### a. Modification\n\nWe may modify the Terms or any portion to, for example, reflect changes to the\nlaw or changes to our APIs. You should look at the Terms regularly. We'll post\nnotice of modifications to the Terms within the documentation of each\napplicable API, to this website, and/or in the Google developers console.\nChanges will not apply retroactively and will become effective no sooner than\n30 days after they are posted. But changes addressing new functions for an API\nor changes made for legal reasons will be effective immediately. If you do not\nagree to the modified Terms for an API, you should discontinue your use of\nthat API. Your continued use of the API constitutes your acceptance of the\nmodified Terms.\n\n### b. U.S. Federal Agency Entities\n\nThe APIs were developed solely at private expense and are commercial computer\nsoftware and related documentation within the meaning of the applicable U.S.\nFederal Acquisition Regulation and agency supplements thereto.\n\n### c. General Legal Terms\n\nWe each agree to contract in the English language. If we provide a translation\nof the Terms, we do so for your convenience only and the English Terms will\nsolely govern our relationship. The Terms do not create any third party\nbeneficiary rights or any agency, partnership, or joint venture. Nothing in\nthe Terms will limit either party's ability to seek injunctive relief. We are\nnot liable for failure or delay in performance to the extent caused by\ncircumstances beyond our reasonable control. If you do not comply with the\nTerms, and Google does not take action right away, this does not mean that\nGoogle is giving up any rights that it may have (such as taking action in the\nfuture). If it turns out that a particular term is not enforceable, this will\nnot affect any other terms. The Terms are the entire agreement between you and\nGoogle relating to its subject and supersede any prior or contemporaneous\nagreements on that subject. For information about how to contact Google,\nplease visit our contact page.\n\nExcept as set forth below: (i) the laws of California, U.S.A., excluding\nCalifornia's conflict of laws rules, will apply to any disputes arising out of\nor related to the Terms or the APIs and (ii) ALL CLAIMS ARISING OUT OF OR\nRELATING TO THE TERMS OR THE APIS WILL BE LITIGATED EXCLUSIVELY IN THE FEDERAL\nOR STATE COURTS OF SANTA CLARA COUNTY, CALIFORNIA, USA, AND YOU AND GOOGLE\nCONSENT TO PERSONAL JURISDICTION IN THOSE COURTS.\n\nIf you are accepting the Terms on behalf of a United States federal government\nentity, then the following applies instead of the paragraph above: the laws of\nthe United States of America, excluding its conflict of laws rules, will apply\nto any disputes arising out of or related to the Terms or the APIs. Solely to\nthe extent permitted by United States Federal law: (i) the laws of the State\nof California (excluding California's conflict of laws rules) will apply in\nthe absence of applicable federal law; and (ii) FOR ALL CLAIMS ARISING OUT OF\nOR RELATING TO THE TERMS OR THE APIS, THE PARTIES CONSENT TO PERSONAL\nJURISDICTION IN, AND THE EXCLUSIVE VENUE OF, THE COURTS IN SANTA CLARA COUNTY,\nCALIFORNIA.\n\nIf you are accepting the Terms on behalf of a United States city, county, or\nstate government entity, then the following applies instead of the paragraph\nabove: the parties agree to remain silent regarding governing law and venue.\n\n  * ### Connect\n\n    * Blog \n    * Facebook \n    * Google+ \n    * Medium \n    * Twitter \n    * YouTube \n  * ### Programs\n\n    * Women Techmakers \n    * Agency Program \n    * GDG \n    * Google Developers Experts \n    * Startup Launchpad \n  * ### Developer Consoles\n\n    * Google API Console \n    * Google Cloud Platform Console \n    * Google Play Console \n    * Firebase Console \n    * Cast SDK Developer Console \n    * Chrome Web Store Dashboard \n  * ![Google Developers](https://developers.google.com/_static/e2bf61b32f/images/redesign-14/lockup-color-knockout.png)\n    * Android \n    * Chrome \n    * Firebase \n    * Google Cloud Platform \n    * All Products \n\nSign up for the Google Developers newsletter\n\nSubscribe\n\n"}
